{
  "source_id": "redfin",
  "source_url": "https://www.redfin.com/NY/New-York/60-E-8th-St-10003/unit-31A/home/148704388",
  "external_property_id": "148704388",
  "scraped_timestamp": "2025-10-01T13:53:20Z",
  "status": "ok",
  "title": "Payment calculator",
  "list_price": 1675000,
  "beds": 1.0,
  "baths": 1.0,
  "interior_area_sqft": 975,
  "images": [
    "https://ssl.cdn-redfin.com/photo/211/bigphoto/647/RLS20051647_3.jpg",
    "https://ssl.cdn-redfin.com/photo/211/mbphotov3/647/genMid.RLS20051647_1_3.jpg",
    "https://ssl.cdn-redfin.com/photo/211/mbphotov3/647/genMid.RLS20051647_5_3.jpg",
    "https://ssl.cdn-redfin.com/photo/211/mbphotov3/647/genMid.RLS20051647_2_3.jpg",
    "https://ssl.cdn-redfin.com/photo/211/mbphotov3/647/genMid.RLS20051647_4_3.jpg",
    "https://ssl.cdn-redfin.com/photo/211/mbphotov3/647/genMid.RLS20051647_3_3.jpg",
    "https://ssl.cdn-redfin.com/photo/211/mbphotov3/647/genMid.RLS20051647_6_3.jpg",
    "https://maps.google.com/maps/api/staticmap?sensor=false&style=feature%3Aadministrative.land_parcel%7Cvisibility%3Aoff&style=feature%3Alandscape.man_made%7Cvisibility%3Aoff&style=feature%3Atransit.station%7Chue%3A0xffa200¢er=40.7305852%2C-73.9930316&channel=desktop_xdp_above_fold_static_preview&size=200x200&scale=1&format=jpg&zoom=11&client=gme-redfin&signature=byCF3T15-6VTLpgtqANA4JyHDjQ=",
    "https://ssl.cdn-redfin.com/v595.4.0/images/icons/RatesDrop.svg",
    "https://ssl.cdn-redfin.com/v596.0.0/images/logos/rebny_small.png",
    "https://ssl.cdn-redfin.com/vLATEST/images/apple-app-download-badge-284x84.png",
    "https://ssl.cdn-redfin.com/vLATEST/images/google-app-download-badge-284x84.png",
    "https://ssl.cdn-redfin.com/vLATEST/images/footer/flags/united-states.png",
    "https://ssl.cdn-redfin.com/vLATEST/images/footer/flags/canada.png",
    "https://ssl.cdn-redfin.com/vLATEST/images/footer/equal-housing.png"
  ],
  "description": "SUN-DRENCHED HIGH FLOOR 1BR IN PRIME GREENWICH VILLAGE -- SUBLET FROM DAY ONE!Welcome to this bright and spacious renovated one-bedroom home perched high above beautiful Greenwich Village in a desirable full-service co-op with flexible condo-style rules, including the rare benefit of subletting from day one! Utilize this home as a primary residence, pied-a-terre, or investment. This thoughtfully designed residence features an open-concept layout that seamlessly blends living, dining, and kitchen spaces while maintaining clear separation between each area. The modern warm wood panelling, high ceilings, hardwood floors, and expansive windows enhance the airy feel throughout. As you enter, two large floor-to-ceiling closets offer ample space for coats, shoes, and everyday essentials, keeping your home organized and clutter-free. To the right, an oversized living room easily accommodates generous furniture as well as a dedicated workspace, with a large window providing consistent sunlight and city views. To the left, you'll find the real gem an impressive kitchen looking over an expansive dining area that can easily accommodate a large dining set. This chef's haven was designed with both style and functionality in mind, featuring a gas range, full-sized fridge, microwave, ceiling-height pantry, plus two stacked dishwashers and deep sink for easy cleanup. The space is flanked by the warm wood cabinetry consistent throughout the home, modern clay tiling, durable quartzite countertops, and a bar-height peninsula with seating for more casual meals. Continuing down the hall, find two more floor to ceiling storage closets featuring built in drawers and shelving, leading towards a renovated bathroom featuring stylish but easy-to-clean tiling, a luxurious shower, and a vanity for more storage. This smart layout allows guests to access the bathroom without passing through the adjacent bedroom, preserving your privacy. Turning the opposite direction, and you'll enter the sunny king-sized bedroom, a peaceful retreat with more than enough room for a large bed, nightstands, and dressers. Find a coveted walk-in closet with more convenient built ins to keep your clothing, shoes, and suitcases. This beautiful home is located within Georgetown Plaza, a well-maintained, full-service building offering a 24-hour doorman and professional staff, a fully equipped gym , basement storage, on-site parking with direct access from the building, and a landscaped rooftop deck with a SWIMMING POOL ! Each floor also has dedicated laundry rooms. This central location is unbeatablethe N/R/W and 6 subway lines and numerous bus routes are right outside your door. The building is a short distance to Wegmans, Whole Foods, Washington Square Park, NYU, Astor Place, and Union Square. Plus, you can easily enjoy an endless array of top restaurants, cafs, and boutiques in adjacent neighborhoods like Noho, Soho, and the West Village within moments!With flexible condo-like rules, and immediate subletting allowed, this apartment offers an exceptional opportunity to liveor investin the heart of one of Manhattans most vibrant and sought-after neighborhoods. Inquire with the listing team for a private tour today!Please note these photos are virtually staged.",
  "price_history": [],
  "street_address": "60 E 8th St",
  "postal_code": "10003",
  "city": "New York",
  "state": "NY",
  "unit_number": "31A",
  "listing_id": "8ea06b4d64ffff79dfd5a5c4952faf41",
  "property_id": "cab83dc3c9093e34d6b58f394bc48c13",
  "crawl_method": "firecrawl_v1",
  "batch_id": "2025-10-01_zips91"
}