{
  "source_id": "redfin",
  "source_url": "https://www.redfin.com/NY/New-York/325-Bowery-10003/Ph/home/198102501",
  "external_property_id": "198102501",
  "scraped_timestamp": "2025-10-01T13:53:22Z",
  "status": "ok",
  "title": "Payment calculator",
  "list_price": 4000000,
  "beds": 2.0,
  "baths": 2.0,
  "interior_area_sqft": 121,
  "images": [
    "https://ssl.cdn-redfin.com/photo/211/bigphoto/843/RLS20049843_K.jpg",
    "https://ssl.cdn-redfin.com/photo/211/mbphotov3/843/genMid.RLS20049843_4_K.jpg",
    "https://ssl.cdn-redfin.com/photo/211/mbphotov3/843/genMid.RLS20049843_12_K.jpg",
    "https://ssl.cdn-redfin.com/photo/211/mbphotov3/843/genMid.RLS20049843_6_K.jpg",
    "https://ssl.cdn-redfin.com/photo/211/mbphotov3/843/genMid.RLS20049843_10_K.jpg",
    "https://ssl.cdn-redfin.com/photo/211/mbphotov3/843/genMid.RLS20049843_2_K.jpg",
    "https://ssl.cdn-redfin.com/photo/211/mbphotov3/843/genMid.RLS20049843_8_K.jpg",
    "https://maps.google.com/maps/api/staticmap?sensor=false&style=feature%3Aadministrative.land_parcel%7Cvisibility%3Aoff&style=feature%3Alandscape.man_made%7Cvisibility%3Aoff&style=feature%3Atransit.station%7Chue%3A0xffa200¢er=40.7257162%2C-73.9916803&channel=desktop_xdp_above_fold_static_preview&size=200x200&scale=1&format=jpg&zoom=11&client=gme-redfin&signature=iu8jQwpv7Y6S87686_uTO2q3oic=",
    "https://ssl.cdn-redfin.com/v596.0.0/images/icons/PopularHome.svg",
    "https://ssl.cdn-redfin.com/v596.0.0/images/logos/rebny_small.png",
    "https://ssl.cdn-redfin.com/vLATEST/images/apple-app-download-badge-284x84.png",
    "https://ssl.cdn-redfin.com/vLATEST/images/google-app-download-badge-284x84.png",
    "https://ssl.cdn-redfin.com/vLATEST/images/footer/flags/united-states.png",
    "https://ssl.cdn-redfin.com/vLATEST/images/footer/flags/canada.png",
    "https://ssl.cdn-redfin.com/vLATEST/images/footer/equal-housing.png"
  ],
  "description": "Welcome to Penthouse #4 at 325 Bowery—a show-stopping, sun-drenched loft that redefines downtown living. This newly renovated three-bedroom, two-bathroom residence spans approximately 2,121 square feet. One of only two units in the building, this private duplex home combines soaring volume, architectural detail, and indoor-outdoor living in one of Manhattan’s most iconic neighborhoods at the nexus of Noho, Nolita, and The Bowery. Step into the massive corner great room and take in 15-foot exposed beam ceilings, walls of brick, wide-plank hardwood floors, and dramatic natural light streaming through skylights and oversized windows. A wood-burning fireplace anchors the living space, while open views of treetops, Bond Street, and the downtown skyline elevate the everyday. The chef’s kitchen features sleek custom cabinetry, high-end appliances, and a large breakfast bar that’s equal parts stylish and functional—perfect for hosting or just enjoying a slow Sunday at home. Each bedroom is distinct and filled with character. One skylit bedroom with soaring ceilings makes a dreamy guest space, office, or child’s room. Another secondary bedroom features a cozy lofted nook —ideal for a desk, play zone, or creative retreat. The primary suite is a statement all its own: set on a raised platform lined with south-facing windows, it boasts three closets, a spacious en suite windowed bath, and access to a bonus loft space— 439 square feet of flexible magic that can serve as a gym, studio, nursery, or lounge. And then there's the crown jewel: a 439-square-foot private rooftop terrace with panoramic views stretching downtown to One World Trade. It’s rare, it’s radiant, and it’s all yours. Set in a converted 1900s brick building, The Lofts at 325 Bowery offer authentic downtown loft living with historic charm, boutique scale, and surprisingly low monthlies. Moments from Bond Street and surrounded by the best of downtown cool, you'll have the city’s best dining, culture, and energy at your fingertips—Bar Primi, Il Buco, Lafayette, and Fish Cheeks are literally around the corner. CitiBikes, multiple subway lines (6, B, D, F, M, N, R, W), and everything else that makes New York pulse are right outside your door. This is downtown living turned all the way up.",
  "price_history": [],
  "street_address": "325 Bowery",
  "postal_code": "10003",
  "city": "New York",
  "state": "NY",
  "listing_id": "a0d623d039bc107ea4cc31e5af708342",
  "property_id": "7d14ffed32789686bae77d000250e9fc",
  "crawl_method": "firecrawl_v1",
  "batch_id": "2025-10-01_zips91"
}