{
  "source_id": "redfin",
  "source_url": "https://www.redfin.com/NY/New-York/7-E-17th-St-10003/unit-PHS/home/198139203",
  "external_property_id": "198139203",
  "scraped_timestamp": "2025-10-01T13:53:26Z",
  "status": "ok",
  "title": "Payment calculator",
  "list_price": 6950000,
  "beds": 3.0,
  "baths": 3.5,
  "interior_area_sqft": 820,
  "images": [
    "https://ssl.cdn-redfin.com/photo/211/bigphoto/117/RLS20050117_2.jpg",
    "https://ssl.cdn-redfin.com/photo/211/mbphotov3/117/genMid.RLS20050117_6_2.jpg",
    "https://ssl.cdn-redfin.com/photo/211/mbphotov3/117/genMid.RLS20050117_19_2.jpg",
    "https://ssl.cdn-redfin.com/photo/211/mbphotov3/117/genMid.RLS20050117_10_2.jpg",
    "https://ssl.cdn-redfin.com/photo/211/mbphotov3/117/genMid.RLS20050117_15_2.jpg",
    "https://ssl.cdn-redfin.com/photo/211/mbphotov3/117/genMid.RLS20050117_3_2.jpg",
    "https://ssl.cdn-redfin.com/photo/211/mbphotov3/117/genMid.RLS20050117_13_2.jpg",
    "https://maps.google.com/maps/api/staticmap?sensor=false&style=feature%3Aadministrative.land_parcel%7Cvisibility%3Aoff&style=feature%3Alandscape.man_made%7Cvisibility%3Aoff&style=feature%3Atransit.station%7Chue%3A0xffa200¢er=40.7378555%2C-73.9913424&channel=desktop_xdp_above_fold_static_preview&size=200x200&scale=1&format=jpg&zoom=11&client=gme-redfin&signature=WA63GBvzG6xW84AhWar6Dnv2un4=",
    "https://ssl.cdn-redfin.com/v595.2.0/images/icons/RatesDrop.svg",
    "https://ssl.cdn-redfin.com/v596.0.0/images/logos/rebny_small.png",
    "https://ssl.cdn-redfin.com/vLATEST/images/apple-app-download-badge-284x84.png",
    "https://ssl.cdn-redfin.com/vLATEST/images/google-app-download-badge-284x84.png",
    "https://ssl.cdn-redfin.com/vLATEST/images/footer/flags/united-states.png",
    "https://ssl.cdn-redfin.com/vLATEST/images/footer/flags/canada.png",
    "https://ssl.cdn-redfin.com/vLATEST/images/footer/equal-housing.png"
  ],
  "description": "7 East 17th Street - Penthouse South  Full-Floor Union Square Loft with a Private 2,700 SF Rooftop Oasis  A keyed elevator opens directly into this sprawling 2,820-square-foot Penthouse where pre-war character meets modern design. The 35-foot-wide great room is lined with six oversized arched south-facing windows, flooding the living area and home office with brilliant light. Nearly 11-foot ceilings, wide-plank oak floors, and seamless indoor-outdoor flow create an elegant downtown backdrop.   The open chef's kitchen showcases restaurant-sized Sub-Zero and Wolf appliances, including a six-burner range, steam oven, and commercial-grade proofing oven, all set against striking Carrara marble countertops and backsplash. Three bedrooms each feature en-suite marble baths: the skylit primary suite offers open eastern exposures for all-day light, three walk-in closets, and a spa bath with soaking tub, heated floors, and a Calacatta gold marble slab shower. The second bedroom also enjoys bright eastern views, while the third bedroom has a skylight and queen-size Murphy bed-easily converts between guest room, lounge, or library. In addition, dedicated home office with southern exposure, temperature-controlled wine closet, abundant storage, and a Carrara marble laundry room with half bath complete the thoughtful interior.   An internal staircase rises to the roof through a commercial-grade greenhouse enclosure with an automated temperature-sensor vent that keeps the home naturally cool and ventilated. A striking glass bulkhead overhead allows daylight to cascade down the stairwell.   Above it all awaits a private 2,700-square-foot roof deck-a rare, All-Yours escape from the city grind. Wrapped in mature plantings and wildflowers alive with bees and butterflies, the terrace is served by a drip-irrigation system for effortless maintenance and organized into three distinct entertaining zones:  -Sun Deck with outdoor shower and chaise lounges  - Outdoor Kitchen &  Lounge with built-in Sub-Zero/Wolf grill, refrigerator, and bar for cocktails under the skyline  -Dining  &  Movie Terrace for starlit dinners and open-air screenings beneath the iconic water tower  More than outdoor space, the roof lives like three extra rooms in the sky, surrounded by landmark rooftops and timeless architecture so the city feels privately yours-equally perfect for lively gatherings or a quiet morning with a book.   This boutique pre-war condominium offers a newly renovated lobby, virtual doorman, full-time superintendent, and low monthlies-all moments from Union Square Greenmarket, Madison Square Park, Eataly, and every major subway line.",
  "price_history": [],
  "street_address": "7 E 17th St",
  "postal_code": "10003",
  "city": "New York",
  "state": "NY",
  "unit_number": "PHS",
  "listing_id": "f9e2875a9d5afbfdd8d62a6c36a69a5e",
  "property_id": "caae393bf1bde92866c6d7dee8ad5131",
  "crawl_method": "firecrawl_v1",
  "batch_id": "2025-10-01_zips91"
}