{
  "source_id": "redfin",
  "source_url": "https://www.redfin.com/NY/New-York/227-W-17th-St-10011/unit-7th-Floor/home/198364163",
  "external_property_id": "198364163",
  "scraped_timestamp": "2025-10-01T13:53:32Z",
  "status": "ok",
  "title": "Payment calculator",
  "list_price": 10500000,
  "beds": 5.0,
  "baths": 4.5,
  "interior_area_sqft": 800,
  "images": [
    "https://ssl.cdn-redfin.com/photo/211/bigphoto/865/RLS20051865_2.jpg",
    "https://ssl.cdn-redfin.com/photo/211/mbphotov3/865/genMid.RLS20051865_5_2.jpg",
    "https://ssl.cdn-redfin.com/photo/211/mbphotov3/865/genMid.RLS20051865_17_2.jpg",
    "https://ssl.cdn-redfin.com/photo/211/mbphotov3/865/genMid.RLS20051865_9_2.jpg",
    "https://ssl.cdn-redfin.com/photo/211/mbphotov3/865/genMid.RLS20051865_13_2.jpg",
    "https://ssl.cdn-redfin.com/photo/211/mbphotov3/865/genMid.RLS20051865_3_2.jpg",
    "https://ssl.cdn-redfin.com/photo/211/mbphotov3/865/genMid.RLS20051865_11_2.jpg",
    "https://maps.google.com/maps/api/staticmap?sensor=false&style=feature%3Aadministrative.land_parcel%7Cvisibility%3Aoff&style=feature%3Alandscape.man_made%7Cvisibility%3Aoff&style=feature%3Atransit.station%7Chue%3A0xffa200¢er=40.7411156%2C-73.9994419&channel=desktop_xdp_above_fold_static_preview&size=200x200&scale=1&format=jpg&zoom=11&client=gme-redfin&signature=E-MmZ_qWR7QruSDONjqajl3Wp4I=",
    "https://ssl.cdn-redfin.com/v595.2.0/images/icons/RatesDrop.svg",
    "https://ssl.cdn-redfin.com/v596.0.0/images/logos/rebny_small.png",
    "https://ssl.cdn-redfin.com/vLATEST/images/apple-app-download-badge-284x84.png",
    "https://ssl.cdn-redfin.com/vLATEST/images/google-app-download-badge-284x84.png",
    "https://ssl.cdn-redfin.com/vLATEST/images/footer/flags/united-states.png",
    "https://ssl.cdn-redfin.com/vLATEST/images/footer/flags/canada.png",
    "https://ssl.cdn-redfin.com/vLATEST/images/footer/equal-housing.png"
  ],
  "description": "For the first time ever, this bespoke full-floor loft — designed and reimagined by visionary architect, Charles Gwathmey — comes to market as a true collector’s item. Renowned for his 1992 renovation and expansion of New York’s Guggenheim Museum, Gwathmey infused this 4,800-square-foot residence, created for his son, with his unmistakable modernist touch. Purchased long before Chelsea became the cultural hub it is today, the residence embodies both timeless artistry and museum-quality refinement. A keyed elevator opens directly into a pristine foyer, unfolding to a dramatic great room lined with 14 oversized windows framing sweeping southwestern views . Soaring beamed ceilings , original columns, and pre-war detailing honor the building’s history, while Gwathmey’s minimalist aesthetic infuses the home with serene sophistication. The flexible layout balances scale with intimacy, offering two bedrooms plus a home office, a media room with built-in library shelving, and two and a half baths. Expansive walls provide a gallery-like backdrop for significant art collections, transforming the home into a private exhibition space as much as a residence. The chef’s kitchen marries industrial edge with refined craftsmanship: bespoke oak cabinetry, professional-grade appliances, a monumental steel-topped island, and a discreet glass-enclosed pantry with generous storage and full-sized laundry room. The primary suite is a sanctuary, complete with a massive custom walk-in closet and an extraordinary spa-inspired bath of stone and steel, awash in natural light. A sleek stainless-steel vanity and dramatic gallery-like open space anchor the design, complemented by a glass-enclosed shower and private powder room. The guest suite offers equal distinction, featuring a soaking tub and refined stone finishes. Located at 227 West 17th Street, a boutique eight-story building with only five residences, this offering is as rare as it is remarkable. Residents enjoy a live-in superintendent, secure entry, and close proximity to Chelsea’s acclaimed dining, galleries, the High Line, the Whitney Museum, and the Hudson River Esplanade. Pets permitted; 2% flip tax. This is not simply a loft — it is a once-in-a-generation opportunity to own a piece of architectural history.",
  "price_history": [],
  "street_address": "227 W 17th St",
  "postal_code": "10011",
  "city": "New York",
  "state": "NY",
  "unit_number": "7th-Floor",
  "listing_id": "e5ec937844b1c773e2492c70999b069f",
  "property_id": "e19583c9d2c8c7efc5f38948b335ab81",
  "crawl_method": "firecrawl_v1",
  "batch_id": "2025-10-01_zips91"
}