{
  "source_id": "redfin",
  "source_url": "https://www.redfin.com/NY/New-York/55-W-17th-St-10011/unit-901/home/144054863",
  "external_property_id": "144054863",
  "scraped_timestamp": "2025-10-01T13:53:38Z",
  "status": "ok",
  "title": "Payment calculator",
  "list_price": 2795000,
  "beds": 2.0,
  "baths": 2.5,
  "interior_area_sqft": 652,
  "images": [
    "https://ssl.cdn-redfin.com/photo/211/bigphoto/071/RLS20051071_D.jpg",
    "https://ssl.cdn-redfin.com/photo/211/mbphotov3/071/genMid.RLS20051071_6_D.jpg",
    "https://ssl.cdn-redfin.com/photo/211/mbphotov3/071/genMid.RLS20051071_18_D.jpg",
    "https://ssl.cdn-redfin.com/photo/211/mbphotov3/071/genMid.RLS20051071_10_D.jpg",
    "https://ssl.cdn-redfin.com/photo/211/mbphotov3/071/genMid.RLS20051071_15_D.jpg",
    "https://ssl.cdn-redfin.com/photo/211/mbphotov3/071/genMid.RLS20051071_3_D.jpg",
    "https://ssl.cdn-redfin.com/photo/211/mbphotov3/071/genMid.RLS20051071_12_D.jpg",
    "https://maps.google.com/maps/api/staticmap?sensor=false&style=feature%3Aadministrative.land_parcel%7Cvisibility%3Aoff&style=feature%3Alandscape.man_made%7Cvisibility%3Aoff&style=feature%3Atransit.station%7Chue%3A0xffa200¢er=40.7391961%2C-73.9947104&channel=desktop_xdp_above_fold_static_preview&size=200x200&scale=1&format=jpg&zoom=11&client=gme-redfin&signature=KoFqzpsOu15akNVfR73VjDSEPpc=",
    "https://ssl.cdn-redfin.com/v596.0.0/images/icons/PopularHome.svg",
    "https://ssl.cdn-redfin.com/v596.0.0/images/logos/rebny_small.png",
    "https://ssl.cdn-redfin.com/vLATEST/images/apple-app-download-badge-284x84.png",
    "https://ssl.cdn-redfin.com/vLATEST/images/google-app-download-badge-284x84.png",
    "https://ssl.cdn-redfin.com/vLATEST/images/footer/flags/united-states.png",
    "https://ssl.cdn-redfin.com/vLATEST/images/footer/flags/canada.png",
    "https://ssl.cdn-redfin.com/vLATEST/images/footer/equal-housing.png"
  ],
  "description": "Search Overview Neighborhood Property details Sale & tax history Climate Favorite Hide Share Floor Plans Street View 25 photos For sale $2,795,000 Est. 2 bd • 2.5 ba • 1,652 sq ft It's been viewed 729 times. Tour it before it's gone! Tomorrow: About this home TBD Show more 5 days On Redfin Single-family Property Type 2018 Year Built $1,692 Price/Sq.Ft. $2,172/mo HOA Dues 1 space Parking Listing by Callie Katt Katt • Compass Listing by Kelly Bree • Compass Listing updated: Sep 30, 2025 at 08:17am Redfin checked: 2 minutes ago • Source: REBNY # RLS20051071 Around this home Schools Places Transit All Assigned Nearby 8 /10 Sixth Avenue Elementary School Public, PreK-5 • Assigned • 0.0mi 9 /10 P.S. 41 Greenwich Village Public, PreK-5 • Assigned • 0.3mi 8 /10 PS 3 Charrette School Public, PreK-5 • Assigned • 0.7mi 8 /10 Junior High School 104 Simon Baruch Public, 6-8 • Assigned • 0.8mi Provided by GreatSchools Payment calculator Property details Parking Garage/Carport Information Has Garage Parking Features: Garage Interior Bathroom Information # of Full Bathrooms: 2 # of Half Bathrooms: 1 Room Information # of Rooms (Total): 5 Laundry Information Features: In Unit Equipment Appliances: Cooktop, Dryer, Dishwasher, Freezer, Gas Cooktop, Gas Oven, Range, Refrigerator, Stainless Steel Appliance(s), Wine Cooler, Washer Interior Features Window Features: Window Treatments Unfurnished Flooring: Hardwood Other Features: Breakfast Bar, Built-in Features, Double Vanity, High Ceilings, Kitchen Island, Recessed Lighting, Soaking Tub, Walk-In Closet(s) Exterior Building Information Stories (Total): 19 Building Features: Elevator(s) Lot Information Lot Size Dimensions: 0.000000x0.000000 Property Information Entry Level: 9 Financial Tax Information Annual Amount: $37,092 Utilities Heating & Cooling Has Cooling Cooling: Central Air Has Heating Heating: Central Electricity and solar View estimated energy costs and solar savings for this home Internet View available providers Location Multi Unit Information Pets Allowed: Building Yes, Cats OK, Dogs OK # Of Units Total: 52 Public facts Beds: — Baths: — Finished Sq. Ft.: — Unfinished Sq. Ft.: — Total Sq. Ft.: 1,652 Stories: 19.0 Lot Size: — Style: Condo/Co-op Year Built: 2015 Year Renovated: — County: New York County APN: 08191330 Home facts updated by county records on Aug 6, 2025 Sale and tax history for 55 W 17th St #901 Sale History Tax History Today Sep 24, 2025 Date Listed (Active) REBNY #RLS20051071 $2,795,000 Price Dec, 2022 Dec 10, 2022 Date Price Changed REBNY #RLS10035349 $275,000 Price Mar 21, 2018 Date Price Changed REBNY #RLS10035349 $2,750,000 Price Oct 13, 2017 Date Listed REBNY #RLS10035349 $2,750,000 Price See all property history Join or sign in to view all info Climate risks Most homes have some risk of natural disasters, and may be impacted by climate change due to rising temperatures and sea levels. Flood Factor - Minimal Unlikely to flood in next 30 years Fire Factor - Minimal Unlikely to be in a wildfire in next 30 years Heat Factor - Severe 7 days above 99° expected this year, 15 days in 30 years Wind Factor - Major 27% chance of strong winds in next 30 years Air Factor - Moderate 5 unhealthy days expected this year, 7 days in 30 years View full report Provided by First Street Redfin Estimate for 55 W 17th St #901 Join or sign in to view all info Request showing Tour for free, no strings attached Start an offer Make a winning offer with the help of a local agent Ask a question (516) 665-0863 Nearby similar homes NEW 16 HRS AGO $10,500,000 2 beds 2.5 baths 4,800 sq ft 227 W 17th St Unit 7th Floor, New York, NY 10011 Listing by Sothebys International Realty $2,800,000 3 beds 2 baths — sq ft 69 5th Ave Unit 8G, New York, NY 10003 Listing by Douglas Elliman Real Estate $4,350,000 1 bed 1.5 baths 1,500 sq ft 130 W 12th St Unit 1A, New York, NY 10011 Listing by Corcoran Group NEW CONSTRUCTION $2,600,000 2 beds 2 baths 1,267 sq ft 525 6th Ave Unit 3A, New York, NY 10011 Listing by CORE Group Marketing LLC $6,500,000 3 beds 3.5 baths 3,008 sq ft 166 W 18th St Unit PHB, New York, NY 10011 Listing by Compass $5,395,000 3 beds 3.5 baths 3,300 sq ft 32 W 18th St Unit 7B, New York, NY 10011 Listing by Compass View more homes New listings for sale in 10011 NEW 14 HRS AGO $11,995,000 5 beds 4.5 baths 4,256 sq ft 112 W 13th St, New York, NY 10011 Listing by Compass • Provided by REBNY NEW 16 HRS AGO $10,500,000 2 beds 2.5 baths 4,800 sq ft 227 W 17th St Unit 7th Floor, New York, NY 10011 Listing by Sothebys International Realty • Provided by REBNY NEW 16 HRS AGO $1,495,000 2 beds 1 bath 668,258 sq ft 410 W 24th St Unit 11L, New York, NY 10011 Listing by Sothebys International Realty • Provided by REBNY NEW 20 HRS AGO $5,495,000 3 beds 1.5 baths 2,260 sq ft 173 Macdougal St Unit 3W, New York, NY 10011 Listing by Compass • Provided by REBNY NEW 21 HRS AGO $1,795,000 2 beds 2 baths — sq ft 244 W 23rd St Unit 5B, New York, NY 10011 Listing by Compass • Provided by REBNY NEW 21 HRS AGO $899,000 2 beds 1 bath — sq ft 340 W 19th St #20, New York, NY 10011 Listing by Compass • Provided by REBNY $1,395,000 1 bed 1 bath — sq ft 61 W 9th St Unit 7B, New York, NY 10011 Listing by Corcoran Group • Provided by REBNY $2,700,000 4 beds 2 baths 23,608 sq ft 400 W 23rd St Unit 6JK, New York, NY 10011 Listing by Sothebys International Realty • Provided by REBNY VIDEO TOUR $2,395,000 2 beds 2 baths 1,588 sq ft 250 W 15th St Unit 4CD, New York, NY 10011 Listing by Compass • Provided by REBNY Details provided by REBNY and may not match the public record. Learn more. More real estate resources Zip Codes Cities Neighborhoods Minor Civil Divisions Popular Searches 07024 homes for sale 07302 homes for sale 07047 homes for sale 07306 homes for sale 07307 homes for sale Manhattan homes for sale New York homes for sale Jersey City homes for sale Midtown Manhattan homes for sale Union Square homes for sale Bloomfield Township homes for sale Livingston Township homes for sale West Orange Township homes for sale Millburn Township homes for sale Wayne Township homes for sale Houses for rent in Manhattan Agents near me Yonkers, NY homes for sale Manhattan Housing Market Houses for sale near me New York, NY homes for sale Scarsdale, NY homes for sale Land for sale near me Manhattan, NY homes for sale White Plains, NY homes for sale Open Houses near me Rochester, NY homes for sale Manhattan Property Records Condos for sale near me Buffalo, NY homes for sale NY New Listings Join us Become an Agent Get referrals Careers Find homes faster About us Why Redfin? Community Impact Diversity & Inclusion Life at Redfin Press Investors Blog Real Estate News Find us Contact Us Help Center Advertise Subsidiaries Rent. ApartmentGuide Affiliated Business Rocket Close Rocket Mortgage Countries United States Canada Copyright: © 2025 Redfin. All rights reserved. Updated January 2023: By searching, you agree to the Terms of Use , and Privacy Policy . Do not sell or share my personal information . REDFIN and all REDFIN variants, WALK SCORE, and the R logos, are trademarks of Redfin Corporation, registered or pending in the USPTO. California DRE #01521930 Redfin is licensed to do business in New York as Redfin Real Estate. NY Standard Operating Procedures New Mexico Real Estate Licenses TREC: Info About Brokerage Services , Consumer Protection Notice All mortgage lending products and information are provided by Rocket Mortgage, LLC | NMLS #3030; www.NMLSConsumerAccess.org . Licensed in 50 states . This site is not authorized by the New York State Department of Financial Services for mortgage solicitation or loan applications activities related to properties located in the State of New York. Redfin Corporation is an affiliated business of Rocket Limited Partnership. Each company, and their subsidiaries, are separate legal entities operated and managed through its own management and governance structures. If you are using a screen reader, or having trouble reading this website, please call Redfin Customer Support for help at 1-844-759-7732 . REDFIN IS COMMITTED TO AND ABIDES BY THE FAIR HOUSING ACT AND EQUAL OPPORTUNITY ACT. READ REDFIN'S FAIR HOUSING POLICY AND THE NEW YORK STATE FAIR HOUSING NOTICE . GreatSchools Ratings provided by GreatSchools.org .",
  "price_history": [
    {
      "event_date": "Dec 10, 2022",
      "event_type": "price_change",
      "price": 275000,
      "notes": null
    },
    {
      "event_date": "Mar 21, 2018",
      "event_type": "listed",
      "price": 2750000,
      "notes": null
    },
    {
      "event_date": "Oct 13, 2017",
      "event_type": "listed",
      "price": 2750000,
      "notes": null
    }
  ],
  "street_address": "55 W 17th St",
  "postal_code": "10011",
  "city": "New York",
  "state": "NY",
  "unit_number": "901",
  "listing_id": "89bd3c56e8e0505fa79154df6b543101",
  "property_id": "1c6f11b0a4c2331e483e6d0755b56d79",
  "crawl_method": "firecrawl_v1",
  "batch_id": "2025-10-01_zips91"
}