[
  {
    "listing_id": "50ce2a92dd11ba2dddbf227dcbcbc31d",
    "property_id": "2d844a0004fc6cc97ae1a9046147914b",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/15-Union-Sq-W-10003/unit-5B/home/198364060",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:16Z",
    "listing_type": "sell",
    "status": "ok",
    "title": "Payment calculator",
    "description": "15 Union Square West — Residence 16A rare opportunity to own a dramatic corner three-bedroom, three-and-a-half-bath residence in the iconic 15 Union Square West, once home to Tiffany  &  Co. ’s headquarters. With 16-foot ceilings and soaring arched windows overlooking Union Square Park, this home offers scale, light, and drama that are simply unmatched. The expansive living and dining space flows into a custom chef’s kitchen with professional-grade appliances , marble island , and bespoke finishes —perfect for both entertaining and everyday living. Each bedroom features an en-suite bath with refined stone and wood finishes, while a powder room and full laundry room add convenience.  *  Large Storage Transfers with Unit 15 Union Square West combines historic cast-iron architecture with a modern zinc-and-glass facade, offering full-service luxury and premier amenities, including a 50-foot swimming pool, cold plunge, whirlpool, spa with massage rooms and saunas, fitness center, yoga studio, residents’ lounge, and 24-hour doorman/concierge. Situated directly on Union Square Park, this boutique condominium places you at the center of downtown’s most vibrant neighborhoods. The Union Square Greenmarket, Whole Foods, and some of Manhattan’s best restaurants—including ABC Kitchen, Gramercy Tavern, and Breads Bakery—are at your doorstep. A true transportation hub, the N, Q, R, W, 4, 5, 6, and L trains are just steps away, with the West Village, Flatiron, Gramercy, NoMad, and Washington Square Park all within walking distance. This rare residence offers an unparalleled chance to own a home of this magnitude in Union Square’s most distinguished full-service condominium *  Pictures are virtually staged  * 1% Flip Tax",
    "list_price": 8495000,
    "price_per_sqft": 10005.889281507656,
    "images_count": 15
  },
  {
    "listing_id": "74dea7505c6c2e2a31ef16b8ef689e87",
    "property_id": "8ac07040e08f795d249d51aecfe56802",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/200-E-16th-St-10003/unit-8DE/home/45147270",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:16Z",
    "listing_type": "sell",
    "status": "ok",
    "title": "Payment calculator",
    "description": "Step inside this true two-bedroom two-bathroom in the heart of Gramercy Park.   This home combines the charm of the neighborhood with modern conveniences to offer the best of both worlds. With hardwood floors throughout, the unit also features a renovated windowed kitchen with Sub-Zero and Miele appliances . Step inside this ideal unit and to your left you will find a gracious east facing second bedroom with park views and has two large closets. Past the second bedroom is the corner living room with open south and east views. The primary bedroom features a bathroom en suite with its own private dressing nook.   200 East 16th Street is a full-service building positioned on a tree-lined block. The building is two blocks away from Union Square and major transportation (N, Q, R, W, L, 4,5,6). Westside Market is across the street, Trader Joe's, Whole Foods, Union Square Farmers Market all within a short distance.   There is an operating assessment of & nbsp; $96.43/month scheduled to end 12/31/2025. There is a capital assessment of & nbsp; $482.15/month in effect through July 2030.",
    "list_price": 1650000,
    "price_per_sqft": 3078.3582089552237,
    "images_count": 15
  },
  {
    "listing_id": "817e5e9fcdca179661e9721d1f90e523",
    "property_id": "388d7537e5213917820ae12807df7ffc",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/133-E-15th-St-10003/unit-1B/home/45167283",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:17Z",
    "listing_type": "sell",
    "status": "ok",
    "title": "Payment calculator",
    "description": "This thoughtfully renovated Gramercy pre-war triplex home has style to spare, and features you don't normally find at this price. Just one flight up in an intimate pre-war walk-up co-op, you'll enter the home's lower level. There you'll pass by the half bath with a washer/dryer, two closets, and a good-sized kitchen with a 4-burner Bertazzoni gas stove and oven and a Liebherr refrigerator (a dishwasher may be added with board approval). Climb a few stairs and you're on the middle, main level. You'll be impressed by the 10'3\" ceilings, a dramatic working wood-burning fireplace, hardwood floors, a transom window, and french doors that open to a balcony facing north, over back gardens. The room easily accommodates both living and dining areas. The upper level, with 8' ceilings, is the home of the private sleeping loft and the primary bathroom. This includes a walk-in shower and an interior transom window to let in additional light. Air conditioning throughout is provided by a discreet free-standing unit, though through-wall options may be added with board approval. 133 East 15th Street is a pet-friendly 14 unit co-op built in 1900, with video intercom security. It's close to shopping, Union Square and Gramercy Park; and easily accessible to the 4/5/6, N/Q/R/W, and L trains, several bus lines, and CitiBike stations. Pied-a-terres, guarantors, co-purchasing, parents buying for children, and subletting after two years of residency are permissible with board approval. 1.5% Flip Tax paid by seller.",
    "list_price": 835000,
    "price_per_sqft": 4.751066856330014,
    "images_count": 15
  },
  {
    "listing_id": "1ca4aabfd80993abc009172796e6990c",
    "property_id": "3c42d4519021bd521c4e8c5850f5bbbf",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/205-3rd-Ave-10003/unit-4R/home/45147445",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:17Z",
    "listing_type": "sell",
    "status": "ok",
    "title": "Payment calculator",
    "description": "Discover spacious living and exceptional storage in this beautifully appointed one-bedroom, one-bath residence in one of New York City's most desirable neighborhoods.    & nbsp; The expansive great room is thoughtfully designed to accommodate both living and dining areas, framed by wide north-facing windows that flood the space with natural light. The renovated kitchen is a chef's delight, offering full-size appliances-including a gas range and dishwasher, ample counter space , glass subway tile backsplash , and abundant cabinetry. The tranquil bedroom includes its own windows and flows into a dressing area with generous custom closet space. Beyond, the updated bathroom features a full bathtub. Throughout the home, hardwood floors add warmth and elegance, while additional closets at the entry provide even more storage.   All utilities are included in the maintenance fee-no monthly electric bills.   Gramercy Park Towers is a premier post-war cooperative offering a 24-hour doorman and concierge, state-of-the-art fitness center, peaceful Zen garden, on-site parking, bike storage, and an impressive roof deck with panoramic views of Manhattan. Ideally situated near Union Square and the Flatiron District, you'll have world-class dining, shopping, entertainment, and cultural venues just steps away, along with easy access to the N/Q/R, 4/5/6, and L subway lines.    & nbsp; Please note: pieds- & agrave; -terre are not permitted.   & nbsp; Pets are welcome!",
    "list_price": 735000,
    "price_per_sqft": 10.233633148617415,
    "images_count": 15
  },
  {
    "listing_id": "911862666fe49d803c97a802d5acf8a2",
    "property_id": "2ad2a333129768bc5d18a5b492be0fae",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/70-E-10th-St-10003/unit-20C/home/198362175",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:17Z",
    "listing_type": "sell",
    "status": "ok",
    "title": "Payment calculator",
    "description": "RARELY AVAILABLE OVERSIZED 1-BEDROOM, 1-BATHROOM WITH SWEEPING VIEWS & nbsp;  Perched on the 20th floor of the legendary Stewart House, this 1,108 SF residence offers abundant natural light, open city views, and generous proportions rarely found in Greenwich Village.   & nbsp;  An expansive entry foyer doubles as a versatile home office, flowing into an incredible 33-foot great room with a large dining alcove. The windowed chef's kitchen features stainless steel appliances, bespoke cabinetry, and blue quartz countertops.   & nbsp;  The oversized bedroom suite easily accommodates a king-sized bed and additional furniture, with bright eastern exposures. The bathroom is pristine, with a custom vanity and shower/tub combination. Four walk-in closets provide exceptional storage throughout.   & nbsp;  RESIDENCE HIGHLIGHTS  & nbsp; - & nbsp; 1,108 SF of interior living space - Expansive living room with a separate dining alcove - Windowed chef's kitchen - Open city views that overlook Astor Place to the Williamsburg Bridge - Spacious entry foyer/home office - 4 walk-in closets - Hardwood flooring - Central heating/cooling via PTAC systems  & nbsp;  The Stewart House is a white-glove, full-service cooperative with a reputation for exceptional service and financial stability. Residents enjoy: - 24-hour doorman, live-in superintendent, on-site resident manager - Landscaped circular driveway and entry garden - Fitness center - Children's playroom - Resident-only garden with comfortable seating and table areas - Bike room - Two laundry facilities - Package room - Additional storage units available for rent - On-site garage with direct building access  & nbsp;  Trust ownership and guarantors are permitted, with gifting permitted on a case-by-case basis.   Prudent financial management has allowed the co-op to maintain low maintenance fees while investing millions to enhance both residents' quality of life and shareholder value.   & nbsp;  Situated at the crossroads of Greenwich Village, Union Square, and Washington Square Park, The Stewart House offers immediate access to the city's best dining, shopping, and cultural destinations, as well as multiple subway lines. Wegmans, Trader Joe's, and Whole Foods are all within minutes.   & nbsp;  Residence 20C presents a rare opportunity to own a spacious, light-filled home in one of Greenwich Village's most sought-after cooperatives.",
    "list_price": 1495000,
    "price_per_sqft": 13842.592592592593,
    "images_count": 15
  },
  {
    "listing_id": "d9c47a9430c95c0df81bc6bc760c42b2",
    "property_id": "11227af67eb526593e3408c6cd2b6739",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/111-4th-Ave-10003/unit-3I/home/45142411",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:18Z",
    "listing_type": "sell",
    "status": "ok",
    "title": "Payment calculator",
    "description": "Greenwich Village  Corner 2-Bed, 1-Bath Loft  This bright corner loft offers soaring 13+ foot concrete ceilings, 9 oversized 10' casement windows facing North, East, West, and sweeping views of Union Square Park, Grace Church, classic water towers, and surrounding architectural landmarks.   The open chef's kitchen features a black granite breakfast bar , stainless steel appliances , granite countertops , oak cabinetry , and a sleek stainless steel backsplash. The spa-like bath includes a soaking tub, Roman bath tiles, Italian limestone, and Kohler fixtures.   Both bedrooms are well-proportioned with excellent storage, complemented by abundant wall space for art. Additional highlights include Brazilian teak floors, custom window treatments, dual-zone central heating and air conditioning, and Quantum Thermal windows for superior insulation and soundproofing.   With low monthly maintenance, this residence blends comfort, style, and value in one of Manhattan's most desirable neighborhoods.   The International Tailoring Loft Building Amenities -Full-service building with 24-hour doorman and live-in super -Charming north- and south-facing roof decks -Updated Central AC/Heat -Laundry on every floor -Private Storage -Bike Storage -Private Parking Lot Neighborhood Convenience Grocery: Whole Foods, Trader Joe's, Union Square Farmers Market Transportation: 4/5/6, N/Q/W/ R, and L trains Fitness: Equinox, Crunch, F45, Barry's Bootcamp, Soul Cycle, Reformers Pilates",
    "list_price": 1550000,
    "price_per_sqft": null,
    "images_count": 15
  },
  {
    "listing_id": "aa9184c36831dcaa336242b72fc7fdbc",
    "property_id": "3c0b995accebe9e43c5f338d5f55afc9",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/125-E-4th-St-10003/unit-26/home/176353603",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:18Z",
    "listing_type": "sell",
    "status": "ok",
    "title": "Payment calculator",
    "description": "& nbsp;   & nbsp;  Discover this beautifully renovated           2-bedroom, 1-bathroom apartment located in the heart of           Manhattan's East Village. Situated on the           top floor of a classic prewar walk-up building, this sun-filled home combines timeless architectural charm with modern upgrades-making it a rare find in one of NYC's most vibrant neighborhoods.  Step inside to find original prewar details throughout, including           restored moldings, hardwood floors, high ceilings (9'8\"), and           transom windows that reflect the character of historic New York City. The windowed kitchen has been tastefully updated with           full-size stainless steel appliances, including a           dishwasher, and offers ample counter and cabinet space-ideal for home cooks.  The           primary bedroom is generously sized and features a stunning           view of the Empire State Building. The second bedroom offers flexibility-it fits a full-sized bed and includes a spacious closet , Giving flexabilty of use for guest bed, home office or nursery. & nbsp;  Additional highlights include a windowed bathroom , excellent light throughout, and a quiet interior location within the building. The apartment is located on the           6th floor (walk-up), providing privacy, quiet, and light-well worth the climb.  This boutique           East Village co-op building offers a           live-in porter, central laundry room, and           bike storage. It's           pet-friendly and allows for           subletting after a specified period (please inquire for details).  Located near           Astor Place, St. Mark's Place, and           NYU, this home is just moments from multiple subway lines (          F/M, 6, N/R/W) and close to           Whole Foods, Trader Joe's, Tompkins Square Park, and some of the best dining, shopping, and nightlife in downtown Manhattan.   & nbsp;",
    "list_price": 649000,
    "price_per_sqft": 5643.478260869565,
    "images_count": 15
  },
  {
    "listing_id": "5972bcc029c695ea15fac21ad6db7515",
    "property_id": "ce2d5a29358113784828ccb91681f3e4",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/201-E-15th-St-10003/unit-4H/home/198298690",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:18Z",
    "listing_type": "sell",
    "status": "ok",
    "title": "Payment calculator",
    "description": "Don't miss this blank-canvas Gramercy bargain, priced for a fast sale! & nbsp; A rare opportunity to update a clean 1BR estate unit, on a sought-after tree-lined block . & nbsp; With Stuyvesant Square at the next corner, it's perfectly situated between the East Village, Gramercy Park and Union Square. The airy H-line one-bedroom apartments make well-proportioned homes featuring a large living/dining area, a king-sized bedroom , and abundant closet space . Updated units in the H line have sold for between $725,000 and $775,000, so 4H is priced to provide the lucky buyer with the option of investing in contemporary upgrades or merely adding fresh appliances to the kitchen for immediate occupancy. Shabby kitchen appliances have been removed; shiny new Friedrich wall-through air conditioners have been installed.   This well-managed and maintained, & nbsp; pet friendly , elevator co-op offers a live-in superintendent , storage, garage, bike room, video intercom and app, fob entry, and updated lobby. & nbsp; Co-purchasing, gifting, pied- & agrave; -terres, and subletting are permitted. Steps away from Trader Joe's, West Side Market, Whole Foods, Union Square Greenmarket and the best transit hub in Manhattan. Enjoy easy access to great gyms, restaurants, shopping, and entertainment. Don't hesitate to schedule your showing - with rents and stocks at all-time highs and mortgage rates easing, now is the time to capture this exceptional value.",
    "list_price": 550000,
    "price_per_sqft": 647.8209658421673,
    "images_count": 13
  },
  {
    "listing_id": "8ff993e028ff740c54d2c1dd1d8be612",
    "property_id": "c68c56b2ab36596a6ddd31a800bc2d23",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/81-Irving-Pl-10003/unit-15DE/home/45146464",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:19Z",
    "listing_type": "sell",
    "status": "ok",
    "title": "Payment calculator",
    "description": "THORTON WILDER (OUR TOWN) LIVED IN THIS HOME  &  WROTE THIS ABOUT IT: ?  \"My new apartment is 81 Irving Place. .. I've lived five days in my New York home and am already flooded with a new overwhelming feeling about New York. \" Thornton Wilder referencing Residence 15DE, in a letter to Gertrude Stein and Alice Toklas, November 18, 1939. LUMINOUS  &  LITERARY, TRIPLE CORNER CLASSIC w/ STUNNING VIEWS IN THREE DIRECTIONS BY GRAMERCY PARK BIG BEAUTIFUL ROOMS, CASEMENT WINDOWS, SOARING CEILINGS, RESTORED PERIOD DETAIL AT PRIZED PRE-WAR ADDRESS High atop Irving Place is perched a Manhattan treasure. This magical home, with majestic views in three directions, and cheerful sunshine spilling through its handsome casement windows, floats above it all. With a prized vantage point to its coveted building's famous gargoyles and gorgeous architecture, a rare, soulful home unfolds. Above you soar high beamed ceilings and arches, underfoot are hardwood floors, and everywhere you look, there is classic, timeless beauty.  The grand living room is an impressive, stretch-out entertaining space. A corner room with supreme, open city skyline views to the East and South, the living room lives largely. Offering a dining area under its signature arched ceiling, and an endearing, corner, period built-in (ideal for collectibles and books), this great room certainly earns the name. Served by a sweet windowed kitchen, the living/dining room brings all day sunshine and all night moonbeams.  Both bedrooms are large and lovely, offer dual exposures and bright views, and are gracefully on opposite ends of this winsome home. The primary bedroom is king-sized, offers peeks of Gramercy Park to the South and dramatic city views East. With an immense wall of closets, an integrated workspace, and an en suite windowed bath, this space is masterful. On the other side of this standout residence is the large guest bedroom suite. With two bright exposures, more architectural views of the building's prized gargoyles, and its own full, en suite guest bath, this versatile bedroom is made for an expansive life.  Ideally situated in the heart of the Gramercy Park neighborhood, 81 Irving Place is an architecturally distinguished and incredibly well-run full-service prewar cooperative building with a live-in Superintendent, attended lobby, laundry room, and a bicycle storage room. The location grants residents enviable proximity to Union Square Park, its farmer's market, and the culinary epicenter of New York City. The building permits dogs, sublets, parental co-purchases, and pied a terre owners.  Supremely situated in perhaps the most treasured part of 81 Irving, this rare, one-of-a-kind home gleams proudly. Part of the Gramercy Park Historic District, this rare, resplendent residence enjoys all of the supreme assets and benefits of its well-served, well-run building. With a seasoned staff, and a world-class location along one of Manhattan's most idyllic and sought-after tree-lined blocks, here is a 1929 beauty in a location that comes with bragging rights. Nearby is every downtown trophy destination:  A multitude of cultural, shopping, dining, educational, entertainment, and fitness destinations are at your doorstep -- not to mention Gramercy Park, Union Square Park (and green market), Park Avenue South, Whole Foods, Trader Joe's, and a plethora of easy transportation options.  Thorton Wilder apparently loved his life in this home. It's easy to understand why. Come discover this residential stand-out, and be \"flooded with a new overwhelming feeling about New York. \" Flip Tax: 3% of Purchase Price to be Paid by Purchaser.",
    "list_price": 1650000,
    "price_per_sqft": 1943.4628975265018,
    "images_count": 15
  },
  {
    "listing_id": "76b0437d39445c0dfccb881bfd3c92c0",
    "property_id": "3ab4a65c5ab549c3693c9c000aed1ced",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/111-4th-Ave-10003/unit-2E/home/198306258",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:19Z",
    "listing_type": "sell",
    "status": "ok",
    "title": "Payment calculator",
    "description": "14-foot ceilings , tall windows with abundant light and great city views , including the Grace Church steeple. Award-winning architect-designed . Cozy wood finishes . 1-FLEX bedroom apartment, usable as one (1) full bedroom and one (1) additional area usable as flex space.",
    "list_price": 1880000,
    "price_per_sqft": 9400.0,
    "images_count": 14
  },
  {
    "listing_id": "93302fb8910e7ca885eadbd9b914a1ca",
    "property_id": "82d66e668df398fd80565992fc2c92bd",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/88-E-3rd-St-10003/unit-18/home/53324859",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:19Z",
    "listing_type": "sell",
    "status": "ok",
    "title": "Payment calculator",
    "description": "Perfectly positioned just off First Avenue on East 3rd Street, this residence offers a rare blend of serenity and character. Overlooking the storied Marble Garden, the home is a peaceful sanctuary imbued with pre-war charm, featuring exposed brick walls , original hardwood floors , and luminous south-facing windows that bathe the interiors in natural light throughout the day. Thoughtfully updated, the home maintains its historic integrity while offering the comforts of modern living. Set within an intimate cooperative, residents enjoy access to a beautifully landscaped shared garden complete with communal seating and a grill , ideal for entertaining or unwinding in the open air. Situated moments from the 2nd Avenue subway and a rich tapestry of local cafes, boutiques, and culture, the location offers both convenience and community. Additional Highlights:  Co-purchasing and gifting permitted  Subletting allowed after two years with board approval  Monthly assessment of $173.58 currently in place for capital improvements  This is an opportunity to own a piece of the East Village that feels truly personal, warm, welcoming and quietly sophisticated. Photos are virtually staged to inspire.",
    "list_price": 475000,
    "price_per_sqft": 2553.7634408602153,
    "images_count": 13
  },
  {
    "listing_id": "04aa9340799f02a766f626ef5e1d4017",
    "property_id": "6a21fa33e334531ddb02b72fdd1e0a52",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/23-E-10th-St-10003/unit-3C/home/45201501",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:19Z",
    "listing_type": "sell",
    "status": "ok",
    "title": "Payment calculator",
    "description": "This Greenwich Village 1BR loft in a pre-war doorman building checks all the boxes of a classic downtown apartment. Exposed brick and an 8 foot wall of windows frame the view onto tree-lined 11th Street. The soaring 11 foot ceilings and large rooms create a true sense of volume. This completely renovated home features an oversized kitchen with a Bosch appliance suite, in-unit Washer/Dryer, upgraded windows, spacious and customized closets, and a beautiful bathroom. The apartment is truly move-in ready. The Albert is a full service pre-war cooperative on a beautiful, tree-lined Greenwich Village block. The building has 24 hour door staff, a Resident Manager, full time handyman, porters, a renovated lobby, bike storage and a beautifully landscaped and furnished roofdeck. Reasonable board allows parental purchase, pied-a-terre, and pets. The building has recently undergone a beautiful hallway renovation, and the latest Local Law facade work is also now complete! Located halfway between Union Square and Washington Square Park, The Albert is close to multiple major subway lines, cultural attractions, shopping, NYU, the Union Square Greenmarket, and all the other conveniences which have made Greenwich Village New York City's preferred neighborhood for more than a century.",
    "list_price": 1100000,
    "price_per_sqft": 1295.6419316843346,
    "images_count": 15
  },
  {
    "listing_id": "8ea06b4d64ffff79dfd5a5c4952faf41",
    "property_id": "cab83dc3c9093e34d6b58f394bc48c13",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/60-E-8th-St-10003/unit-31A/home/148704388",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:20Z",
    "listing_type": "sell",
    "status": "ok",
    "title": "Payment calculator",
    "description": "SUN-DRENCHED HIGH FLOOR 1BR IN PRIME GREENWICH VILLAGE -- SUBLET FROM DAY ONE!Welcome to this bright and spacious renovated one-bedroom home perched high above beautiful Greenwich Village in a desirable full-service co-op with flexible condo-style rules, including the rare benefit of subletting from day one! Utilize this home as a primary residence, pied-a-terre, or investment. This thoughtfully designed residence features an open-concept layout that seamlessly blends living, dining, and kitchen spaces while maintaining clear separation between each area. The modern warm wood panelling, high ceilings, hardwood floors, and expansive windows enhance the airy feel throughout. As you enter, two large floor-to-ceiling closets offer ample space for coats, shoes, and everyday essentials, keeping your home organized and clutter-free. To the right, an oversized living room easily accommodates generous furniture as well as a dedicated workspace, with a large window providing consistent sunlight and city views. To the left, you'll find the real gem an impressive kitchen looking over an expansive dining area that can easily accommodate a large dining set. This chef's haven was designed with both style and functionality in mind, featuring a gas range, full-sized fridge, microwave, ceiling-height pantry, plus two stacked dishwashers and deep sink for easy cleanup. The space is flanked by the warm wood cabinetry consistent throughout the home, modern clay tiling, durable quartzite countertops, and a bar-height peninsula with seating for more casual meals. Continuing down the hall, find two more floor to ceiling storage closets featuring built in drawers and shelving, leading towards a renovated bathroom featuring stylish but easy-to-clean tiling, a luxurious shower, and a vanity for more storage. This smart layout allows guests to access the bathroom without passing through the adjacent bedroom, preserving your privacy. Turning the opposite direction, and you'll enter the sunny king-sized bedroom, a peaceful retreat with more than enough room for a large bed, nightstands, and dressers. Find a coveted walk-in closet with more convenient built ins to keep your clothing, shoes, and suitcases. This beautiful home is located within Georgetown Plaza, a well-maintained, full-service building offering a 24-hour doorman and professional staff, a fully equipped gym , basement storage, on-site parking with direct access from the building, and a landscaped rooftop deck with a SWIMMING POOL ! Each floor also has dedicated laundry rooms. This central location is unbeatablethe N/R/W and 6 subway lines and numerous bus routes are right outside your door. The building is a short distance to Wegmans, Whole Foods, Washington Square Park, NYU, Astor Place, and Union Square. Plus, you can easily enjoy an endless array of top restaurants, cafs, and boutiques in adjacent neighborhoods like Noho, Soho, and the West Village within moments!With flexible condo-like rules, and immediate subletting allowed, this apartment offers an exceptional opportunity to liveor investin the heart of one of Manhattans most vibrant and sought-after neighborhoods. Inquire with the listing team for a private tour today!Please note these photos are virtually staged.",
    "list_price": 1675000,
    "price_per_sqft": 1717.948717948718,
    "images_count": 15
  },
  {
    "listing_id": "4b0f3bc920b95de815f9bec902c707d1",
    "property_id": "b593486153e7398f1a2b5d430fef0e16",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/23-Waverly-Pl-10003/unit-4R/home/45141864",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:20Z",
    "listing_type": "sell",
    "status": "ok",
    "title": "Payment calculator",
    "description": "LOFT-LIKE STUDIO with HIGH CEILINGS at 11' and OVERSIZED WINDOWS and EXPOSED BRICK adding Charm to the Entire Apartment. & nbsp;   & nbsp; A Renovated Kitchen with Stainless Appliances & nbsp; and Granite Counters make at home meals easy to prepare. & nbsp; In addition a Built-in Murphy Bed gives you more space in your Living/Dining Area. & nbsp; A Lofted Area with 4' headroom adds either a guest sleeping area or more storage space. & nbsp; In addition an enormous Walk-in Closet offers you the extra storage for all your daily storage needs and a Newly Renovated Bathroom makes this apartment Move-In Ready. & nbsp; The Building has a Beautifully Planted Roof Deck and is completing its long awaited Courtyard Project. & nbsp; Also Washer/Dryers on every floor and & nbsp; a Helpful and Friendly Super and His Assistant for all your needs.   & nbsp; Waverly Place is in a Prime Village Location providing easy access to great shopping along University Avenue just around the corner and the newer and large Wegman's offering a great take out food section as well as a large Supermarket on the lower level. & nbsp; In addition all major subway lines are easily accessible. & nbsp; Pets are welcomed in this Building.  Email or call for immediate appointments to view this move-in ready Apartment. & nbsp; Your New Home Awaits You in this Incredible Downtown Location.",
    "list_price": 679000,
    "price_per_sqft": 1234.5454545454545,
    "images_count": 13
  },
  {
    "listing_id": "fcdff234219ab5193ffa0eb183bbc635",
    "property_id": "86b1968cb6ee51e79bdea8d7d5332b59",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/67-E-11th-St-10003/unit-606/home/198292524",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:20Z",
    "listing_type": "sell",
    "status": "ok",
    "title": "Payment calculator",
    "description": "Roomy high floor Greenwich Village studio with a terrace at the historic Cast Iron Building . The apartment has a large living area along with a walk-in closet, full bath, second closet, built-in HVAC, and a private terrace . The kitchen is ready for your personal touch, with all connections available for your choice of appliances and cabinetry. There are an abundance of storage options and hardwood floors throughout. The long entrance hallway is perfect for a row of bookshelves for your personal library. The Cast Iron Building is a full-service pre-war co-op with a full time doorman and resident superintendent. Building amenities include a landscaped roof deck with iconic NYC views , common laundry room , bike room, gym and private storage. Sublets, gift purchasing, guarantors, co-purchasing and pied-a-terres are allowed on a case-by-case basis. Pets are allowed. 80% financing is permitted. In the heart of Greenwich Village, the building lies between Union Square and Washington Square Park with many transportation options. Nearby shopping options include Wegmans, Whole Foods, Trader Joes, and the iconic Strand Book Store. There are a multitude of dining, caf, cinema and nightlife options to suit your lifestyle.",
    "list_price": 640000,
    "price_per_sqft": 1422.2222222222222,
    "images_count": 12
  },
  {
    "listing_id": "5a0b3ed7a9923a411ae6c03e6709b2a7",
    "property_id": "b801abdf88049104ecae03c1e25bcd1d",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/11-5th-Ave-10003/unit-8AB/home/45142241",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:21Z",
    "listing_type": "sell",
    "status": "ok",
    "title": "Payment calculator",
    "description": "Contemporary Gold Coast elegance awaits in this beautifully gut-renovated two-bedroom, two-bathroom co-op, featuring a concealed home office , laundry room, oversized bonus room , central air-conditioning and two storage units . Meticulously designed with thoughtful details, this impressive Greenwich Village residence is situated in an esteemed full-service building just one block from Washington Square Park. Inside this seamlessly combined showplace, ceilings with recessed and designer light fixtures rise above engineered French white oak flooring and custom millwork . A gracious foyer, lined with rows of closets with picture-frame molding, sets the tone for the designer style and abundant storage found throughout. To the right, a hidden home office offers two large built-in desks, granite counters, and custom cabinetry, providing an ideal workspace. The expansive great room stretches nearly 24 feet long, offering generous space for seating and dining areas. North-facing windows overlook the quiet interior courtyard, creating a serene ambiance. The open gourmet kitchen is a chef’s dream, featuring floor-to-ceiling pantries, full-featured custom cabinetry, quartzite countertops, and Thassos-honed marble tile. State-of-the-art stainless steel appliances include a four-burner gas cooktop and dual convection smart oven by Wolf, a custom range hood, a 48-inch Sub-Zero refrigerator, a Miele dishwasher, and a concealed microwave, with space to add a wine refrigerator. The primary suite boasts king-size proportions, corner windows, and a wall of built-in wardrobes with Restoration Hardware pulls. The en-suite bathroom showcases striking Akdo Origami Burokku Zebra floor tiles, a wide double vanity with zebra marble counters and Newport Brass fixtures, and a Kohler tub/shower. A spacious second bedroom, located in this wing, offers comfort and flexibility. Adjacent is an oversized bonus room with a closet and shelving, perfect for use as a large den, gym, or guest room. The sizable utility room is well-equipped with a full-sized Whirlpool washer and vented dryer, cabinetry, hanging rods, and a Franke sink, making laundry day effortless. A well-appointed guest bathroom features a frameless glass shower, Toto washlet, custom vanity, and a Robern medicine cabinet. Extensive smart-home upgrades throughout the unit provide intuitive control of temperature, lighting, and security. Enjoy soft-close pocket doors, Marvel cabinetry in the kitchen and baths, Lutron motorized shades, dimmable overhead and cabinet lighting, Nest thermostats, a Schlage smart entry door lock, multiple cable and Ethernet ports, and optimized Wi-Fi. This home also conveys with two deeded storage units. The Brevoort is a highly regarded postwar cooperative with attentive staff, including a 24-hour doorman/concierge and a resident manager. Residents enjoy a grand lobby with gardens, a gym, on-site parking, laundry, storage, a bike room, and updated common areas. The building prioritizes sustainability with upgraded windows, a co-generation electrical system, natural gas, and planted rooftops. Maintenance includes basic cable. Pets, pieds-à-terre, gifting, parents buying for working children, in-unit washer/dryers, and up to 60% financing are permitted with board approval. Set in the heart of the Greenwich Village Historic District, this location offers unparalleled access to world-class shopping, dining, and entertainment. Explore the lush landscapes and farmers’ markets at Union Square and Washington Square Park, or enjoy award-winning restaurants like Blue Hill and Carbone. With NYU, jazz and comedy clubs, and multiple subway lines—including the A/C/E, B/D/F/M, 1/2/3, 4/5/6, N/Q/R/W, and L—plus PATH trains, excellent bus service, and CitiBike stations nearby, transportation is effortless in this central downtown location.",
    "list_price": 2895000,
    "price_per_sqft": 3409.893992932862,
    "images_count": 15
  },
  {
    "listing_id": "1f1a1434460de2e8aa850e2672f81595",
    "property_id": "ac83976e39599b6a96bc1be11430fa5a",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/64-E-1st-St-10003/unit-TH1/home/169649459",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:21Z",
    "listing_type": "sell",
    "status": "ok",
    "title": "Payment calculator",
    "description": "A true private and secluded home in prime downtown Manhattan. The townhouse at 64 East 1st sits on a quaint East Village block offering over 3,300 sqft of seamless indoor/ outdoor living . The home is comprised of two bedrooms, two full bathrooms, a powder room, private terrace and garden. Upon walking into this space you are welcomed by bespoke finishes , sizable bedrooms and floor to ceiling windows leading to the stunning garden space . Thanks to the current owner's tasteful and recent renovation, this home now offers custom millwork in all closets, automated shades, Nest thermostats, sub-zero wine fridge and a stunning natural stone fireplace with inset TV. The beautifully landscaped back yard offers mature plantings, irrigation system, mahogany wall panels and dramatic custom lighting. The great room encompasses just over 23' x 23' of living space and is set apart by floor-to-ceiling casement windows which elevate and showcase the true quality of these lofts. The entire space has smart home integration and additional storage throughout. The vast open layout and large windows allow for abundant natural light to pour in, and ceiling heights maximized by revealing the structural beams. This home is defined by its polished materials, expansiveness and natural light. The kitchen offers sleek design and features such as Stevali European-style cabinetry, a Pental quartz countertop accented by an Artistic Tile backslash, Wolf Dual-Fuel Range, Sub-Zero bottom mount refrigerator, microwave drawer and Bosch dishwasher. The master suite is an inviting haven for clean simplicity and offers sizable dimensions, with an en-suite bathroom comprised of classic design elements like subway tiles, floating cabinetry, all-nickel plumbing hardware with cross handles and escutcheon plates from Waterworks' distinctive Ludlow collection. Resident amenities include in-residence vented washer and dryer, a Virtual Doorman by ButterflyMX – offering secure smartphone-based video technology that allows residents to monitor guests and deliveries from their own handheld device – and an on-site fitness center with an entertainment system and equipment by Gym Source.",
    "list_price": 3350000,
    "price_per_sqft": 3526.315789473684,
    "images_count": 15
  },
  {
    "listing_id": "5cbd6ba2b2d859f68571a5b52784db3c",
    "property_id": "a29245289fc79b9a526478845c66df70",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/1-5th-Ave-10003/unit-12H/home/102004310",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:21Z",
    "listing_type": "sell",
    "status": "ok",
    "title": "Payment calculator",
    "description": "A One-Bedroom Jewel at One Fifth Avenue  APARTMENT From the moment you step into this one-bedroom perfectly positioned on the 12th floor, the views steal the show. Imagine waking up high above Greenwich Village, where the morning light streams through your windows and the city unfolds before you. Facing south, the unobstructed view through your windows frame Washington Square Park , the Freedom Tower , and the endless city beyond—an ever-changing backdrop that feels almost cinematic. Sunlight pours in all day. The living room is a sun-drenched haven, where custom bookcases invite you to curl up with a favorite novel and watch the city below. The kitchen, with its glass-front cabinetry , stone counters , and black-and-white penny tile, brings charm and character to everyday rituals, whether preparing a quiet breakfast or hosting friends for dinner. In the bedroom, you wake up to the same sweeping skyline vistas, with ample closets keeping everything neatly tucked away. The bathroom is a spa-like retreat, wrapped in marble with a sleek stall shower and Waterworks fixtures. This is more than just a home—it’s a front-row seat to the Village, in one of New York’s most iconic buildings. BUILDING Located at the start to Fifth Avenue, just north of Washington Square Park, One Fifth Avenue is among the most sought-after residences in downtown Manhattan. Built in 1929 as a luxury hotel by architect Harvey Wiley Corbett, this 27-story landmark building has since been transformed into one of the Village’s most prestigious full-service cooperatives. Residents are welcomed by a magnificent two-story lobby and enjoy the convenience of 24-hour doormen, a live-in superintendent, attentive staff, central laundry, private storage, and a resident lounge overlooking the lobby. Pets are welcome, and pied-à-terres are considered on a case-by-case basis. The cooperative allows financing up to 65%, with subletting permitted after 18 months of ownership. With its distinguished architecture, white-glove services, and unrivaled Gold Coast address overlooking Washington Square Park, One Fifth Avenue offers an incomparable lifestyle surrounded by the neighborhood’s finest dining, cultural institutions, and boutiques. A truly rare opportunity to live in one of Greenwich Village’s most desirable buildings. There is an on-going assessment for this apartment of $150.02.  Please call to schedule a viewing of this lovely home.",
    "list_price": 1950000,
    "price_per_sqft": 8.161625293504603,
    "images_count": 15
  },
  {
    "listing_id": "817383130ba8f19a44ef5f8c0c2acc04",
    "property_id": "723dc5d45245134abe03f5594ea5beaf",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/44-E-12th-St-10003/unit-9A/home/45139145",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:22Z",
    "listing_type": "sell",
    "status": "ok",
    "title": "Payment calculator",
    "description": "& nbsp;   Welcome to this spacious and stylish one-bedroom, one-and-a-half-bathroom residence in the heart of Greenwich Village. Thoughtfully designed with a modern aesthetic, this home blends crisp architectural details with contemporary finishes for both comfort and elegance.   The open living and dining area is filled with natural light, featuring dark-stained floors and clean lines that create a sleek, modern backdrop. The renovated kitchen boasts striking black marble counters , a mirrored backsplash , and a suite of premium appliances ; including a Bosch oven and stove and a Liebherr refrigerator; discreetly concealed behind custom cabinetry. A large peninsula anchors the space, offering abundant prep room and serving as the perfect centerpiece for entertaining.   The primary bedroom is generously proportioned, large enough to accommodate a separate seating area or home office. Adjacent to the bedroom is a vast dressing room , ideal for storage and organization. With northeast exposures, the space is flooded with natural light. The spa-like en-suite bathroom showcases marble tiling, a glass-enclosed rainfall shower, and a wide vanity with ample storage. An additional powder room with in-unit washer/dryer adds convenience.   This boutique building offers residents access to a furnished roof deck with sweeping city views; an ideal setting for relaxing or hosting friends.   Just five minutes from Union Square, the location offers the best of downtown living. Spend Saturday mornings browsing the city's largest farmer's market or take a leisurely stroll on a sunny afternoon. In the winter, the square transforms into a festive holiday market. Union Square also serves as a major transit hub, with the 4, 5, 6, N, Q, R, W, and L trains providing unmatched access across the city. Everyday conveniences are moments away with Target, Trader Joe's, Whole Foods, and Wegmans all nearby, while the neighborhood's charming caf & eacute; s, lively bars, and premier shopping along Fifth Avenue and Broadway complete the picture of vibrant city living.   & nbsp;",
    "list_price": 1495000,
    "price_per_sqft": 1519.3089430894308,
    "images_count": 15
  },
  {
    "listing_id": "faec9aed6e42b2762893ecf1a04fea63",
    "property_id": "ecbf5fbfb1f0c1e358ac33aa6bbaa296",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/242-E-19th-St-10003/unit-2C/home/160710566",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:22Z",
    "listing_type": "sell",
    "status": "ok",
    "title": "Payment calculator",
    "description": "& nbsp;  Welcome to this beautifully renovated prewar 1-bedroom residence at 242 East 19th Street, a full-service Art Deco co-op in the heart of Gramercy Park. This rare Gramercy offering combines prewar charm with modern updates, all within a well-run, full-service building.  This north-facing apartment overlooks tree-lined East 19th Street and features:  Large entry foyer  Expansive living room with wood-burning fireplace King-size bedroom with two closets, including a walk-in Oversized kitchen with stainless steel appliances , Caesarstone countertops, porcelain tile floors and backsplash, and glossy white cabinetry  Adjacent large dining area Renovated bathroom with new sink, vanity, toilet, bathtub, and modern tile finishes Hardwood floors throughout  New Friedrich remote-controlled A/C units in both living room and bedroom Building Amenities:  24-hour doorman  Live-in superintendent Landscaped rooftop garden Laundry room  Bike storage and common storage  Monthly maintenance includes gas and electric  Pet-friendly (with board approval)  Co-purchasing, parental purchasing, and guarantors permitted Please note there is a current assessment of $177.25  & nbsp;",
    "list_price": 1395000,
    "price_per_sqft": 12.38447812075532,
    "images_count": 15
  },
  {
    "listing_id": "e7ea1c9f4fe48ac725f7ad80cd57a742",
    "property_id": "e91d56278dd4761f42737d18ef6bc9b8",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/45-5th-Ave-10003/unit-9D/home/144812748",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:22Z",
    "listing_type": "sell",
    "status": "ok",
    "title": "Payment calculator",
    "description": "Residence 9D at 45 Fifth Avenue presents a rare opportunity to live along one of Manhattan’s most coveted stretches of Lower Fifth Avenue in the heart of Gold Coast Greenwich Village. With southern and eastern courtyard exposures creating natural light and serenity, this luminous home balances timeless prewar charm with stylish, modern upgrades. A gracious foyer sets the tone, leading into a generously scaled living room perfectly proportioned for both elegant entertaining and comfortable everyday living. The windowed kitchen, smartly removed from the entertaining space, has been thoughtfully renovated with custom cabinetry, sleek granite counters, a handsome mosaic backsplash, and a high-end appliance suite, including a modern under-counter refrigerator and freezer—an ideal setting for inspired culinary creations. The corner bedroom is a private sanctuary, framed by four windows that welcome sun and sky from multiple exposures. With a generous closet and ample space for a home office, it blends functionality and retreat-like tranquility. The renovated bath pays homage to the building’s period character while offering contemporary comfort, finished with classic subway tile, marble floors, and top-tier Lefroy Brooks fixtures and fittings. Built in 1925, 45 Fifth Avenue is a distinguished prewar cooperative known for its impeccable upkeep, strong financials, and low maintenance. Residents enjoy the convenience of a ButterflyMX virtual doorman system, a common laundry room, and the attentive service of a live-in superintendent. The enviable location places you moments from Washington Square Park, Union Square, and a vibrant array of neighborhood destinations—chic cafés, acclaimed restaurants, stylish boutiques, and specialty grocers such as Whole Foods and Citarella. With easy access to nearly every subway line, this is downtown living at its most refined and convenient.",
    "list_price": 799000,
    "price_per_sqft": 941.1071849234394,
    "images_count": 13
  },
  {
    "listing_id": "a0d623d039bc107ea4cc31e5af708342",
    "property_id": "7d14ffed32789686bae77d000250e9fc",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/325-Bowery-10003/Ph/home/198102501",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:22Z",
    "listing_type": "sell",
    "status": "ok",
    "title": "Payment calculator",
    "description": "Welcome to Penthouse #4 at 325 Bowery—a show-stopping, sun-drenched loft that redefines downtown living. This newly renovated three-bedroom, two-bathroom residence spans approximately 2,121 square feet. One of only two units in the building, this private duplex home combines soaring volume, architectural detail, and indoor-outdoor living in one of Manhattan’s most iconic neighborhoods at the nexus of Noho, Nolita, and The Bowery. Step into the massive corner great room and take in 15-foot exposed beam ceilings, walls of brick, wide-plank hardwood floors, and dramatic natural light streaming through skylights and oversized windows. A wood-burning fireplace anchors the living space, while open views of treetops, Bond Street, and the downtown skyline elevate the everyday. The chef’s kitchen features sleek custom cabinetry, high-end appliances, and a large breakfast bar that’s equal parts stylish and functional—perfect for hosting or just enjoying a slow Sunday at home. Each bedroom is distinct and filled with character. One skylit bedroom with soaring ceilings makes a dreamy guest space, office, or child’s room. Another secondary bedroom features a cozy lofted nook —ideal for a desk, play zone, or creative retreat. The primary suite is a statement all its own: set on a raised platform lined with south-facing windows, it boasts three closets, a spacious en suite windowed bath, and access to a bonus loft space— 439 square feet of flexible magic that can serve as a gym, studio, nursery, or lounge. And then there's the crown jewel: a 439-square-foot private rooftop terrace with panoramic views stretching downtown to One World Trade. It’s rare, it’s radiant, and it’s all yours. Set in a converted 1900s brick building, The Lofts at 325 Bowery offer authentic downtown loft living with historic charm, boutique scale, and surprisingly low monthlies. Moments from Bond Street and surrounded by the best of downtown cool, you'll have the city’s best dining, culture, and energy at your fingertips—Bar Primi, Il Buco, Lafayette, and Fish Cheeks are literally around the corner. CitiBikes, multiple subway lines (6, B, D, F, M, N, R, W), and everything else that makes New York pulse are right outside your door. This is downtown living turned all the way up.",
    "list_price": 4000000,
    "price_per_sqft": 33057.85123966942,
    "images_count": 15
  },
  {
    "listing_id": "f9cfbde2edd7c450ef37a585b54805c7",
    "property_id": "6adccdeb15ba28820b9cb0ab30159835",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/51-Saint-Marks-Pl-10003/unit-10/home/144771579",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:23Z",
    "listing_type": "sell",
    "status": "ok",
    "title": "Payment calculator",
    "description": "Discover a thoughtfully updated residence on one of the most iconic blocks in the East Village. This through-floor home offers an incredible amount of living space, triple exposures, and a blend of pre-war character with modern upgrades.  The apartment features high ceilings, tree-lined views, and excellent natural light throughout the day. A renovated kitchen with exposed brick, stainless steel appliances, and ample storage flows seamlessly into the living area, while the newly remodeled bathroom includes artisan tile, a walk-in shower, and contemporary fixtures. Additional enhancements include bamboo hardwood flooring , updated lighting , baseboard heating, modern ceiling fans and brand new Miele washer and dryer! Currently configured as a one bedroom plus home office, the space can easily be used as a two bedroom with a split bedroom layout providing both privacy and flexibility. Located in a well-kept, self-managed cooperative with only two apartments per floor, this ten-unit building offers a welcoming and efficiently run environment with exceptionally low carrying costs. Residents enjoy proximity to Tompkins Square Park, neighborhood gardens, Citi Bike stations, and some of downtown Manhattan's best cafes, restaurants, music venues, and nightlife.   & nbsp;",
    "list_price": 850000,
    "price_per_sqft": 1000.0,
    "images_count": 15
  },
  {
    "listing_id": "00c51942e44d96d007a815342463194a",
    "property_id": "ec00db7d5a08b34cc4ffe240c8f15a59",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/7-E-12th-St-10003/unit-7B/home/194303803",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:23Z",
    "listing_type": "sell",
    "status": "ok",
    "title": "Payment calculator",
    "description": "Envisioned by award-winning architects Bluarch, Residence 7B at The Avant showcases timeless modern finishes, refined craftsmanship, an oversized south-facing terrace, protected park views , and abundant natural light—making this one-bedroom a true standout in the vibrant East Village. An outdoor lover’s dream, this remarkable home boasts 166+/- SF of private outdoor space with unobstructed views of Joseph C. Sauer Park and the Freedom Tower—perfect both for entertaining and as a quiet retreat. The expansive living and dining area is bathed in natural light from six oversized south and east facing windows, and opens directly onto the terrace. The bedroom accommodates a queen bed and features a deep closet, while every room benefits from year-round warmth and light across multiple exposures. Refined interiors include solid white oak floors and an open chef’s kitchen with sleek Italian cabinetry, detailed brass hardware, travertine marble, and white quartz countertops. A full suite of integrated Bosch appliances completes the polished aesthetic. The spa-like bathroom features floor-to-ceiling porcelain tile, a custom vanity, mirrored wall cabinet, ribbed-glass shower enclosure, bronze fixtures, and slate-gray herringbone tile. A Bosch washer/dryer provides the convenience of in-home laundry. The Avant embodies timeless contemporary design, pairing thoughtful architecture with fine craftsmanship. Amenities include ButterflyMX video intercom with mobile access, fitness center, rooftop lounge with panoramic midtown and downtown Manhattan skyline views, community and package room, storage rooms for additional fee, and bicycle storage. Perfectly positioned on East 12th Street in the heart of the East Village, The Avant is surrounded by eclectic dining, shopping, cafes and markets including Trader Joe’s, Whole Foods, and Westside Market. Union Square, Stuyvesant Square, and Tompkins Square Park are all nearby. The L, 6, F, N, Q, and R subway lines provide effortless connectivity across the city. Moments from Gramercy, Union Square, Flatiron, Greenwich Village and NoHo—among downtown Manhattan’s most coveted neighborhoods. The projected real estate tax reflects an assumed 17.5% reduction under the Cooperative/Condominium Abatement (Real Property Tax Law §467-a). Purchasers should consult a tax professional regarding eligibility. Seller makes no representation as to the availability of the abatement.",
    "list_price": 1350000,
    "price_per_sqft": 2242.5249169435215,
    "images_count": 15
  },
  {
    "listing_id": "ffab20c13d63bc7259056cb11560021d",
    "property_id": "0cd161bdd1ac0723f434955c8c5c39b3",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/113-E-19th-St-10003/home/45253619",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:23Z",
    "listing_type": "sell",
    "status": "ok",
    "title": "Payment calculator",
    "description": "Nestled on a picturesque, tree-lined block in the heart of Gramercy, this stunning four-story single-family townhouse offers over 5,000 square feet of elegant living space. Seamlessly blending timeless architecture with contemporary comforts, this home is designed for sophisticated everyday living and effortless entertaining. With generously proportioned rooms, multiple private outdoor spaces, and a versatile floor plan, this thoughtfully updated home perfectly suits a modern, flexible lifestyle. & nbsp;     First Floor A glass-enclosed entry foyer welcomes you into a bright, spacious breakfast room complete with a cozy wood-burning fireplace and abundant natural light. Beyond lies the expansive chef's kitchen , featuring custom white cabinetry, a large island, and top-of-the-line appliances. Adjacent to the kitchen, the formal dining room-with custom built-in storage-opens directly onto a beautifully landscaped private garden , creating an ideal setting for both intimate dinners and larger gatherings. A convenient powder room completes this level.  & nbsp;                            Parlor Floor The parlor level impresses with soaring 12-foot ceilings , elegant moldings, and oversized windows that flood the space with natural light. The formal living room, situated at the front of the home, is anchored by a stately marble fireplace , while a secondary area at the rear offers a cozy, informal living space. This floor is perfectly suited for both grand entertaining and quiet evenings at home.  & nbsp;                            Third Floor The serene primary suite occupies the entire third floor, offering a spacious bedroom, a luxurious en-suite bathroom, and generous closet space. The spa-like bath features double vanities, an oversized soaking tub, a separate shower, and a versatile bonus area-used variously as an exercise nook with a Peloton bike or an additional vanity space. Completing this level is a small terrace overlooking the back of the home.  & nbsp;                            Fourth Floor The top floor offers two additional well-proportioned bedrooms, each with ample light and storage, along with a full bathroom and laundry room. This level also provides flexibility for use as guest accommodations, a playroom, or a library/home office. A grand interior staircase connects all four levels of the home. & nbsp; & nbsp;     Garden Level The garden level provides an additional bedroom and full bathroom, along with a recreation or fitness room and kitchenette. With its own private entrance at street level and easily separated from the rest of the house, this space is perfectly suited for guest accommodations, an accessory apartment, or live-in staff. & nbsp;     Additional Features With its historic facade, elegant interiors, and prime Gramercy location just moments from Union Square, Irving Place, and some of Manhattan's best dining, shopping, and cultural amenities, 113 East 19th Street is a rare townhouse offering in one of the city's most desirable neighborhoods.",
    "list_price": 6500000,
    "price_per_sqft": 1300000.0,
    "images_count": 15
  },
  {
    "listing_id": "829e2e241d063b725ebc78be22e44de9",
    "property_id": "a8dd41c20b5aecd5d356d646a15d1b69",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/217-E-5th-St-10003/unit-6F/home/197679497",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:24Z",
    "listing_type": "sell",
    "status": "ok",
    "title": "Payment calculator",
    "description": "No appointment needed. .. Open House Saturday  &  Sunday 12-1:30pm  Estate Sale! Priced to close quickly. Discover a great opportunity to own this floor through one-bedroom home on East 5th Street, nestled between Second and Third Avenues. Stretching the entire length of the building, this residence offers bright southern views from the living room and serene northern exposures from the bedroom. (Only 3 flights up)  Upon entering, you’re welcomed by abundant natural light, a treetop view, a decorative fireplace , and classic hardwood floors . The kitchen features full-size appliances , Corian countertops , and plenty of space for a dining table, pantry, or buffet. Between the kitchen and the bedroom lies a versatile bonus area , perfect as a dining room, home office, or flex space to suit your lifestyle. Can easily be combined with the bedroom to create a massive bedroom suite. The bedroom overlooks a beautifully landscaped garden terrace and open sky. The windowed bathroom has been fully gut-renovated and waterproofed. Monthly taxes and HOA fees are billed together for a combined total of $1,541.  Don’t miss this East Village gem. .. contact us today for a private showing. *  *  * All furnisher is virtually staged.",
    "list_price": 625000,
    "price_per_sqft": 736.1601884570082,
    "images_count": 15
  },
  {
    "listing_id": "0977b71eac9350d23c40a3475ea4037b",
    "property_id": "8ea49d85914e2685bba9788000f2ecd8",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/325-Bowery-10003/unit-3/home/198101225",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:24Z",
    "listing_type": "sell",
    "status": "ok",
    "title": "Payment calculator",
    "description": "Welcome to 325 Bowery #3, a truly one-of-a-kind loft that defines modern downtown living. This newly renovated condominium spans approximately 1,653 square feet. Currently laid out as a two-bed, the unit easily converts to a three-bedroom (alternate floor plan available). With only two units in the building, this home offers rare privacy, soaring 11-foot ceilings, ten oversized windows , and an unbeatable location at the crossroads of NoHo, Nolita, and the Bowery. Step inside to a dramatic corner great room where light pours in from the south and west, illuminating exposed brick , wide-plank hardwood floors, and 2 striking decorative fireplaces. A gracious entryway with a powder room and coat closet leads you into the expansive entertaining space, where treetop views of Bond Street provide a tranquil backdrop in the heart of the city. The open chef’s kitchen is outfitted with custom cabinetry, top-of-the-line appliances, and a large breakfast bar—perfect for casual dining or hosting friends with ease. The king-size primary suite is a peaceful retreat, offering a large walk-in closet and a luxurious en suite bath with a double vanity and a glass-enclosed shower. The spacious second bedroom has its own full, windowed bath and generous closet space. A full laundry closet with in-unit washer and dryer completes this thoughtfully designed home. Set within a charming boutique brick condominium dating back to circa 1900, The Lofts at 325 Bowery deliver historic character with contemporary comfort. All of downtown’s best—Bar Primi, Il Buco, Lafayette, Fish Cheeks—is just around the corner, and with access to the 6, B, D, F, M, N, R, and W trains, plus CitiBike stations nearby, getting anywhere in the city is a breeze. With low common charges, intimate scale, and unmatched access to the energy and elegance of downtown, this is a rare opportunity to live in a home that truly has it all.",
    "list_price": 3000000,
    "price_per_sqft": 4608.294930875576,
    "images_count": 15
  },
  {
    "listing_id": "5bcb975a78c83f1feb11c2b23516042d",
    "property_id": "4f3606e78b3e68af3c331a3c79d17a76",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/718-Broadway-10003/unit-6B/home/45141802",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:24Z",
    "listing_type": "sell",
    "status": "ok",
    "title": "Payment calculator",
    "description": "NEW TO MARKET!  Two-bedroom loft in the heart of NoHo. This residence spans over 1,300 sqft with 12’ ceilings. Oversized east-facing windows, soak the home with an abundance of natural light. Both king- and queen-sized bedrooms offer large closets and space for additional furniture. The five-piece bathroom’s vaulted ceilings and layout give the feeling of an at-home spa. A full-sized chef’s kitchen equipped with stainless appliances, ample storage and a breakfast bar , leads into a full dining area suitable for up to 10 people, embellished by quintessential exposed brick. The grand living area looks out - though a breathtaking 25' of continuous windows - onto Lafayette Ave. The height of the space provides the classic loft feel and allows for a spacious living room and home-office space. There is no shortage of storage throughout the home including a coat closet, WIC/pantry and a full additional floor-to-ceiling storage closet. 718 Broadway has several amenities including central laundry, elevator, full-time super, virtual doorman and a stunning roof deck. The building is located in a prime area offering access to N, R, 4,5  &  6 trains as well as shops, bars and restaurants.",
    "list_price": 1595000,
    "price_per_sqft": 9666.666666666666,
    "images_count": 15
  },
  {
    "listing_id": "2d4f4bb79069b4b724ab4cd5b99676e3",
    "property_id": "6d090016de1c3d58854ba30c05910f5c",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/54-E-8th-St-10003/unit-3L/home/170668561",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:25Z",
    "listing_type": "sell",
    "status": "ok",
    "title": "Payment calculator",
    "description": "Prime Greenwich Village Residence & nbsp;   Apartment 3L                 50-54 East 8th Street  Heart of Greenwich Village  Price: $448,000  This is being sold with a tenant in place with the lease option to renew for an additional year in May 2026.  Discover urban living at its finest in this thoughtfully designed apartment that perfectly captures the essence of Greenwich Village charm. Apartment 3L offers an intelligently configured spacious layout that seamlessly integrates your living, sleeping, working, and dining needs into one harmonious space.   Apartment Features                 Interior Highlights:      Spacious, versatile layout accommodating multiple living zones Combo living area perfect for entertaining and relaxation Dedicated sleep area for privacy and comfort Functional work space ideal for remote work or creative pursuits Dining area for intimate meals and gatherings Modern kitchen equipped with brand-new appliances     Contemporary windowed bathroom with natural light     Three generously sized deep closets providing exceptional storage     Grand entry foyer creating an impressive first impression     North-facing windows overlooking vibrant East 8th Street  Unbeatable Location Positioned in the absolute heart of Greenwich Village, you'll be steps away from the iconic Washington Square Park - your own backyard oasis in the city. The neighborhood's culinary scene is at your doorstep, with renowned restaurants like Del Arte just moments away, alongside countless cafes, bistros, and dining establishments that make the Village a food lover's paradise.   Building Amenities                 50-54 East 8th Street is a distinguished red brick elevator cooperative that combines classic New York architecture with modern conveniences:      Beautifully maintained and landscaped common garden - a rare urban retreat     On-site laundry facilities for convenience     Private garage for residents     Professional resident manager and exceptional building staff     Generous sublease policy offering flexibility rare among cooperatives  Transportation  &  Connectivity This prime location puts you steps away from all major transportation options, ensuring effortless connectivity to every corner of New York City while keeping you rooted in one of Manhattan's most beloved and culturally rich neighborhoods.  Experience the perfect blend of Village charm, modern comfort, and urban convenience in this exceptional Greenwich Village home.",
    "list_price": 448000,
    "price_per_sqft": 943.1578947368421,
    "images_count": 13
  },
  {
    "listing_id": "e4eee91245f464ba324e25a983e8d442",
    "property_id": "f6326002da88ac8a524b73761191d582",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/65-Cooper-Sq-10003/unit-3A/home/174310910",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:25Z",
    "listing_type": "sell",
    "status": "ok",
    "title": "Payment calculator",
    "description": "Tucked between the vibrant East Village and charming Noho, this renovated 1 bedroom loft offers a rare blend of modern upgrades and chic urban living. With its dramatically 17-foot hight ceilings and expansive windows , the space feels bright, expansive and inviting—perfect for anyone looking to experience city living with style. The flooring throughout has been recently redone ensuring that your new home will be in mint condition. The spacious, open-concept living area features a modern island kitchen complete stainless steel appliances including a dishwasher, and microwave—perfect for home chefs and entertainers alike. One of the standout features is the balcony —your outdoor escape with amazing views of the city skyline. Whether you're sipping morning coffee or watching the skyline light up at night, it’s a view you’ll never get tired of. Additional comforts include central heating and air conditioning, ensuring year-round climate control, as well as access to building amenities like an elevator and a laundry room. Perfectly positioned in the East Village, right next to NoHo, this apartment offers unbeatable access to two of Manhattan’s most sought-after neighborhoods. Enjoy being surrounded by an array of acclaimed restaurants, cozy coffee spots, and lively bars. Nearby parks like Tompkins Square, Union Square, and Washington Square provide a refreshing escape from the urban buzz. Convenient access to multiple subway lines ensures seamless travel throughout the city.",
    "list_price": 1250000,
    "price_per_sqft": 1871.2574850299402,
    "images_count": 13
  },
  {
    "listing_id": "4aa5c491a7325b8f458e4660bec9100b",
    "property_id": "0ed297f0fdec709fc8514203b7602c84",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/29-E-9th-St-10003/unit-10/home/45142483",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:25Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "3bb97cf3a143461f4ff2961cd27d1f85",
    "property_id": "ffb6408ff27f352700958d3e28542ffd",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/232-E-6th-St-10003/unit-4AB/home/53324839",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:25Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "97b33131a3d3312ef5fe20494a361a99",
    "property_id": "c7a6e6192b6525d4b9723c21615b0576",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/60-E-9th-St-10003/unit-512/home/146128485",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:26Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "997f9aa12fcc1f6a6f55bee609bc0431",
    "property_id": "d33590ac00f40e4d31dd43e1fa1a5700",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/48-E-13th-St-10003/unit-8B/home/147014914",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:26Z",
    "listing_type": "sell",
    "status": "ok",
    "title": "Payment calculator",
    "description": "Welcome to your dream home at 48 East 13th Street, a stunningly gut-renovated loft just a block from Union Square. This 3-bedroom, 3-bathroom residence spans an impressive 2,300 square feet, seamlessly blending classic city charm with modern elegance. Step inside to discover exquisite herringbone hardwood floors and soaring 11-foot ceilings that enhance the sense of space. With fourteen oversized sash windows offering northern, eastern, and southern exposures, the apartment is drenched in natural light and showcases breathtaking views of the Empire State Building and the vibrant city skyline. The expansive foyer , complete with abundant storage, leads into a bright living and dining area perfect for entertaining. The living room features a floor to ceiling custom-built bookcase for additional storage, adding Village charm. Adjacent to this space, is the cozy third bedroom. The windowed kitchen , designed for both functionality and style, features an eat-in waterfall island, custom cabinetry, a spacious walk-in pantry, sleek countertops, a chic subway tile backsplash, and a suite of high-end, fully integrated stainless steel appliances. The apartment has central AC throughout. Retreat to the primary bedroom, a serene sanctuary with dual exposures, custom couples’ walk-in closets, and a luxurious en-suite bathroom adorned with marble walls and floors. Indulge in the spa-like experience with double vessel sinks, a walk-in rain shower, and a free-standing soaking tub. The second bedroom also offers comfort and privacy, complete with reach-in closets and an en-suite bathroom boasting elegant fixtures and finishes. Nestled in a beautifully maintained prewar building with a striking limestone façade, 48 East 13th Street provides modern conveniences, including a virtual doorman, a key-locked elevator, private storage, and a rooftop deck with breathtaking city views. Enjoy the vibrant lifestyle of Greenwich Village, just steps from a plethora of trendy restaurants, cafes, bars, and shops, with easy access to the 4/5/6/L/N/Q/R/W subway lines. Pets and pieds-à-terre are warmly welcomed. Experience the best of New York City living in this exceptional residence—schedule your private showing today!",
    "list_price": 4495000,
    "price_per_sqft": 14983.333333333334,
    "images_count": 15
  },
  {
    "listing_id": "f9e2875a9d5afbfdd8d62a6c36a69a5e",
    "property_id": "caae393bf1bde92866c6d7dee8ad5131",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/7-E-17th-St-10003/unit-PHS/home/198139203",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:26Z",
    "listing_type": "sell",
    "status": "ok",
    "title": "Payment calculator",
    "description": "7 East 17th Street - Penthouse South  Full-Floor Union Square Loft with a Private 2,700 SF Rooftop Oasis  A keyed elevator opens directly into this sprawling 2,820-square-foot Penthouse where pre-war character meets modern design. The 35-foot-wide great room is lined with six oversized arched south-facing windows, flooding the living area and home office with brilliant light. Nearly 11-foot ceilings, wide-plank oak floors, and seamless indoor-outdoor flow create an elegant downtown backdrop.   The open chef's kitchen showcases restaurant-sized Sub-Zero and Wolf appliances, including a six-burner range, steam oven, and commercial-grade proofing oven, all set against striking Carrara marble countertops and backsplash. Three bedrooms each feature en-suite marble baths: the skylit primary suite offers open eastern exposures for all-day light, three walk-in closets, and a spa bath with soaking tub, heated floors, and a Calacatta gold marble slab shower. The second bedroom also enjoys bright eastern views, while the third bedroom has a skylight and queen-size Murphy bed-easily converts between guest room, lounge, or library. In addition, dedicated home office with southern exposure, temperature-controlled wine closet, abundant storage, and a Carrara marble laundry room with half bath complete the thoughtful interior.   An internal staircase rises to the roof through a commercial-grade greenhouse enclosure with an automated temperature-sensor vent that keeps the home naturally cool and ventilated. A striking glass bulkhead overhead allows daylight to cascade down the stairwell.   Above it all awaits a private 2,700-square-foot roof deck-a rare, All-Yours escape from the city grind. Wrapped in mature plantings and wildflowers alive with bees and butterflies, the terrace is served by a drip-irrigation system for effortless maintenance and organized into three distinct entertaining zones:  -Sun Deck with outdoor shower and chaise lounges  - Outdoor Kitchen &  Lounge with built-in Sub-Zero/Wolf grill, refrigerator, and bar for cocktails under the skyline  -Dining  &  Movie Terrace for starlit dinners and open-air screenings beneath the iconic water tower  More than outdoor space, the roof lives like three extra rooms in the sky, surrounded by landmark rooftops and timeless architecture so the city feels privately yours-equally perfect for lively gatherings or a quiet morning with a book.   This boutique pre-war condominium offers a newly renovated lobby, virtual doorman, full-time superintendent, and low monthlies-all moments from Union Square Greenmarket, Madison Square Park, Eataly, and every major subway line.",
    "list_price": 6950000,
    "price_per_sqft": 8475.609756097561,
    "images_count": 15
  },
  {
    "listing_id": "08a589ec1db5557f01bc4e6e79420779",
    "property_id": "ac0d096907bbd7155f88ab33d53ccf1a",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/5054-E-8th-St-10003/unit-3S/home/197704663",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:26Z",
    "listing_type": "sell",
    "status": "ok",
    "title": "Payment calculator",
    "description": "*  * Tenant in Place until December 2026 *  *   Peaceful Oasis in the Heart of Greenwich Village  Apartment 3S is a sprawling, pin-drop quiet one-bedroom with four oversized closets and beautiful hardwood floors throughout. The windowed kitchen is thoughtfully designed with abundant cabinet and counter space, updated appliances (including a dishwasher), and a functional layout for everyday cooking. The expansive living area easily accommodates a living room, dining space, and home office (see floor plan), while the king-sized bedroom offers plenty of room for additional furniture. A windowed bathroom completes this well-proportioned home. 50-54 East 8th Street is a well-run, six-story red-brick cooperative built in the 1950s with 121 units and ground-floor retail. Residents enjoy a renovated lobby , elevators, central laundry , new intercom system, bike room, rentable storage, and an on-site parking garage. A beautifully landscaped private garden runs the length of the property, providing a rare and peaceful retreat in the middle of the Village. Maintenance covers real estate taxes, heat, hot water, and electricity, and the co-op is STAR rebate–approved. Financing up to 80% permitted. No flip tax. Ownership policies are flexible: pied-à-terres, co-purchasing, gifting, guarantors, parents buying for working children, and international purchasers are welcome. Unlimited subletting after 2 years. Pet friendly. Perfectly located between Washington Square Park, Union Square, and SoHo, with NYU, Whole Foods, Trader Joe’s, the Union Square Greenmarket, and countless dining, shopping, and nightlife options just moments away. Close to major trains: N, R, W, Q, 4, 5, 6, and L. All showings require 24 hours’ notice.",
    "list_price": 649000,
    "price_per_sqft": 764.4287396937574,
    "images_count": 13
  },
  {
    "listing_id": "1bfd41bf9ac44d77f284079311855a7b",
    "property_id": "9671cc07d9dfac7eff1dde5cb8fac482",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/333-E-14th-St-10003/unit-15B/home/45170591",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:27Z",
    "listing_type": "sell",
    "status": "ok",
    "title": "Payment calculator",
    "description": "Oversized, bright 1 bedroom on the 15th floor with uninterrupted views to the Empire State Building and Hudson Yards. The unit faces the center of the block, minimizing traffic noise. 5 large closets provide ample storage, and north-facing wall-to-wall casement windows plus white oak floors throughout bring in and reflect light without the heat. Less than 15 minutes from Union Square, NYU, Facebook, and Google, the building is clean and quiet, 90% owner-occupied, and in the heart of all the food, nightlife, and culture that makes the East Village so sought after. Maintenance, HOA, and taxes inclusive are $1948 / month (of which 2/3rds are tax deductible).",
    "list_price": 875000,
    "price_per_sqft": 1093.75,
    "images_count": 15
  },
  {
    "listing_id": "4d2304e75769e72c860822c08b9d5309",
    "property_id": "3392adabfdb82b24688cbd463ea4f5ae",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/54-E-1st-St-10003/unit-6C/home/45166785",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:27Z",
    "listing_type": "sell",
    "status": "ok",
    "title": "Payment calculator",
    "description": "& nbsp;  Charming 1-Bedroom Apartment in the Heart of the East Village! Welcome to this move-in ready 1-bedroom apartment, nestled in one of New York City's most vibrant and eclectic neighborhoods-East Village. Located on a tree lined street, this apartment boasts a perfect blend of classic charm and modern comfort.  Set on the top floor of a well maintained building, this 1-bedroom home receives an abundance of light throughout. The spacious living area features high ceilings , large windows , hardwood floors , and an exposed brick wall , giving off that iconic New York vibe. The open-concept layout flows seamlessly, providing plenty of room for both relaxation and entertaining! The kitchen is thoughtfully equipped with sleek countertops, a breakfast bar, dishwasher, and washer/dryer. There is ample cabinet space, making it an ideal space for home cooking and creativity. The bedroom is cozy yet allows for a full-sized bed and dresser.  Located in the heart of the East Village, you'll be surrounded by trendy cafes, bustling restaurants, unique boutiques, and lively nightlife. Enjoy quick access to public transportation, giving you easy access to the entire city, while also enjoying the charm and character of this iconic neighborhood.  The well-run, financially sound building has extremely low maintenance, a favorable sublet policy, easy access to subways, and allows pets with board approval. Co-purchasing, gifting, guarantors and pied-a-terres are considered on a case-by-case basis. Please note there is a monthly assessment of $846 until February 2026.  & nbsp;",
    "list_price": 525000,
    "price_per_sqft": 718.1942544459645,
    "images_count": 13
  },
  {
    "listing_id": "6755b1b5b0806cdb4ceb298179b2d58a",
    "property_id": "ffc3f4ecb655b3545ba83618cda2af0d",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/23-Waverly-Pl-10003/unit-5U/home/172407265",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:27Z",
    "listing_type": "sell",
    "status": "ok",
    "title": "Payment calculator",
    "description": "XL STUDIO LOFT FOR SALE! Welcome home through the historical gates of 23 Waverly Place, located only one block from Washington Square Park in the heart of downtown Manhattan. Loft 5U located on the fifth floor, offering 11 foot ceilings and a western facing view. The sleeping loft has 4 ft ceilings for a cozy feel, while the kitchen provides an open concept great for hosting including a dishwasher. Unit 5U is complete with 6 closets and the bathroom provides maximum vanity mirror storage. Building amenities include: • Lush landscaped rooftop and garden with ample seating, sweeping NYC Skyline views , wifi and a hammock! • Laundry on every floor • 300 feet to Washington Square Park • Iron gated courtyard and entryway  Built in 1891, Waverly Mews is a handsome cooperative once used as a hat factory. Waverly Mews was initially four separate wood-frame buildings that were joined together in 1973 and converted to co-ops in 1984. Featuring a stately brick façade with stone and iron ornamentation, the building welcomes you with a gated landscaped courtyard (new project almost complete). Residents of this beautifully maintained, sought-after enclave enjoy professional management, an attentive live-in superintendent, two large elevators, common area Wi-Fi and a gorgeous roof deck with Empire State Building views . Pets, co-purchasing, parents buying for working children, subletting after two years, and 75% financing are permitted with board approval. Waverly Mews has a lenient sublet policy after two years of primary residence. Building requires 25% down. Co-purchasing and gifting allowed.",
    "list_price": 700000,
    "price_per_sqft": 957.5923392612859,
    "images_count": 15
  },
  {
    "listing_id": "28bfd4fa10956d471b9d827ae8e2cb1e",
    "property_id": "6f5e719aa20d3c931f77aff4db470e5c",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/42-E-20th-St-10003/unit-4A/home/45127488",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:27Z",
    "listing_type": "sell",
    "status": "ok",
    "title": "Payment calculator",
    "description": "This 2,200-square-foot property features well-proportioned bedrooms and 11-foot ceilings. Oversized 8.5 x 5 ft windows provide 60 linear feet of frontage overlooking treetops and historic facades along landmarked East 20th Street . 4A offers a layout that is rarely found in this downtown neighborhood. Upon entering the loft, the sense of light and space is immediate. The living room spans approximately 19 x 23 feet, providing ample space for large-scale entertaining and dining. The great room features an open kitchen with Poggen Pohl cabinets, a Sub-Zero refrigerator, and a Miele 6-burner range. The generously sized primary suite can accommodate an additional sitting area and home office. The 5-fixture ensuite bathroom includes double vanities, a stall shower, and a deep soaking tub. Two secondary bedrooms offer excellent storage and can accommodate queen beds with desks. A second full bath and powder room are located across the hall. The home includes a side-by-side washer/ dryer, large storage closets, a pantry, HVAC, and is delivered in turnkey condition . The Bullmoose Condominium is one of the Flatiron's pre-eminent midblock prewar condominiums. The building features 22 loft-style apartments, a rooftop deck , an on-site super, video intercom with remote access, and low common charges. Located between Park Avenue and Broadway, 42 East 20th Street is moments from Madison Square Park and some of New York City's most notable restaurants and retail. The location offers beautiful architecture and convenient access to every major subway line and amenity.",
    "list_price": 3950000,
    "price_per_sqft": 18036.529680365296,
    "images_count": 15
  },
  {
    "listing_id": "4291f8838b5c4b22db16589f339054ef",
    "property_id": "b07e62ca287252c9fa19d0d52ee65f2f",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/60-E-9th-St-10003/unit-607/home/114625056",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:28Z",
    "listing_type": "sell",
    "status": "ok",
    "title": "Payment calculator",
    "description": "GREENWICH VILLAGE GEM!  Beautifully combined apartments 606 and 607.  As you step into this stunning Greenwich Village home, you are immediately greeted by an open floor plan and an expansive living space bathed in natural light. The seamless flow between the living, dining, and kitchen areas creates an airy and inviting atmosphere, perfect for both daily living and entertaining. South-facing windows, wide-plank hardwood floors, recessed lighting, and elegant finishes add to the homes sophisticated charm, while thoughtfully designed storage solutions enhance functionality. Every south-facing window offers an unobstructed view across East 8th Street and straight down Broadway, immersing you in the vibrant heart of this iconic New York City neighborhood. At the heart of the residence lies a chefs dream kitchen, meticulously designed for both style and performance. Outfitted with top-of-the-line stainless steel appliances, including a Thermador stovetop, Bosch oven, convection oven/microwave, and dishwasher, as well as a GE refrigerator, this kitchen is as high-tech as it is beautiful. The expansive Caesarstone island provides ample prep space and doubles as a breakfast bar, making it the ideal gathering spot. Gorgeous custom cabinetry extends throughout, offering abundant storage, while a spacious pantry ensures effortless organization. Sleek under-cabinet lighting and a sophisticated tile backsplash complete the space, elevating both form and function. The primary suite is a luxurious retreat, complete with both south and north facing views. Enjoy your en suite bathroom featuring marble tiling throughout, electric heated floor, a walk-in glass-enclosed shower and high-end fixtures. Two additional bedrooms offer plenty of optionality. The second bathroom is equally well-appointed with contemporary finishes, marble tiling, heated floor, and a deep soaking Toto tub. Ample closet space throughout, including custom-designed storage solutions, ensures effortless organization and convenience. Each bedroom is equipped with CitiQuiet windows making this home super quiet. Best of all, enjoy your own stacked Bosch washer/dryer. The Hamilton is a pet-friendly, full-service co-op featuring a 24-hour doorman, an exceptional live-in superintendent, and a dedicated staff. Residents enjoy a beautifully landscaped garden, a central laundry room, a bike room, and additional storage. Ideally situated in prime Greenwich Village on a vibrant, tree-lined street, the building offers easy access to multiple subway lines (N/R/W/ Q, L, 4/5/6), the PATH train, and is just moments from Union Square, Washington Square Park, the Farmers Market, Wegmans, Trader Joes, Whole Foods, and some of the best dining and nightlife in NYC. With no flip tax, gifting is permitted, and subleasing is allowed after two years of ownership. However, pied-a-terres, guarantors, and co-purchasing are not permitted. This residence epitomizes the best of Greenwich Village living! Viewings with 24-hour notice please.",
    "list_price": 2395000,
    "price_per_sqft": 11.71573087572031,
    "images_count": 15
  },
  {
    "listing_id": "c36bc911c9718fd1fd65c4ff8871b0dd",
    "property_id": "c2e0f65651a2ff4875d66414830c927a",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/135-E-19th-St-New-York-NY-10003/31506443_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:28Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "11de50aefe1c88eed7b5c5306f2da496",
    "property_id": "8eb857ada391e0560bea3c3656db2adc",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/226-E-12th-St-APT-1H-New-York-NY-10003/244898726_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:28Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "f2164429193d1d3c92d193d4c5bd387a",
    "property_id": "eb0617f4b0e90a6803acaa13abde49bb",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/113-E-19th-St-New-York-NY-10003/31506434_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:28Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "a51667ea28cc278a83ee32ffaa59d11c",
    "property_id": "4c8e960992159cc4396368469cc84595",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/51-Saint-Marks-Pl-APT-10-New-York-NY-10003/244697169_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:28Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "29768a5b632d8fbd8ba2bac523d2455c",
    "property_id": "e2eb98921ad6af43ff6304693c04ce39",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/81-Irving-Pl-15DE-New-York-NY-10003/72516956_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:28Z",
    "listing_type": "sell",
    "status": "ok",
    "title": "81 Irving Pl #15DE, New York, NY 10003",
    "description": "Active See all 18 photos $1,650,000 81 Irving Pl #15DE, New York, NY 10003 2 beds 2 baths -- sqft Loading Coop Built in 1930 -- sqft lot $1,697,700 Zestimate ® $--/sqft $4,415/mo HOA What's special Restored period detail Dual exposures Majestic views Large guest bedroom suite Bright views Integrated workspace High beamed ceilings THORTON WILDER (OUR TOWN) LIVED IN THIS HOME & WROTE THIS ABOUT IT:  \n\n\"My new apartment is 81 Irving Place... I've lived five days in my New York home and am already flooded with a new overwhelming feeling about New York.\" Thornton Wilder referencing Residence 15DE, in a letter to Gertrude Stein and Alice Toklas, November 18, 1939.\n\nLUMINOUS & LITERARY, TRIPLE CORNER CLASSIC w/STUNNING VIEWS IN THREE DIRECTIONS BY GRAMERCY PARK\n\nBIG BEAUTIFUL ROOMS, CASEMENT WINDOWS, SOARING CEILINGS, RESTORED PERIOD DETAIL AT PRIZED PRE-WAR ADDRESS\n\nHigh atop Irving Place is perched a Manhattan treasure.  This magical home, with majestic views in three directions, and cheerful sunshine spilling through its handsome casement windows, floats above it all.  With a prized vantage point to its coveted building's famous gargoyles and gorgeous architecture, a rare, soulful home unfolds.  Above you soar high beamed ceilings and arches, underfoot are hardwood floors, and everywhere you look, there is classic, timeless beauty.  \n\nThe grand living room is an impressive, stretch-out entertaining space.  A corner room with supreme, open city skyline views to the East and South, the living room lives largely.  Offering a dining area under its signature arched ceiling, and an endearing, corner, period built-in (ideal for collectibles and books), this great room certainly earns the name.  Served by a sweet windowed kitchen, the living/dining room brings all day sunshine and all night moonbeams.  \n\nBoth bedrooms are large and lovely, offer dual exposures and bright views, and are gracefully on opposite ends of this winsome home.  The primary bedroom is king-sized, offers peeks of Gramercy Park to the South and dramatic city views East.  With an immense wall of closets, an integrated workspace, and an en suite windowed bath, this space is masterful.  On the other side of this standout residence is the large guest bedroom suite.  With two bright exposures, more architectural views of the building's prized gargoyles, and its own full, en suite guest bath, this versatile bedroom is made for an expansive life.  \n\nIdeally situated in the heart of the Gramercy Park neighborhood, 81 Irving Place is an architecturally distinguished and incredibly well-run full-service prewar cooperative building with a live-in Superintendent, attended lobby, laundry room, and a bicycle storage room. The location grants residents enviable proximity to Union Square Park, its farmer's market, and the culinary epicenter of New York City. The building permits dogs, sublets, parental co-purchases, and pied a terre owners.\n\nSupremely situated in perhaps the most treasured part of 81 Irving, this rare, one-of-a-kind home gleams proudly.  Part of the Gramercy Park Historic District, this rare, resplendent residence enjoys all of the supreme assets and benefits of its well-served, well-run building.  With a seasoned staff, and a world-class location along one of Manhattan's most idyllic and sought-after tree-lined blocks, here is a 1929 beauty in a location that comes with bragging rights.  Nearby is every downtown trophy destination:  A multitude of cultural, shopping, dining, educational, entertainment, and fitness destinations are at your doorstep -- not to mention Gramercy Park, Union Square Park (and green market), Park Avenue South, Whole Foods, Trader Joe's, and a plethora of easy transportation options.  \n\nThorton Wilder apparently loved his life in this home.  It's easy to understand why.  Come discover this residential stand-out, and be \"flooded with a new overwhelming feeling about New York.\"\n\nFlip Tax: 3% of Purchase Price to be Paid by Purchaser. Show more 3 days on Zillow | 582 views | 39 saves | Likely to sell faster than 91 % nearby Loading Request a tour as early as today at 11:00 am Loading Loading Contact an agent Loading",
    "list_price": 1650000,
    "price_per_sqft": null,
    "images_count": 5
  },
  {
    "listing_id": "62275be5e7f731492e190030fdff7cbc",
    "property_id": "876509412e790553e3340d3eb4620db9",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/243-E-17th-St-New-York-NY-10003/83942583_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:28Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "cd2ade64631afab439c9d6d0c0eca47f",
    "property_id": "845c06ee9b4459e469208e864635d5cd",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/125-E-4th-St-APT-26-New-York-NY-10003/244863048_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:29Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "70b495f56c685e338ca627dedb82364e",
    "property_id": "5d8c8041ae7407643ce4979f122c130d",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/704-Broadway-PENTHOUSE-New-York-NY-10003/442755067_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:29Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "fdc294697536e9b0953b3e56859e0679",
    "property_id": "403714e91d5a488ad4c563807fffbb60",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/210-E-17th-St-APT-3D-New-York-NY-10003/72517943_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:29Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "01f2b199b85684cb7ecf183df07e10bf",
    "property_id": "eacf0230d0a5b5c22a0282b3818b3e99",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/54-E-1st-St-New-York-NY-10003/31496561_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:29Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "29123e49055da9d7735941a96724fda3",
    "property_id": "5ec1c5259e14886e5c5c21ea7bf4d17b",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/201-E-15th-St-APT-4H-New-York-NY-10003/457045457_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:29Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "1b96ecadb2e078b9b96de05823f1ca28",
    "property_id": "f371a311d85d8bd1995c9bde14eb0d79",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/815-Broadway-PENTHOUSE-2-New-York-NY-10003/456674433_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:29Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "726904d5db296058741f21a98855d73a",
    "property_id": "dafef33d9fdb242443c5aa7b2c509f2e",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/226-E-12th-St-APT-1B-New-York-NY-10003/244849005_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:29Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "e911cb637858f298ca9cfd70311ab0c0",
    "property_id": "02bc34e6a37e378aa140d6668d875021",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/11-Waverly-Pl-APT-10E-New-York-NY-10003/2126954016_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:29Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "31011942e224c1be0926474f3193f157",
    "property_id": "4b49ae5b1c12cb65f916645d7497f5fd",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/78-Irving-Pl-PENTHOUSE-New-York-NY-10003/442912996_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:29Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "ed87b468fc590bbd83e0d8e96374e213",
    "property_id": "19f28408baf5ce0a69fe8ff9f2b7bc67",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/224-E-11th-St-APT-19-New-York-NY-10003/72511816_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:29Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "a1312a6b75186d372b22fffe2d72fb6c",
    "property_id": "25053e000c787a538c2f22d9b2d92428",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/123-3rd-Ave-PENTHOUSE-18-New-York-NY-10003/450142787_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:29Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "aad35d67cb991307c634c295c10158d7",
    "property_id": "281d506dbb433b7dbb8786328033d387",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/226-E-12th-St-APT-1F-New-York-NY-10003/95064313_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:29Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "4cb23bd959ac9081332fda55d34305be",
    "property_id": "d9014e33469d1300756c20b25781602b",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/217-E-5th-St-6F-New-York-NY-10003/456384143_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:29Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "ac24c8fcc62310b099d56f1efd756fe3",
    "property_id": "82331b4283de0ed4bc88e4145e74a04c",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/325-Bowery-APT-3-New-York-NY-10003/2086011691_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:30Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "e43b5d3d7d62f32732bf4686fbe2ad48",
    "property_id": "119f0edca74a01fa2494c0e3bc6180d9",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/352-E-19th-St-New-York-NY-10003/2071152395_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:30Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "1c7faf524796fdf3ce583596319d1344",
    "property_id": "0daa0d5109e09ecccf862e29398b19ec",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/200-E-20th-St-New-York-NY-10003/31507920_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:30Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "02333c1e2f8c4a3c3b154961bcd830f6",
    "property_id": "be0aa69cc40c8be933f31ef42e4cff82",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/111-4th-Ave-APT-3I-New-York-NY-10003/72512807_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:30Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "d9537f4388057f9a5d1ad406b4da0bc1",
    "property_id": "9b40e0598e1610707af1efcca953f191",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/45-5th-Ave-APT-9D-New-York-NY-10003/244549704_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:30Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "0cb74ab43cd265d697f2a3e8f91765ba",
    "property_id": "19dee8c69edc13cb71385a147dfa0bd2",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/48-E-13th-St-APT-8B-New-York-NY-10003/253465573_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:30Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "94453171ba49b8a4d0bbfc9765f6908d",
    "property_id": "a7d8096e92565b4ecd0f9c8cf27f321d",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/22-Gramercy-Park-UNIT-PENTHOUSE-New-York-NY-10003/452675881_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:30Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "2dd66d6cfe5e96c9d5edf7cd726226fd",
    "property_id": "832eba97e5ad1361dec1bf53a30fded2",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/29-E-9th-St-APT-10-New-York-NY-10003/72512890_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:30Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "be50aa27d01f6dbf8bf9e6bf97b3e266",
    "property_id": "ae586b443ff9354ba95ac368836b0318",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/302-E-19th-St-APT-3B-New-York-NY-10003/31508865_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:30Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "7556de77d0a131120e150037230b91f5",
    "property_id": "701a8e309b8a3fe4a31fa16fd0665079",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/325-Bowery-UNIT-PH-New-York-NY-10003/456855734_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:31Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "5f42b69c99d44af9621464ab1263025f",
    "property_id": "c401e34f60390d6d4c80605faefa41dc",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/32-E-2nd-St-15-Manhattan-NY-10003/337601680_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:31Z",
    "listing_type": "sell",
    "status": "ok",
    "title": "32 E 2nd St #15, Manhattan, NY 10003",
    "description": "Active See all 10 photos Price cut: $50K (7/31) $649,000 32 E 2nd St #15, Manhattan, NY 10003 1 beds 1 baths -- sqft Loading Coop Built in 1900 -- sqft lot $-- Zestimate ® $--/sqft $400/mo HOA What's special Oversized windows Soaring ceilings Granite countertops High end appliances Bright, Renovated Pre-War Gem in the Heart of the East Village\n\nNestled on East 2nd Street between Second Avenue and the Bowery, this beautifully renovated one-bedroom cooperative blends timeless pre-war charm with modern comfort in one of Manhattan’s most dynamic neighborhoods.\n\nBathed in light through oversized windows, the apartment boasts soaring ceilings that enhance its sense of space and airiness. Carefully updated, the home retains a classic New York aesthetic while offering contemporary convenience — all with an incredibly low monthly maintenance of just $400.82. Granite countertops, high end appliances (refrigerator, microwave, dishwasher, stove and air conditioner) are all included. A Turn Key sale including all furnishings can be arranged.\n\nLocated in the East Village/Lower East Side Historic District, 32 East 2nd Street is a well-maintained, intimate walk-up cooperative. The building welcomes pets, allows gifting and co-purchasing, and encourages engaged ownership.  Some apartments in the building feature washer/dryers. \n\nOutside your door, discover an unbeatable downtown lifestyle. Surrounded by some of the best restaurants, nightlife, and cultural institutions in the city, you’re just moments from Whole Foods, SoHo, Bond Street, and beloved local favorites like The Wren, Gemma, and The Bowery Hotel. The F and 6 trains are just two blocks away, offering quick access to the rest of the city.\n\nDon’t miss this opportunity to own a rare, light-filled slice of historic New York in a truly unbeatable location. Present all offers! Show more 103 days on Zillow | 849 views | 33 saves | Loading Request a tour as early as today at 11:00 am Loading Loading Contact an agent Loading",
    "list_price": 649000,
    "price_per_sqft": null,
    "images_count": 5
  },
  {
    "listing_id": "aa14ee4744af3f295cd510fa3c8f97ee",
    "property_id": "f1fb73d30fb318632c4c8f59750742a6",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/217-2nd-Ave-PENTHOUSE-New-York-NY-10003/456549603_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:31Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "12aaee81345851bf80e288cad51de1b8",
    "property_id": "920ebf954587c11667d740b8ed7dd67d",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/111-4th-Ave-APT-2E-New-York-NY-10003/244796875_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:31Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "aa195c7fda91951bab16a19122bdd56b",
    "property_id": "5e76b49987af0ac417680990f6503881",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/445-Lafayette-St-110C-New-York-NY-10003/456545070_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:31Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "e32187e64b7e1df46177b75b7cd009be",
    "property_id": "cbfd4eaef4968db57c5765424364331e",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/305-2nd-Ave-APT-542-New-York-NY-10003/63866698_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:31Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "136b243534e26d8a4f4d5d8fb1fdd67a",
    "property_id": "e97512df4c19dc5e90d5059e77d93075",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/99-E-4th-St-APT-4A-New-York-NY-10003/244700381_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:32Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "cde64a4888041c1076eeda25873dbafc",
    "property_id": "49dd7881057ad12560bc413ac51d7506",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/350-E-18th-St-4D-New-York-NY-10003/456750410_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:32Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "d344d17eb9883d822d8fb378e414cfe8",
    "property_id": "e0041fb1f0f2aced2109a6a1bebbbc94",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/224-E-14th-St-APT-1-New-York-NY-10003/89329362_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:32Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "2c2c5b666465c6a2ed61f93e855a6645",
    "property_id": "a3c98fa27b42f7dd86272ab8626f6648",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/70-E-10th-St-APT-20C-New-York-NY-10003/457056914_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:32Z",
    "listing_type": "sell",
    "status": "ok",
    "title": "70 E 10th St APT 20C, New York, NY 10003",
    "description": "Active See all 16 photos $1,495,000 70 E 10th St APT 20C, New York, NY 10003 1 beds 1 baths 1,108 sqft Loading Coop Built in 1960 -- sqft lot $-- Zestimate ® $1,349/sqft $2,209/mo HOA What's special Bright eastern exposures Oversized bedroom suite Stainless steel appliances Four walk-in closets Expansive entry foyer Bespoke cabinetry Custom vanity RARELY AVAILABLE OVERSIZED 1-BEDROOM, 1-BATHROOM WITH SWEEPING VIEWS\n \nPerched on the 20th floor of the legendary Stewart House, this 1,108 SF residence offers abundant natural light, open city views, and generous proportions rarely found in Greenwich Village.\n \nAn expansive entry foyer doubles as a versatile home office, flowing into an incredible 33-foot great room with a large dining alcove. The windowed chef’s kitchen features stainless steel appliances, bespoke cabinetry, and quartz countertops.\n \nThe oversized bedroom suite easily accommodates a king-sized bed and additional furniture, with bright eastern exposures. The bathroom is pristine, with a custom vanity and shower/tub combination. Four walk-in closets provide exceptional storage throughout.\n \nRESIDENCE HIGHLIGHTS\n -  1,108 SF of interior living space\n- Expansive living room with a separate dining alcove\n- Windowed chef’s kitchen\n- Open city views that overlook Astor Place to the Williamsburg Bridge\n- Spacious entry foyer/home office\n- 4 walk-in closets\n- Hardwood flooring\n- Central heating/cooling via PTAC systems\n \nThe Stewart House is a white-glove, full-service cooperative with a reputation for exceptional service and financial stability. Residents enjoy:\n- 24-hour doorman, live-in superintendent, on-site resident manager\n- Landscaped circular driveway and entry garden\n- Fitness center\n- Children’s playroom\n- Resident-only garden with comfortable seating and table areas\n- Bike room\n- Two laundry facilities\n- Package room\n- Additional storage units available for rent\n- On-site garage with direct building access\n \nTrust ownership and guarantors are permitted, with gifting permitted on a case-by-case basis.\n\nPrudent financial management has allowed the co-op to maintain low maintenance fees while investing millions to enhance both residents’ quality of life and shareholder value.\n \nSituated at the crossroads of Greenwich Village, Union Square, and Washington Square Park, The Stewart House offers immediate access to the city’s best dining, shopping, and cultural destinations, as well as multiple subway lines. Wegmans, Trader Joe’s, and Whole Foods are all within minutes.\n \nResidence 20C presents a rare opportunity to own a spacious, light-filled home in one of Greenwich Village’s most sought-after cooperatives. Show more 1 day on Zillow | 77 views | 3 saves | Loading Request a tour as early as today at 11:00 am Loading Loading Contact an agent Loading",
    "list_price": 1495000,
    "price_per_sqft": 13842.592592592593,
    "images_count": 5
  },
  {
    "listing_id": "055c95a404a656464765ad48c8e9b203",
    "property_id": "20ee0d7973fc6a956f7c2b0e82ed7ef5",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/35-Stuyvesant-St-New-York-NY-10003/145586220_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:32Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "97bc9e45417ff71b66d91f2ce724469d",
    "property_id": "0809bde2b4c159cc1946dca2cd8c96d5",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/13-Gramercy-Park-S-FLOOR-4-Manhattan-NY-10003/123824307_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:32Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "b456b367335730022a9b8cd952f179fb",
    "property_id": "73e14eebe97d0bf7dc3dee4ba10a623c",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/1-5th-Ave-APT-2J-New-York-NY-10003/90138939_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:32Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "db97f6a37af00ecc42751b503dd64eea",
    "property_id": "eb06ff622647eccecab31d9e705f9862",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/112-W-13th-St-10011/home/53397399",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:32Z",
    "listing_type": "sell",
    "status": "ok",
    "title": "Payment calculator",
    "description": "112 West 13th Street is a rare offering: a 20-foot-wide, five-story Greek Revival townhouse built in 1844, set on a beautiful tree-lined block in the heart of Greenwich Village. With its stoop, bay windows, and multiple terraces overlooking a lush private garden , the home radiates the charm and character that define the Village at its most timeless. The house extends across five full floors plus a finished roof deck , and includes an extension on three levels, offering a remarkable scale of indoor and outdoor living for this prime location. A wide brownstone stoop leads into a gracious foyer and on to a magnificent double parlor , distinguished by soaring ceilings, original plasterwork, and ornate pocket doors inset with antique glass. The south-facing bay windows draw in light throughout the day, while the rear parlor opens to a private deck with tranquil views over the deep, landscaped garden — a setting of mature trees and flowering shrubs that feels like a secret park in the middle of downtown. On the upper floors, multiple terraces extend the living space outdoors and frame garden vistas. A skylit artist’s studio crowns the home on the fifth floor, leading to a rooftop deck with open views of the Empire State Building and the city skyline. This magical perch, along with the garden below, makes the home equally suited for intimate retreats or large gatherings. Over the years, the townhouse has been a haven for creativity and a backdrop for a vibrant social life. International artists, filmmakers, and musicians have called it home. Opportunities of this caliber — a historic Greek Revival townhouse with width, depth, and a large garden in one of the most sought-after neighborhoods in the world — are exceedingly rare. 112 West 13th Street offers the chance to own a piece of New York history, while reimagining it for the next generation.",
    "list_price": 11995000,
    "price_per_sqft": 46855.46875,
    "images_count": 15
  },
  {
    "listing_id": "e5ec937844b1c773e2492c70999b069f",
    "property_id": "e19583c9d2c8c7efc5f38948b335ab81",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/227-W-17th-St-10011/unit-7th-Floor/home/198364163",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:32Z",
    "listing_type": "sell",
    "status": "ok",
    "title": "Payment calculator",
    "description": "For the first time ever, this bespoke full-floor loft — designed and reimagined by visionary architect, Charles Gwathmey — comes to market as a true collector’s item. Renowned for his 1992 renovation and expansion of New York’s Guggenheim Museum, Gwathmey infused this 4,800-square-foot residence, created for his son, with his unmistakable modernist touch. Purchased long before Chelsea became the cultural hub it is today, the residence embodies both timeless artistry and museum-quality refinement. A keyed elevator opens directly into a pristine foyer, unfolding to a dramatic great room lined with 14 oversized windows framing sweeping southwestern views . Soaring beamed ceilings , original columns, and pre-war detailing honor the building’s history, while Gwathmey’s minimalist aesthetic infuses the home with serene sophistication. The flexible layout balances scale with intimacy, offering two bedrooms plus a home office, a media room with built-in library shelving, and two and a half baths. Expansive walls provide a gallery-like backdrop for significant art collections, transforming the home into a private exhibition space as much as a residence. The chef’s kitchen marries industrial edge with refined craftsmanship: bespoke oak cabinetry, professional-grade appliances, a monumental steel-topped island, and a discreet glass-enclosed pantry with generous storage and full-sized laundry room. The primary suite is a sanctuary, complete with a massive custom walk-in closet and an extraordinary spa-inspired bath of stone and steel, awash in natural light. A sleek stainless-steel vanity and dramatic gallery-like open space anchor the design, complemented by a glass-enclosed shower and private powder room. The guest suite offers equal distinction, featuring a soaking tub and refined stone finishes. Located at 227 West 17th Street, a boutique eight-story building with only five residences, this offering is as rare as it is remarkable. Residents enjoy a live-in superintendent, secure entry, and close proximity to Chelsea’s acclaimed dining, galleries, the High Line, the Whitney Museum, and the Hudson River Esplanade. Pets permitted; 2% flip tax. This is not simply a loft — it is a once-in-a-generation opportunity to own a piece of architectural history.",
    "list_price": 10500000,
    "price_per_sqft": 13125.0,
    "images_count": 15
  },
  {
    "listing_id": "9879d8a08aec28397c48d9664b1d0e12",
    "property_id": "9719d91ca05b09be08316f0e5f1550c1",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/170-W-23rd-St-10011/unit-6J/home/45250534",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:33Z",
    "listing_type": "sell",
    "status": "ok",
    "title": "Payment calculator",
    "description": "Condo Style Home. This Home Features Full Bath, Eat In Kitchen & Dining Are. Centrally Located To All. Don't Miss This Opportunity!",
    "list_price": 620000,
    "price_per_sqft": 1405.8956916099773,
    "images_count": 14
  },
  {
    "listing_id": "98c68b2ce98121d3d8f5c36c5657fa20",
    "property_id": "e5b77b03718c77039dde5033b88d61ba",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/410-W-24th-St-10011/unit-11L/home/174301917",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:33Z",
    "listing_type": "sell",
    "status": "ok",
    "title": "Payment calculator",
    "description": "CLASSIC PREWAR 2 BEDROOM WITH OPEN VIEWS IN LONDON TERRACE  APARTMENT Rarely available high floor with open north and west views and a one-of-a-kind floorplan makes 11L in the iconic London Terrace Towers a stand-out. See the Empire State Building and the midtown skyline from every room. Enjoy a peaceful outlook from the primary bedroom west down tree-lined West 24th Street with a view of the High Line and Hudson River. This gracious two-bedroom combines timeless character with modern updates, offering the perfect balance of old-world charm and contemporary lifestyle. The spacious living and dining room is ideal for both entertaining and relaxing, enhanced by a lovely pass-through kitchen outfitted with high-end appliances, new countertops, and abundant cabinetry. The coveted winged bedroom layout ensures privacy, with each bedroom separated by the main living space. Oversized closets provide remarkable storage. The renovated marble bath features glass enclosed shower, soaking tub and custom cabinetry . Throughout this home, hardwood floors, prewar details, custom display cabinetry, generous proportions, thru-the-wall air-conditioning units, corner primary suite, secondary bedroom with dressing room and welcoming foyer imbue 11L with a comfortable lifestyle. BUILDING London Terrace Towers is one of Chelsea’s most celebrated prewar cooperatives, renowned for its full suite of services and amenities. Residents enjoy 24-hour lobby attendants, a live-in superintendent, on-site parking, bike rooms, laundry facilities, and basement storage (as available). Lifestyle perks include a regulation-sized heated indoor pool, steam rooms, saunas, a fully equipped private health club, and a beautifully landscaped roof deck with sweeping city views. London Terrace Towers is composed of four corner buildings occupying both Ninth and Tenth Avenues between West 23rd and West 24th Streets in the heart of West Chelsea. Completed in 1930 and converted to cooperative ownership in 1988, London Terrace Towers allows guarantors, co-purchasing, and up to 80% financing. After one-year, unlimited subletting is permitted with board approval. Pets are more than welcome. A 1% flip tax is payable by both buyer and seller. NEIGHBORHOOD West Chelsea is one of New York City’s most dynamic neighborhoods, blending art, culture, dining, and recreation along the Hudson River. Anchored by the world-renowned High Line, the elevated park that winds through the district with gardens, public art, and sweeping city views, West Chelsea offers a uniquely vibrant lifestyle. The neighborhood is home to an extraordinary collection of contemporary art galleries and cultural institutions, making it a hub for creativity and design. Dining options are equally rich, ranging from acclaimed restaurants and trendy cafés to casual eateries and wine bars, with Chelsea Market and the nearby Meatpacking District providing endless food and shopping experiences. Fitness and recreation thrive here as well. Residents enjoy jogging, biking, or strolling along Hudson River Park, which stretches for miles and includes piers with landscaped lawns, sports fields, dog runs, and playgrounds. The waterfront also offers kayaking, tennis, and the Chelsea Piers sports complex. Conveniently located near multiple subway and bus lines, West Chelsea combines convenience with culture and community—offering a lifestyle where world-class art, dining, shopping, and outdoor  Please call today to see this beautiful home.",
    "list_price": 1495000,
    "price_per_sqft": 2.2371598993203223,
    "images_count": 15
  },
  {
    "listing_id": "a4dd7689d4332c79060ae9d5452e7c70",
    "property_id": "c1fa73e4fb8ef5968375f39197e49572",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/3-MacDougal-St-10011/unit-3W/home/194293009",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:33Z",
    "listing_type": "sell",
    "status": "ok",
    "title": "Payment calculator",
    "description": "West-Facing Three Bedroom Condo in Greenwich Village  Nestled just a stone’s throw from iconic Washington Square Park, this expansive corner loft at 173 MacDougal Street is a rare three-bedroom, two-and-a-half-bathroom residence in the heart of historic Greenwich Village. Spanning over 2,250 square feet with southwest and northern exposures, the home is bathed in natural light and framed by serene garden views through 10 oversized windows. Tucked away on a tranquil residential block, the sun-filled, open-concept living room is anchored by a wood-burning fireplace and flows seamlessly to a private terrace —offering a peaceful retreat and a rare blend of indoor-outdoor living. Interiors by CeCe Barfield Inc. feature a remodeled kitchen with a Bluestar oven, custom-built storage, concealed drinks fridge, re-tiled primary bath, curated wallpaper, and a reimagined fireplace mantel. High ceilings and refined finishes complete the space. Originally built in 1890 as a Romanesque Revival structure and converted to an intimate eight-unit condominium in 2008, 173 MacDougal Street offers boutique living with prewar charm and modern comfort. Amenities include doorman service (Monday–Friday, 8 am–6 pm), virtual doorman coverage 24/7, key-fob secured elevator access, and private storage. Located just half a block from Washington Square Park yet remarkably quiet, this address offers exceptional access to the city’s top dining, shopping, cultural institutions, and transportation via West 4th Street Station—delivering the best of downtown living with a rare sense of calm.",
    "list_price": 5495000,
    "price_per_sqft": 21134.615384615383,
    "images_count": 15
  },
  {
    "listing_id": "40c3c8e356784ad31a17ca01e3e4bf6c",
    "property_id": "ebfc7191e5f5af23f882473effbbbf5c",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/244-W-23rd-St-10011/unit-5B/home/45234211",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:34Z",
    "listing_type": "sell",
    "status": "ok",
    "title": "Payment calculator",
    "description": "SUN-SPLASHED  &  RENOVATED, DREAMY DUPLEX w/ WORKING FIREPLACE & CENTRAL AC Supremely located and superbly unique, this renovated home is immensely livable and lovable. Bright, South-facing and pin-drop quiet, this dreamy, renovated, sun-filled duplex is a stand-out residence for all the right reasons.  Offering high ceilings that soar to over 10-feet, big, quiet, sun-splashed rooms, two newly-redone full baths, exposed brick , a wood-burning fireplace and central ac, this is the fresh and inviting, upgraded residence that feels like a real house — a real home.  Upstairs is the lofty living room with its three big, southerly windows, and its wonderful working fireplace. This is the entertaining floor and it offers a full, open dining room, foyer, a full, custom guest bath, and an upgraded kitchen with stainless appliances and good counter/cabinet space.  Down the straight-stairway is a bonus den /media/guest area and an office space – a bit of extra with over 10-foot ceilings — a flexible gateway to the king-sized bedroom and the big guest bedroom. Both bright, quiet bedrooms offer big South-facing windows, good closet space (the primary has a huge walk-in closet!), and are well served by a full, renovated, bath.  Sweetly situated in the peaceful and bright back of its historic building (former piano factory), this delightful, pet-friendly, unique residence offers sublime proximity to downtown’s most coveted shopping, dining, and cultural destinations – not to mention a plethora of easy transportation options (1, C, E, F, and M as well as M23). The building super lives nearby, and close to home are Madison Square Park, Eataly, Chelsea Market, Chelsea Piers, Little Island, Whole Foods, Fairway, Trader Joe’s, and the freshly refurbished Chelsea Hotel.  Beautiful, practical, unique and convenient, your renovated, sun-splashed, dreamy duplex — with working fireplace and central ac — awaits.  2% flip tax paid by purchaser. Transfer includes private storage area.",
    "list_price": 1795000,
    "price_per_sqft": 4284.00954653938,
    "images_count": 15
  },
  {
    "listing_id": "9c0552f67628f0226b5716594501aa42",
    "property_id": "a379bce01d7a6f0c35d5ebc14d31004a",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/340-W-19th-St-10011/unit-20/home/45144126",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:34Z",
    "listing_type": "sell",
    "status": "ok",
    "title": "Payment calculator",
    "description": "Welcome to your urban sanctuary 4 flights up at 340 West 19th Street. This charming 2-bedroom, 1-bathroom home offers a perfect blend of prewar detail and modern convenience. Step inside this lovely home to find high ceilings, with an entry hallway with offshoots to each room. Pin drop quiet, this home is complimented by windows offering multiple exposures with light throughout the day. There's a newly renovated bathroom complete with a Toto toilet and stall shower. In the kitchen, all new stainless appliances , including your very own washer dryer. The living areas accommodate easily a separate dining area and a large living room, perfect for social gatherings or just spreading out after a long day. Constructed in 1920, this pre-war, boutique walk up cooperative is beautifully maintained and is located in the heart of Chelsea. Amenities include fitness center , bicycle room , storage room , and laundry room . Close to transportation, shopping, and some of the best dining in NYC.",
    "list_price": 899000,
    "price_per_sqft": 1123.75,
    "images_count": 15
  },
  {
    "listing_id": "a00b4d6f3e669a919b4b9d0f58599b8f",
    "property_id": "f991df36c719051bdc9a64a45f34e1a4",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/525-6th-Ave-10011/unit-6G/home/198342009",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:34Z",
    "listing_type": "sell",
    "status": "ok",
    "title": "Payment calculator",
    "description": "Spring 2026 Occupancy. The Village West offers an intimate collection of 68 residences inspired by the timeless character of the Village. Its red brick, terra cotta, and arched detailing root the building in the neighborhood’s history, while contemporary touches like curved bay windows and landscaped terraces bring a modern perspective. Homes are defined by open layouts , finely crafted finishes , and abundant natural light, with many featuring private outdoor space . Amenities span four levels, including a two-tier landscaped courtyard , rooftop terrace, wellness facilities, lounge, co-working areas, and children’s playroom. Together, they create a residential experience that feels both distinctly modern and authentically of the Village.",
    "list_price": 1900000,
    "price_per_sqft": 2506.5963060686017,
    "images_count": 9
  },
  {
    "listing_id": "fef0655f94e36dff4efbb9a454f0c625",
    "property_id": "b04ad54c8f79fa299e4dc708bc7f95e4",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/61-W-9th-St-10011/unit-7B/home/45142671",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:34Z",
    "listing_type": "sell",
    "status": "ok",
    "title": "Payment calculator",
    "description": "Overlooking picture perfect West 9th Street, Residence 7B is a spectacular one-bedroom home with open southern views stretching downtown to One World Trade Center.   Bathed in natural light the living room is both elegant and inviting, featuring a wood-burning fireplace framed by handsome custom wood built-ins creating both beauty and incredible functionality. The kitchen has been renovated with bespoke paneled cabinetry and updated appliances.   The spacious bedroom easily accommodates a king-size bed and enjoys the same wide-open views, an oversized closet and a bright and airy windowed bathroom . & nbsp;   This is one of only three one-bedroom homes in the building with unobstructed southern views-making it a truly rare find.   Windsor Arms is a distinguished prewar cooperative with a full-time doorman, resident superintendent , and basement laundry. Perfectly positioned on picturesque West 9th Street, the building is just moments from Washington Square Park, Jefferson Market Garden, and the neighborhood's best dining and shopping.",
    "list_price": 1395000,
    "price_per_sqft": 4.317655652260037,
    "images_count": 15
  },
  {
    "listing_id": "1c7946ce87a59c2e911d2dd20c7ac912",
    "property_id": "8e790ef0eba4e5254e8314352f55617c",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/400-W-23-St-10011/unit-6JK/home/198331009",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:35Z",
    "listing_type": "sell",
    "status": "ok",
    "title": "Payment calculator",
    "description": "Penthouse 6JK offers true loft living on the top floor in the heart of Chelsea. This apartment is the whole length of the building on the north side, with over 50 feet of skylights and 9 windows facing East  &  North, allowing tons of light into this spacious home. The expansive living room with 15-foot ceilings, exposed brick and natural light from oversized skylights  &  windows showcases iconic views of London Terrace. The kitchen is complete with all white appliances, white spacious countertops that flow into a dining area perfect for entertaining. Four bedrooms and Two full bathrooms with the primary bedroom having a walk-in closet . Washer/dryer in unit  410 West 23rd Street is a charming, non-smoking, elevator building that includes a virtual doorman intercom which allows for buzzing in guests or deliveries, a central laundry room, bike racks, and a live-in super. The lobby and hallway renovations were completed in February. Pets, Pied-a-terre, and co-purchasing are all permitted. Subletting is permitted after two (2) years with board approval. With the High Line, amazing restaurants, vibrant arts scene, Chelsea Piers and Hudson River Park all just around the corner. Nearby transportation includes the C, E  &  1 subways and the Select 23rd Street crosstown bus or 9th Avenue Limited.",
    "list_price": 2700000,
    "price_per_sqft": 4440.789473684211,
    "images_count": 15
  },
  {
    "listing_id": "1406846c9ed485fed718b6b6c868de44",
    "property_id": "8cb87fca1d26427cd4782f8b27b9c974",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/250-W-15th-St-10011/unit-4CD/home/144829692",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:35Z",
    "listing_type": "sell",
    "status": "ok",
    "title": "Payment calculator",
    "description": "At nearly 1,600 square feet, Residence 4CD at 250 West 15th Street is a rare downtown home where architectural detail and thoughtful design come together at the intersection of Chelsea, the West Village and Meatpacking District. This two-bedroom, two-bathroom apartment has been reimagined with a modern sensibility that emphasizes clean lines, natural light, and bespoke finishes throughout. With an impressive 40 feet of frontage — the width of two townhouses — the spacious living room makes a lasting impression with its concrete feature wall and wood-burning fireplace, an unexpected combination that lends the space both texture and warmth. Custom millwork and shelving add refinement, while a series of five windows fill the room with northern light and frame treetop views over quiet, residential 15th Street. The dining area and kitchen form a seamless extension of the living space, featuring fully integrated appliances by Liebherr and Wolf, minimalist cabinetry, and a sculptural concrete island that doubles as a gathering point. The primary suite offers a generous walk-in closet that functions equally well as a dressing room, home office, or nursery. Its en-suite bathroom evokes a spa-like calm, complete with radiant heated floors and a towel warmer. The duplex layout provides separation and privacy for the secondary bedroom, tucked into the trees with sunny southern exposures and its own full bath — perfect as a private bedroom, guest suite, or quiet home office. Originally built as five adjoining townhouses, 250 West 15th Street has evolved into a boutique elevator cooperative while maintaining its sense of scale and character. Recent building updates include a redesigned lobby and refreshed hallways, with the added convenience of a live-in superintendent and laundry room. Located on a tree-lined block at the nexus of Chelsea, the West Village, and Meatpacking, the address offers a quiet residential feel with immediate access to the city’s best restaurants, shopping, and cultural destinations. Transit is unbeatable, with the A, C, E, L, 1, 2, 3, F, and M subway lines all within a block, along with convenient M11 and M14 bus service. Pets, pied-à-terre, co-purchasing, gifting, and guarantors are all welcome.",
    "list_price": 2395000,
    "price_per_sqft": 4073.1292517006805,
    "images_count": 15
  },
  {
    "listing_id": "46ea70dee7e8a73c17a978180d15260c",
    "property_id": "bb1d16cdf8f59110eb0892fcf8ff6949",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/253-W-16th-St-10011/unit-5C/home/45144665",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:35Z",
    "listing_type": "sell",
    "status": "ok",
    "title": "Payment calculator",
    "description": "Designer-renovated, spacious one-bedroom apartment located on a tree-lined street at 253 West 16th Street, Unit 5C, in Chelsea. Features a gallery-style entry hall perfect for art lovers, south-facing sundrenched exposures, hardwood floors, high ceilings, and moldings throughout. The custom kitchen is outfitted with high-end appliances , including a Bertazzoni cooktop and oven, Bosch dishwasher, Liebherr refrigerator/freezer with ice maker, and Miele hood. The king-sized bedroom includes custom closets, and the windowed bathroom boasts classic finishes. Google Nest–controlled central air conditioning and an in-unit LG washer/dryer complement the pre-war charm of this exceptional one bedroom with wainscoting and crown mouldings. The apartment can also be offered furnished with custom designer and vintage pieces. The building offers a live-in superintendent, elevator, bike room, common laundry, and additional storage for a fee. A C E L trains are located at the corner, with close proximity to Chelsea Market, Hudson River Park, the High Line, Chelsea’s world-class galleries, and Google’s NYC campus. Pets are permitted with board approval.",
    "list_price": 1160000,
    "price_per_sqft": null,
    "images_count": 15
  },
  {
    "listing_id": "2fd17b2c2592e8a763dafb062644604a",
    "property_id": "57b7d382ade46cf245271dc95490f9f1",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/445-W-19th-St-10011/unit-1G/home/45248587",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:36Z",
    "listing_type": "sell",
    "status": "ok",
    "title": "Payment calculator",
    "description": "Rare West Chelsea Duplex with Private 750 Sq Ft Terrace and Low Monthlys. Residence 1G at 445 West 19th Street offers a rare opportunity to enjoy townhouse-style living with the convenience of a condominium. This spacious two-level home is designed for comfort, versatility, and indoor/outdoor living at its best. The main floor features a bright, open living and dining area with oversized windows and a sleek modern kitchen . Step outside to your extraordinary 750 sq ft private garden terrace — a true urban oasis. Perfect for entertaining, dining al fresco, or simply unwinding, the terrace provides space rarely found in Manhattan. The lower level offers flexibility to suit your lifestyle, whether as a primary bedroom suite, media room, or home office, with the privacy and quiet that duplex living provides. Located on a tree-lined block in prime West Chelsea, 445 West 19th Street places you moments from the High Line, Hudson River Park, Chelsea Market, and some of the city’s best dining, shopping, and galleries. With its expansive garden terrace, flexible duplex layout , and unbeatable location, Residence 1G is the perfect balance of city living and private retreat. Ongoing special assessment of $366.75/Month. Ends in February 2026.",
    "list_price": 1895000,
    "price_per_sqft": 9475.0,
    "images_count": 15
  },
  {
    "listing_id": "ae7a3598b8486cc1f48eb51a1db8ecdf",
    "property_id": "85cf76484172545587677f407bceb917",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/152-W-13th-St-10011/home/45245765",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:36Z",
    "listing_type": "sell",
    "status": "ok",
    "title": "Payment calculator",
    "description": "TRIPLE MINT 20FT TOWNHOUSE WITH ELEVATOR  Located in the heart of Greenwich Village on a charming tree-lined street, moments from the best retail, restaurants and easy transportation, this 20-foot wide, red brick facade 1899-built house has been entirely renovated with every modern convenience and amenity while retaining its pre-war charm. To the north are the hottest spots in Chelsea, to the West the Meat-Packing District, Highline, Hudson River Parks and the Whitney Museum, on your East is Union Square and to the South all the magic of the Village beckons. CELLAR: The house boasts a fully finished cellar accessed by both stairway and elevator. While currently set up as a kid’s playroom, it can just as easily function as an office/media room/gym. There is a full bathroom and large laundry room with double full-sized washers and dryers as well as two large Subzero wine refrigerators. GARDEN FLOOR: Enter the garden floor under a superbly restored stoop through a set-back fenced in garden. This floor contains an additional bedroom, full bath and an impressively scaled custom crafted kitchen with Sie-matic cabinetry, Wolf, Miele and Sub-Zero appliances, stone counters and marble back splashes as well as an inviting counter seating area. The kitchen adjoins the wonderful great room with its soaring double-height ceilings and dramatic wall of windows overlooking the south-facing landscaped garden shaded by Greenwich Village’s most prized Magnolia tree and a mature evergreen which provide year-round privacy in addition to their beautiful greenery. This floor opens onto a large south-facing garden in this highly desirable landscaped townhouse block. PARLOR FLOOR: The gracious parlor floor is accessed by ascending the stoop stairway and entering through the beautifully preserved double doors. A large, loft-like space and fireplace frame stunning vistas to the North and South overlooking the garden. There is also a powder room on this level and a second stairway that connects the parlor to the Garden floor below. PRIMARY SUITE/3rd FLOOR: This entire floor is dedicated to the Primary bedroom suite. The enormous south-facing bedroom reveals huge double French doors that open up to overlook the garden. A large custom walk-through closet leads you to a spacious and elegant bathroom, beautifully outfitted with custom wood floors, exquisite tilework, dramatically scaled double shower and twin sinks. Its two windows flood the space with natural light. An additional home office completes the picture. FOURTH FLOOR: A lovely south-facing bedroom suite with private bathroom and enormous terrace overlooking the neighborhood gardens is just one of three bedrooms located on this floor, which share an additional bathroom. There is also a full-sized washer/dryer on this floor. PENTHOUSE/5th FLOOR: This light-filled room is accessible via elevator making it a convenient and wonderful addition, with a small terrace to the south and a larger terrace to the north. This floor is currently set up as an office/den. Skylights on this floor transport light all the way down through the stairway to the Parlor floor. Please inquire for additional details and to schedule a private showing!",
    "list_price": 19995000,
    "price_per_sqft": 30761.53846153846,
    "images_count": 15
  },
  {
    "listing_id": "0b6446287eebb5934311cfc6bd1ad481",
    "property_id": "5a9f6bd5bead0b02de07943fa362e0ce",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/32-Washington-Sq-W-10011/unit-14E/home/53324741",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:36Z",
    "listing_type": "sell",
    "status": "ok",
    "title": "Payment calculator",
    "description": "For additional perspective on this home, be sure to watch the video. First Showings will be Sunday, Oct 5th.   Right in the heart of New York is Washington Square Park, a neighborhood gathering place cherished for its vibrant energy and artistic legacy. Here, on its 100th anniversary, is 32 Washington Square West, one of the premier full service downtown prewar cooperatives.   Within, we find this thoughtfully renovated 7 room, 3 bedroom, 3 bath home; where great attention was placed on every detail. Upon entering, you're struck by the streams of sun and light provided from innumerable outward facing windows and four exposures .   As you traverse the commodious double-wide living space , you're seduced, and recognize that you're actually, tranquilly, hovering over the park itself. It's vibrancy sweetly softened by the trees and the high floor. These open North, East and South exposures keep you inspired throughout the day, whether your relaxing in the living room, cooking dinner in the open chef's kitchen with top of the line appliances and center island, dining and entertaining, tending to the days tasks or even retiring for the evening. This home further features, traditional moldings, stunning hardwood floors, and a working gas fireplace; there's also central air-conditioning and your own private washer and dryer and storage unit. & nbsp;   All of this is captured in this classic prewar cooperative in the heart of legendary Greenwich Village, a neighborhood which defines what it means to live among the art, culture, history and the here and now of New York City. & nbsp; The building was built in 1925 and is a full service building which includes a 24-hour doorman, live-in super, storage space and a gym. This home is accompanied with its own private storage unit as well. Pets are allowed. & nbsp; The & nbsp; flip tax is 2% of the purchase price paid by the purchaser.   Welcome home!",
    "list_price": 4925000,
    "price_per_sqft": 18942.30769230769,
    "images_count": 15
  },
  {
    "listing_id": "28cc161df5203004d63d43857b5e0aa8",
    "property_id": "ea09e6b2948b06c81127461505048794",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/270-W-17th-St-10011/unit-6I/home/45249386",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:37Z",
    "listing_type": "sell",
    "status": "ok",
    "title": "Payment calculator",
    "description": "Sunny West-Facing One-Bedroom Condominium at The Grand Chelsea  APARTMENT This inviting one-bedroom home at The Grand Chelsea offers an ideal combination of light, space, and function. With a west-facing exposure , the apartment is sun-flooded throughout the day and features a spacious comfortable layout. The well-proportioned living room is enhanced by a functional pass-through kitchen, designed for both everyday convenience and entertaining. The bath has been renovated with new fixtures and beautiful tiling that brings a modern touch, while ample closets throughout the apartment ensure excellent storage. The large bedroom comfortably accommodates a king-size bed and additional furnishings, creating a true retreat within the city. A thoughtfully designed layout maximizes both flow and usability. BUILDING  &  NEIGHBORHOOD Nestled in the vibrant heart of New York’s Chelsea neighborhood at the corner of 17th Street and Eighth Avenue, The Grand Chelsea Condominium offers an unparalleled living experience. This full-service building boasts 157 units across 21 stories, each exuding contemporary elegance and urban sophistication. Convenience is key, with iconic landmarks such as the High Line and Meatpacking District just a stone's throw away. Indulge your palate at renowned eateries like Cookshop, Shukette, and Jack's Wife Freda, or explore the latest trends in the neighborhood's diverse array of shops. Commuting is a breeze, thanks to easy access to multiple subway lines including A, C, L, 1, 2, 3, as well as bus routes, ensuring you're always well-connected to the city's pulse. Embrace the cultural scene with Chelsea Market and art galleries lining 10th Avenue, promising endless opportunities for exploration and discovery. For that buyer who wants to live in the heart of New York’s Chelsea neighborhood please look no further. There is an additional monthly assessment of $296.91.",
    "list_price": 995000,
    "price_per_sqft": 7.311069473529519,
    "images_count": 15
  },
  {
    "listing_id": "654e229a980e19d845cb13f9d02768c1",
    "property_id": "57bbfa282e142742e22f74130cb5a520",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/160-W-12th-St-10011/unit-104/home/109654053",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:37Z",
    "listing_type": "sell",
    "status": "ok",
    "title": "Payment calculator",
    "description": "The Greenwich Lane | West Village Sophistication with Iconic Views  Perched on the 10th floor of 160 West 12th Street at The Greenwich Lane, this 2,904 SF residence with a 552 SF landscaped terrace offers the ultimate blend of scale, design, and protected views . With stunning north and south exposures, three bedrooms, three-and-a-half bathrooms, a library, and interiors meticulously custom-designed by Thomas O’Brien of Aero Studios, the home is defined by its perfect layout and seamless flow - a rare combination in downtown living. The experience begins with a showstopping floorplan which provides for utmost privacy and grand-scale entertainment. The nearly 600sf great room , custom-designed kitchen , and one of the bedrooms all open to the sprawling south-facing terrace. Professionally landscaped and maintained, the terrace spans the entire length of the apartment, providing endless enjoyment of quiet conversation, beautiful dinners, social gatherings and more - all the while gazing at unobstructed views of the Freedom Tower and Lower Manhattan. Equally as impressive are the views to the north which include beautifully framed views of the Empire State Building. The protected panoramas are rare, iconic, and enduring. The windowed chef’s kitchen is just one heart of this special home. Perfectly laid out with beautiful doors to the terrace, it is a showpiece in itself. The custom kitchen features professional-grade appliances , bespoke cabinetry , lots of storage, and a pantry with wine cooler. Your culinary wish has been answered. The north-facing primary suite is grand and refined, with dual custom closets, and an elegant windowed 5-fixture en-suite marble bath with picture perfect views. The secondary bedrooms are graciously sized with en-suite baths and beautiful views. The wood-paneled library/TV room offers an intimate retreat and is easily convertible to a fourth bedroom. It's an incredibly zen room and the perfect private getaway. Thoughtful details abound throughout: coffered ceilings, bespoke millwork, and built-in art display cases. The discreet in-wall Sonos sound system enriches the living room, dining room, library, and kitchen. There is also multi-zone central air and heat as well as a home-sized laundry room. In addition, this special home also comes with a coveted parking space and private storage unit ($724.41/month). Residents of The Greenwich Lane enjoy unparalleled white-glove service with full-time concierge and doorman, a resident manager, and unmatched amenities that include a 25-meter swimming pool and hot tub, state-of-the-art fitness and wellness center with yoga and treatment rooms, golf simulator, screening room, children’s playroom, and a lush central garden. Live in one of the most coveted buildings in one of the most coveted locations of New York City. Shown by appointment only.",
    "list_price": 15000000,
    "price_per_sqft": 16592.9203539823,
    "images_count": 15
  },
  {
    "listing_id": "010c7a7e16ad05cfa1c337a8a48a1bed",
    "property_id": "0ad7117b71f9969c26de0256c6ac30fd",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/200-W-20th-St-10011/unit-416/home/198220513",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:37Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "3bdb0460e665262b4a15fa585719bcca",
    "property_id": "826f65304e1cefd99350469839ae2b0d",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/30-W-15th-St-10011/unit-6S/home/108529611",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:37Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "f8115fce15ad7a374bd84953eb0e88ca",
    "property_id": "f2a6130a7541991dd9895a9d4ef91643",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/155-W-18th-St-10011/unit-404/home/111244149",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:38Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "89bd3c56e8e0505fa79154df6b543101",
    "property_id": "1c6f11b0a4c2331e483e6d0755b56d79",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/55-W-17th-St-10011/unit-901/home/144054863",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:38Z",
    "listing_type": "sell",
    "status": "ok",
    "title": "Payment calculator",
    "description": "Search Overview Neighborhood Property details Sale & tax history Climate Favorite Hide Share Floor Plans Street View 25 photos For sale $2,795,000 Est. 2 bd • 2.5 ba • 1,652 sq ft It's been viewed 729 times. Tour it before it's gone! Tomorrow: About this home TBD Show more 5 days On Redfin Single-family Property Type 2018 Year Built $1,692 Price/Sq.Ft. $2,172/mo HOA Dues 1 space Parking Listing by Callie Katt Katt • Compass Listing by Kelly Bree • Compass Listing updated: Sep 30, 2025 at 08:17am Redfin checked: 2 minutes ago • Source: REBNY # RLS20051071 Around this home Schools Places Transit All Assigned Nearby 8 /10 Sixth Avenue Elementary School Public, PreK-5 • Assigned • 0.0mi 9 /10 P.S. 41 Greenwich Village Public, PreK-5 • Assigned • 0.3mi 8 /10 PS 3 Charrette School Public, PreK-5 • Assigned • 0.7mi 8 /10 Junior High School 104 Simon Baruch Public, 6-8 • Assigned • 0.8mi Provided by GreatSchools Payment calculator Property details Parking Garage/Carport Information Has Garage Parking Features: Garage Interior Bathroom Information # of Full Bathrooms: 2 # of Half Bathrooms: 1 Room Information # of Rooms (Total): 5 Laundry Information Features: In Unit Equipment Appliances: Cooktop, Dryer, Dishwasher, Freezer, Gas Cooktop, Gas Oven, Range, Refrigerator, Stainless Steel Appliance(s), Wine Cooler, Washer Interior Features Window Features: Window Treatments Unfurnished Flooring: Hardwood Other Features: Breakfast Bar, Built-in Features, Double Vanity, High Ceilings, Kitchen Island, Recessed Lighting, Soaking Tub, Walk-In Closet(s) Exterior Building Information Stories (Total): 19 Building Features: Elevator(s) Lot Information Lot Size Dimensions: 0.000000x0.000000 Property Information Entry Level: 9 Financial Tax Information Annual Amount: $37,092 Utilities Heating & Cooling Has Cooling Cooling: Central Air Has Heating Heating: Central Electricity and solar View estimated energy costs and solar savings for this home Internet View available providers Location Multi Unit Information Pets Allowed: Building Yes, Cats OK, Dogs OK # Of Units Total: 52 Public facts Beds: — Baths: — Finished Sq. Ft.: — Unfinished Sq. Ft.: — Total Sq. Ft.: 1,652 Stories: 19.0 Lot Size: — Style: Condo/Co-op Year Built: 2015 Year Renovated: — County: New York County APN: 08191330 Home facts updated by county records on Aug 6, 2025 Sale and tax history for 55 W 17th St #901 Sale History Tax History Today Sep 24, 2025 Date Listed (Active) REBNY #RLS20051071 $2,795,000 Price Dec, 2022 Dec 10, 2022 Date Price Changed REBNY #RLS10035349 $275,000 Price Mar 21, 2018 Date Price Changed REBNY #RLS10035349 $2,750,000 Price Oct 13, 2017 Date Listed REBNY #RLS10035349 $2,750,000 Price See all property history Join or sign in to view all info Climate risks Most homes have some risk of natural disasters, and may be impacted by climate change due to rising temperatures and sea levels. Flood Factor - Minimal Unlikely to flood in next 30 years Fire Factor - Minimal Unlikely to be in a wildfire in next 30 years Heat Factor - Severe 7 days above 99° expected this year, 15 days in 30 years Wind Factor - Major 27% chance of strong winds in next 30 years Air Factor - Moderate 5 unhealthy days expected this year, 7 days in 30 years View full report Provided by First Street Redfin Estimate for 55 W 17th St #901 Join or sign in to view all info Request showing Tour for free, no strings attached Start an offer Make a winning offer with the help of a local agent Ask a question (516) 665-0863 Nearby similar homes NEW 16 HRS AGO $10,500,000 2 beds 2.5 baths 4,800 sq ft 227 W 17th St Unit 7th Floor, New York, NY 10011 Listing by Sothebys International Realty $2,800,000 3 beds 2 baths — sq ft 69 5th Ave Unit 8G, New York, NY 10003 Listing by Douglas Elliman Real Estate $4,350,000 1 bed 1.5 baths 1,500 sq ft 130 W 12th St Unit 1A, New York, NY 10011 Listing by Corcoran Group NEW CONSTRUCTION $2,600,000 2 beds 2 baths 1,267 sq ft 525 6th Ave Unit 3A, New York, NY 10011 Listing by CORE Group Marketing LLC $6,500,000 3 beds 3.5 baths 3,008 sq ft 166 W 18th St Unit PHB, New York, NY 10011 Listing by Compass $5,395,000 3 beds 3.5 baths 3,300 sq ft 32 W 18th St Unit 7B, New York, NY 10011 Listing by Compass View more homes New listings for sale in 10011 NEW 14 HRS AGO $11,995,000 5 beds 4.5 baths 4,256 sq ft 112 W 13th St, New York, NY 10011 Listing by Compass • Provided by REBNY NEW 16 HRS AGO $10,500,000 2 beds 2.5 baths 4,800 sq ft 227 W 17th St Unit 7th Floor, New York, NY 10011 Listing by Sothebys International Realty • Provided by REBNY NEW 16 HRS AGO $1,495,000 2 beds 1 bath 668,258 sq ft 410 W 24th St Unit 11L, New York, NY 10011 Listing by Sothebys International Realty • Provided by REBNY NEW 20 HRS AGO $5,495,000 3 beds 1.5 baths 2,260 sq ft 173 Macdougal St Unit 3W, New York, NY 10011 Listing by Compass • Provided by REBNY NEW 21 HRS AGO $1,795,000 2 beds 2 baths — sq ft 244 W 23rd St Unit 5B, New York, NY 10011 Listing by Compass • Provided by REBNY NEW 21 HRS AGO $899,000 2 beds 1 bath — sq ft 340 W 19th St #20, New York, NY 10011 Listing by Compass • Provided by REBNY $1,395,000 1 bed 1 bath — sq ft 61 W 9th St Unit 7B, New York, NY 10011 Listing by Corcoran Group • Provided by REBNY $2,700,000 4 beds 2 baths 23,608 sq ft 400 W 23rd St Unit 6JK, New York, NY 10011 Listing by Sothebys International Realty • Provided by REBNY VIDEO TOUR $2,395,000 2 beds 2 baths 1,588 sq ft 250 W 15th St Unit 4CD, New York, NY 10011 Listing by Compass • Provided by REBNY Details provided by REBNY and may not match the public record. Learn more. More real estate resources Zip Codes Cities Neighborhoods Minor Civil Divisions Popular Searches 07024 homes for sale 07302 homes for sale 07047 homes for sale 07306 homes for sale 07307 homes for sale Manhattan homes for sale New York homes for sale Jersey City homes for sale Midtown Manhattan homes for sale Union Square homes for sale Bloomfield Township homes for sale Livingston Township homes for sale West Orange Township homes for sale Millburn Township homes for sale Wayne Township homes for sale Houses for rent in Manhattan Agents near me Yonkers, NY homes for sale Manhattan Housing Market Houses for sale near me New York, NY homes for sale Scarsdale, NY homes for sale Land for sale near me Manhattan, NY homes for sale White Plains, NY homes for sale Open Houses near me Rochester, NY homes for sale Manhattan Property Records Condos for sale near me Buffalo, NY homes for sale NY New Listings Join us Become an Agent Get referrals Careers Find homes faster About us Why Redfin? Community Impact Diversity & Inclusion Life at Redfin Press Investors Blog Real Estate News Find us Contact Us Help Center Advertise Subsidiaries Rent. ApartmentGuide Affiliated Business Rocket Close Rocket Mortgage Countries United States Canada Copyright: © 2025 Redfin. All rights reserved. Updated January 2023: By searching, you agree to the Terms of Use , and Privacy Policy . Do not sell or share my personal information . REDFIN and all REDFIN variants, WALK SCORE, and the R logos, are trademarks of Redfin Corporation, registered or pending in the USPTO. California DRE #01521930 Redfin is licensed to do business in New York as Redfin Real Estate. NY Standard Operating Procedures New Mexico Real Estate Licenses TREC: Info About Brokerage Services , Consumer Protection Notice All mortgage lending products and information are provided by Rocket Mortgage, LLC | NMLS #3030; www.NMLSConsumerAccess.org . Licensed in 50 states . This site is not authorized by the New York State Department of Financial Services for mortgage solicitation or loan applications activities related to properties located in the State of New York. Redfin Corporation is an affiliated business of Rocket Limited Partnership. Each company, and their subsidiaries, are separate legal entities operated and managed through its own management and governance structures. If you are using a screen reader, or having trouble reading this website, please call Redfin Customer Support for help at 1-844-759-7732 . REDFIN IS COMMITTED TO AND ABIDES BY THE FAIR HOUSING ACT AND EQUAL OPPORTUNITY ACT. READ REDFIN'S FAIR HOUSING POLICY AND THE NEW YORK STATE FAIR HOUSING NOTICE . GreatSchools Ratings provided by GreatSchools.org .",
    "list_price": 2795000,
    "price_per_sqft": 4286.80981595092,
    "images_count": 15
  },
  {
    "listing_id": "e92309a61adc6332483d67123e82d6c4",
    "property_id": "1b4830e15cd8ea38010f75f83bf01e55",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/165-W-20th-St-10011/unit-6ABC/home/194396270",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:38Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "077686f04b673c4663af7adc213ef74a",
    "property_id": "55eacf59ffa6140098a1b0cb3eb2b85f",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/42-W-13th-St-10011/unit-5F5G/home/198207472",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:38Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "e009723c349b8f42c95b03e07f270946",
    "property_id": "8ccd77b659d8859810bbf13deac6c9f1",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/2-5th-Ave-10011/unit-5B/home/45141938",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:38Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "456c347ea9f5d329c0cc3bf156ca35b9",
    "property_id": "b854b56746f3626a0e4e1a235d9a6c01",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/124-W-23rd-St-10011/unit-4B/home/53327769",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:38Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "9abf0df87441c34f608c7b2ede66d034",
    "property_id": "8386ce066356b95895dca9dbef983e8e",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/85-8th-Ave-10011/unit-5H/home/45174165",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:38Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "9bce8cf54ddaab15e1bd0a627e9ec44d",
    "property_id": "dceb670316584b07c0068eae400f3da8",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/505-W-19th-St-10011/unit-2/home/108580813",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:39Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "0826d741076776a30172ab1bf2d0ca97",
    "property_id": "08bc1373c0b5034894020364a87adadf",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/448-W-23rd-St-10011/home/45248402",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:39Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "2ef578576d23a59cdb85493eae7547a5",
    "property_id": "99fdd17be18650f1bbac14edad49a058",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/16-W-16th-St-10011/unit-9GS/home/45174843",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:39Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "5367bfd1c9375842713c4c589a89a455",
    "property_id": "4ad86bda61294dd8b11b8c368de957a1",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/128-W-23rd-St-10011/unit-8B/home/176504148",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:39Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "bec6ba15c2c7ed5b0ec2983817b11f86",
    "property_id": "392906b5e9882fa5cbdc7ca94c0ab8fc",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/456-W-19th-St-10011/unit-6-7F/home/115480444",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:39Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "8e73b8395493775fc10c756a314aa50f",
    "property_id": "3bb515c01c92c3bf6d778995f27c9be0",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/456-W-19th-St-10011/unit-45D/home/115254061",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:39Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "d3b7c8a52fb116d3228880b08ba65066",
    "property_id": "3900c68c40eedc19e39b570426b74132",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/210-W-19th-St-10011/unit-4J/home/45249152",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:39Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "17d4ccc1a538ec68944491c72d6a6e0d",
    "property_id": "64671b98485d9e031761aa9de853523f",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/30-W-9th-St-10011/unit-5A/home/183731056",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:39Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "524db3f63fa4682f3e6bdc0f281eedbe",
    "property_id": "b6c50aa65a3830d6e35ae02793e046e6",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/77-7th-Ave-10011/unit-14L/home/45144908",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:40Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "72ec4b0e7461c16e2a6d44bfa22c96f8",
    "property_id": "065aa2588aa3334e69eac3499e81c695",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/162-9th-Ave-10011/unit-2AB/home/198192839",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:40Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "012ba3c6ade1b4a02e0b4a003d2010c4",
    "property_id": "8eaba0fe4eb938a93bbde8a2ba6cb939",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/520-W-23rd-St-10011/unit-3H/home/109991814",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:40Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "cc7c820d3764f10730d692f2fb7af55c",
    "property_id": "9bbdf933103110e227e597880109d036",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/260-W-22nd-St-10011/unit-2/home/63690905",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:40Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "40a4afe3e80850c7cae73aef51318916",
    "property_id": "960ad776f8900498bd189c8e54f86af2",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/509-W-23rd-St-10011/home/45248332",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:40Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "abcfd68eb19c1c7e2a453c4ecf252e9f",
    "property_id": "3f379d37e594a0707df69a73f3f8e485",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/13-W-13th-St-10011/unit-6JS/home/170062462",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:40Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "1c11ee0e8c4caa2c6188a84e48be7605",
    "property_id": "24a7cfe59b420bab5f946ad21ee749f4",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/66-W-11th-St-10011/unit-PARLOR/home/115335283",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:40Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "fd775282dbee79f4b60aa6ee9bca0e38",
    "property_id": "27bd6adb82785ed7bbbc87e901792047",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/525-6th-Ave-7G-New-York-NY-10011/456693894_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:41Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "e994d83d04d429d08c376f9b37d4a73d",
    "property_id": "04c734a0315950851b31083ae62b933c",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/34-W-12th-St-New-York-NY-10011/2070296330_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:42Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "08765135cedb50654ab03cb5f1b52c64",
    "property_id": "c23abe0bfdd013505c6bf9b3236ad272",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/326-W-17th-St-APT-3E-New-York-NY-10011/219649095_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:43Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "00d8d1dfef798ee67032b7e2e7534788",
    "property_id": "a139c87055345346c4cd1aea6377b679",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/152-W-13th-St-New-York-NY-10011/31499900_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:44Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "658eb3cd73a6ab75cfc2f4e7bd7bb6f0",
    "property_id": "e2dff834afc01ee7af7526474d8cd9da",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/445-W-19th-St-APT-1G-New-York-NY-10011/31502102_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:45Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "800301b38c97ce99ff070334882921d1",
    "property_id": "b8735aead13f3e7bcdb5aad437801c92",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/159-W-24th-St-APT-5B-New-York-NY-10011/117451102_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:46Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "b224ca0faf6b63f0a74c0902b5f679ac",
    "property_id": "5e30cd7c9ab447a1a30aa313d541ac9a",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/459-W-18th-St-APT-1-New-York-NY-10011/97527333_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:46Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "1bb805a86a8579836627350ac08108e8",
    "property_id": "8ea919462ea1824b1b96b36e05494f4d",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/448-W-23rd-St-New-York-NY-10011/456940301_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:47Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "5fc7e8dffdc727d24393dc594bfd5f2e",
    "property_id": "7f6919c4f1acf7a91f8aeb5bd57ddbf7",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/122-Waverly-Pl-New-York-NY-10011/143087924_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:48Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "716a02fd7dee47b2826faf5a8d962436",
    "property_id": "2e657069f86c9ec6bd701f0eb671024d",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/228-W-16th-St-APT-2A-New-York-NY-10011/244842667_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:49Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "d394299853f23658d9f0d7e0a90c3395",
    "property_id": "745aeb1192b17c1b680af45adca40e09",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/60-W-20th-St-PENTHOUSE-1-New-York-NY-10011/456741561_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:50Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "b73bf02f83898a1ddbf50c631a9e7428",
    "property_id": "81cb3ef01a6f968f0d9fe236c9b7b57a",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/160-W-12th-St-APT-104-New-York-NY-10011/219646189_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:51Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "8e3e278b3d5ba05c255592af5de32ef2",
    "property_id": "9eae8fe7ef01b10592c7d82358c4bcac",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/125-W-11th-St-New-York-NY-10011/31499890_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:52Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "8fad45bb5ee1d587acc8114d89d35991",
    "property_id": "9251f4d47f4a7d39eba5936067054561",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/447-W-18th-St-GAL2-New-York-NY-10011/442660404_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:53Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "882c8836a83846642d25f9be96dac6f1",
    "property_id": "a92e3809e41f3514ab77de5a051de6b9",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/354-W-20th-St-New-York-NY-10011/300186245_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:53Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "61e4d107d8047b96e846ed029016c8c5",
    "property_id": "82952081845c68d67bce13439794a506",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/60-W-9th-St-New-York-NY-10011/143088932_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:54Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "9efde0cd5dbd8ffdfc9d713e11b3732f",
    "property_id": "e3c191586462faa3e8c76b9b6bcadb6b",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/16-5th-Ave-6-New-York-NY-10011/455156140_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:55Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "dd3cce3367e69fc1494efa7a3493d0c7",
    "property_id": "1a6e7b1199bb5ca9d26142dbb66309c3",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/228-W-17th-St-2B-New-York-NY-10011/2063323548_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:56Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "b0d179dff8dd6f48eea45bab1dd53bc3",
    "property_id": "54129d36045fd41b7aef243c9c0e75cd",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/127-W-11th-St-New-York-NY-10011/121184335_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:57Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "faa329c837298f5883921a176dd172cb",
    "property_id": "fc3afedfee232cd443ba36400009fb86",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/165-W-20th-St-6ABC-New-York-NY-10011/2066877752_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:58Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "af2d255fcf0cecb146e85b373e395e45",
    "property_id": "b24847a915cd7173ae0fd20f8b97eb9f",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/32-Washington-Sq-W-APT-14E-New-York-NY-10011/119911566_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:53:59Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "06c4dce54479ba1b8f4bd17396b89b41",
    "property_id": "027ec85f05b53150f008713f165dcd22",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/153-W-12th-St-New-York-NY-10011/456642911_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:00Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "b6a1213a600025d66378eb53c9b18ac7",
    "property_id": "ea3375334588ce2f3b515873d1dcd82e",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/555-W-22nd-St-11AW-New-York-NY-10011/2062787806_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:01Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "66e8148fb298c0c66d612a99a092ac91",
    "property_id": "72c93f9207af78103df5f7261313e6e5",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/217-W-20th-St-New-York-NY-10011/118328073_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:01Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "340aa6cdd0ec4cbcff89f191b31699fb",
    "property_id": "f29e08a66a00d892488046b857aef678",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/310-W-18th-St-APT-2B-Manhattan-NY-10011/72515146_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:02Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "70cc9115d139013f0ac3e5a6856209aa",
    "property_id": "d752488b46fd3518d72c3b8218ae7f5f",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/505-W-19th-St-PENTHOUSE-2-New-York-NY-10011/219648395_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:03Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "d98ecc17b2553783dab012c7618dc1ca",
    "property_id": "757f624ec06121dcaac08b1a04ef8196",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/55-W-9th-St-New-York-NY-10011/31498803_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:04Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "bddd226695b2b8a062ac30e950a68869",
    "property_id": "7682bb56fd7fbbe775f1fa0cef021f6d",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/520-W-23rd-St-APT-3H-New-York-NY-10011/219648482_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:05Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "a9a13e5a1b6ef28896a4738a2fc80d3d",
    "property_id": "5009e13b8d0a03a77905775365e4dae6",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/210-W-21st-St-APT-2RE-New-York-NY-10011/244877726_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:05Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "4b06c4b1ab664a02fe9fb2b208bb776a",
    "property_id": "d84ec59ca6da73b01b57ff9925124869",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/166-W-18th-St-New-York-NY-10011/112517574_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:06Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "9b85da9461b221b46dfdaad32e40cb1e",
    "property_id": "57a4f9c409b5af8d909cd233d659479b",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/250-W-15th-St-4CD-New-York-NY-10011/249785211_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:07Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "1ea6e9fd26c6af37be85f5f195eab9a9",
    "property_id": "0476309e844495a3529fb7a4a047ef17",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/260-W-22nd-St-APT-2-Manhattan-NY-10011/122976735_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:08Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "b430db6b63d27a93791288c5442f84c1",
    "property_id": "65fce212a7ff3bb7d97b65f40a56be23",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/439-W-21st-St-12345-New-York-NY-10011/2060363808_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:09Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "c603c59f467dade04e50adec0b3b2f1c",
    "property_id": "dc84f91f16ea4486b7978b9f14899cb7",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/32-W-9th-St-UNIT-5A-New-York-NY-10011/442155933_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:10Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "835329f1c5a5981554fe6ce61fc745e4",
    "property_id": "fd4c0023ba37a572164c7c7470588099",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/20-W-12th-St-New-York-NY-10011/441752315_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:11Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "c9f2b53cfeaa390f8c306251a2a850ce",
    "property_id": "95c0c631c0a87682943622490fdf95ce",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/61-W-9th-St-APT-7B-New-York-NY-10011/72513417_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:12Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "537f75adb3155c3360f76a24cbd51ba8",
    "property_id": "6bf57dde2106a584a2dad8777fb08e97",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/456-W-19th-St-UNIT-6-7F-New-York-NY-10011/112515667_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:12Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "e2c0eedf53706a98df294e9b95c1a30e",
    "property_id": "a712d2132069a7ca07d20bf8ffb465c8",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/30-W-15th-St-APT-6S-New-York-NY-10011/244873826_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:13Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "33550b9ea9660b29e5bc5aa4cb7d2a57",
    "property_id": "afc643077d02fa69033637864df53469",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/515-W-23rd-St-PENTHOUSE-New-York-NY-10011/2077017053_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:14Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "3f6af574ef8a7f5ad09a59989a81b8d3",
    "property_id": "8de91d1b5a317e5a32f09a531c4147b6",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/340-W-23rd-St-New-York-NY-10011/83940486_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:15Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "3f55503913916c15aa9a3ff621eb785b",
    "property_id": "cbd4b39b3c61849c9b8d3db370d700b5",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/145-W-12th-St-APT-4-5-New-York-NY-10011/219646463_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:16Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "3fdb9f1cd146a616ee7b15e3711914b1",
    "property_id": "dfab4dd8dbe696c1940c8af946775f1c",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/129-Greene-St-10012/unit-2NDFLR/home/198365270",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:16Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "edbd30f618b49a33bc58e880aeea6b12",
    "property_id": "d43c5c557eb49c1373104cdee1b1ed7d",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/160-Bleecker-St-10012/unit-1FE/home/198199504",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:16Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "be603c36e0ba6c13e94d5a1f1e22491f",
    "property_id": "c041991de654c308a7567d36e47b1a1c",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/14-E-4th-St-10012/unit-802/home/198343669",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:16Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "54797b68759938831eee52128241415c",
    "property_id": "84c1c970200dfed7b89132c587245080",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/83-Spring-St-10012/unit-2-3/home/114712971",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:17Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "95c134cfc1c7143f708da352135d7683",
    "property_id": "f459318d5e74645df742ab2f32c16921",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/250-Mercer-St-10012/unit-C415/home/45328205",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:17Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "77e83c0061deb6005e814a26303ed982",
    "property_id": "35f89d89f0af7863937fd0598d648542",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/250-Mercer-St-10012/unit-B408/home/171127552",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:17Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "a99ae9b1bc2c697465f07289422ffe5a",
    "property_id": "76863635c47e607286e4bfde56783fb6",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/90-Prince-St-10012/unit-PHN/home/194766517",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:17Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "7a28ef1f688267fbe156df64e4f8aadd",
    "property_id": "092d9e8cbeb23a465f78d5a2aeb38cf5",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/214-Mulberry-St-10012/unit-3E/home/45172259",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:17Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "db2987bff0fdc3bd87de0f5fd540d0d0",
    "property_id": "4993f10519c0c637071fd858fccac7a0",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/40-Bleecker-St-10012/unit-3H/home/148048468",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:17Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "27b3bc88d44ea8f5008a70b156c285c6",
    "property_id": "2bab8ba821c88b2b77fda81fef61cce6",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/552-LaGuardia-Pl-10012/unit-6/home/198075772",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:17Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "6675c39efa6f10c7a482996bddbb67a1",
    "property_id": "5e2810602d305b0a3da311d6c21ca632",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/211-Thompson-St-10012/unit-LJ/home/45141784",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:17Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "d4a78e3944f558dfb7066323cbfe4d36",
    "property_id": "e395c6fea27b7f950c0f8d862818c868",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/160-Bleecker-St-10012/unit-8GW/home/53324667",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:17Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "baa0de989a15d4e1b978a3ccbd461e58",
    "property_id": "0372789917ed2aee0b4b77a086e15887",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/30-Sullivan-St-10012/home/109654452",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:17Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "cb90842cf77ba8d3ee6727bdd639386e",
    "property_id": "1e4ef7b8b3eddc9ca0fb980a8b5b9a05",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/211-Thompson-St-10012/unit-5C/home/115281345",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:18Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "6503626a721b2cd1b470e1b84a8b4b43",
    "property_id": "62ccd19d971e599b987d8e693c77fb68",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/124-Thompson-St-10012/unit-30/home/197821706",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:18Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "5340ab2e7ce8598b60f875780b66e444",
    "property_id": "959499433ab498ffa2f88259a22ab355",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/181-Thompson-St-10012/unit-3/home/45199061",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:18Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "5019cb2e709cd1825ffd2754b238e02e",
    "property_id": "1bda2e9537303e7628660eb08da35528",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/543-Broadway-10012/home/45340428",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:18Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "4fa9100a9e378cab5d355948003aea34",
    "property_id": "469bd5b5fb49d5aa304a4f2028893fa7",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/56-Crosby-St-10012/unit-3A/home/45313220",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:18Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "e08e3cb107d223b2220ec8fcd26677ae",
    "property_id": "842c90620fc8f060a5d793dfcc087a3a",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/77-Bleecker-St-10012/unit-618/home/45327110",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:18Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "57d9787e64cb5347231e12a9d7c81e41",
    "property_id": "27bb152ff6e53169b09178ddd2adb760",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/421-W-Broadway-10012/home/45243089",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:18Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "54066825db24de6ac53adb0c5ed2a89d",
    "property_id": "12c3f39d58f9167eb61fc4d2ceb158d0",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/520-Laguardia-Pl-10012/unit-6N/home/45141753",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:18Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "a3fa5ac8373c003c8655dfb51456df3d",
    "property_id": "44362aafbe5899bc3097ad961bac245e",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/97-Crosby-St-10012/unit-1/home/45141068",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:19Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "519a7747b52185b68f359d8d05aaa083",
    "property_id": "71c5739265190bdab2a34ff1cc59afd0",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/77-Bleecker-St-10012/unit-320/home/45141715",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:19Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "1f5d41f47d04c97303698348b5f22afc",
    "property_id": "2c958e685a3fe82d6ce5df760de7e9f7",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/76-Crosby-St-10012/unit-2-A/home/186017282",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:19Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "8281f94f9cf49b0a43f50484ec3574f7",
    "property_id": "e105f244fb3d1290d54deb3f6b2e158f",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/419-W-Broadway-10012/unit-4S/home/189803017",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:19Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "eabce99456e665fc4a2c0cac244c8dfc",
    "property_id": "0ace947f6ca57c988e8d384d00173e9b",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/250-Mercer-St-10012/unit-C216/home/143853970",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:19Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "0a8bd35483e738fc01a6f96fd743fd39",
    "property_id": "7457b453d074ddf646d5c5d5f7dae70f",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/48-Bond-St-10012/unit-4B/home/45201544",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:19Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "8be26cc7d9241646bd9a872987df80f2",
    "property_id": "6d3f69a91245fd1ebcbb1fbbac6236ae",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/200-Avenue-of-the-Americas-10013/home/45243003",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:19Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "5e4a5648d7cdae378ce8a956a59cb614",
    "property_id": "e56d897a1b9c83de30d1ca7decdb33b5",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/10-Sullivan-St-10012/unit-12A/home/109653976",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:19Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "5286b7005500a12bd540fafed8e42010",
    "property_id": "72c72d379c62884245e020d4afecbfe5",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/180-Thompson-St-10012/unit-5F/home/45166715",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:19Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "6c7fce421c805335228cfb304bdfd204",
    "property_id": "ce0a1df38b1a8c2cf81c1b85eb552557",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/63-Greene-St-10012/unit-2d/home/184609620",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:19Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "2bc7cba5aa98298b1eddc532964b4903",
    "property_id": "2fb91cdf53eec214258e9b8f0d146411",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/77-Bleecker-St-10012/unit-421E/home/102005297",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:20Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "20cfffc33d82f28e10714d7e40197271",
    "property_id": "73b2f02714af22ccba7977d1a0b6fa1b",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/110-Mercer-St-10012/unit-4/home/198078129",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:20Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "a97043108b5c7a96e9fddd4b004c81c5",
    "property_id": "937acf50eea295a06eb35e237406e050",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York-City/210-6th-AVE-10012/unit-3G/home/198044753",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:20Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "decb8e457c9c00d1bf4849e111889041",
    "property_id": "4a13b5632eaefb787e857ab663dafc0b",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/520-Laguardia-Pl-10012/unit-2N/home/45230244",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:20Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "71ceb3ae722b56bcac0ad844cd668a3d",
    "property_id": "c8ea644fc32ddcdd7799feb880cb3c46",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/36-Bleecker-St-10012/unit-3DC/home/196908214",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:20Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "f9f7f13eca3aac0e28086855558a0294",
    "property_id": "d9c323b9b89734ea797ad461f7ff4c23",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/77-Bleecker-St-10012/unit-816/home/197590203",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:20Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "840fb4bfac950fcee87789428dcdeb25",
    "property_id": "3d0ee054f905ff5d1b869e274f4fb66d",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/211-Elizabeth-St-10012/unit-5E/home/45320188",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:20Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "a415c74777954102daa9a0c882c47cc4",
    "property_id": "75a4a7a3b6700bc2456829995f0ae85e",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/508-Broadway-10012/home/45317141",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:20Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "0951fe1b362d9d1a154704a9a24fe3bc",
    "property_id": "e9704617df6b85c7362b02a39045ad12",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/101-Thompson-St-10012/unit-19/home/45141134",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:20Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "7c442db2627567dc566153313d2bb625",
    "property_id": "d557a8f59a422839c427631aafc3852d",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/131-Thompson-St-10012/unit-6F/home/45141262",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:20Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "91737fc7f311a59c1094607942361b85",
    "property_id": "71b7d8ff98cb1f1a79894360f86b0cd1",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/83-Thompson-St-PENTHOUSE-New-York-NY-10012/443978128_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:21Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "1f95112e6597c9cd9519e68beedf47ac",
    "property_id": "cadee4a3559da45c01208bf455974dc4",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/160-Bleecker-St-APT-1FE-New-York-NY-10012/2098627543_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:22Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "92a70e2abca7c777cd253b2307907d89",
    "property_id": "0d4f38c5bc26dc43172dfe690c562348",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/160-Bleecker-St-APT-8GW-New-York-NY-10012/119910644_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:23Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "733494211f60a5edc363a9170b2d747e",
    "property_id": "1acf8c0401640d10fc1252056374389d",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/131-Thompson-St-APT-6F-New-York-NY-10012/244725435_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:24Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "18ecc3a68377fc85c46bcd15b0d32cc2",
    "property_id": "a1bad7fc4b1877b0b480bbdfd544f55a",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/203-Prince-St-New-York-NY-10012/31497624_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:25Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "8c9d54aaec249e4b182f67b046e8371f",
    "property_id": "1d2378d19009f67d9d65223a512ce1e3",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/30-Sullivan-St-New-York-NY-10012/2090165103_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:26Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "0c73f7a3954288f8235798615d6f3878",
    "property_id": "9844c4dd12e7f2de25bb321740bcea27",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/70-W-3rd-St-PENTHOUSE-3-New-York-NY-10012/452054416_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:26Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "7ac6340f7b11299edc493474988a951f",
    "property_id": "b5060a998f156b1de4b515a23d4fbc33",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/250-Mercer-St-APT-C415-New-York-NY-10012/110541307_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:27Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "688c6e70653630af8147131f2edfde7e",
    "property_id": "bc24d79a08897caf3cb758a5bd59bebc",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/10-Sullivan-St-APT-12A-New-York-NY-10012/219641112_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:28Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "0f1bc609ecd48db7d13e22fa74fb4086",
    "property_id": "0b4e36bd3eecc860d45e2c846cf3b0e6",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/3-Minetta-St-UNIT-5B-New-York-NY-10012/442164571_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:29Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "52c2bc20e21e7da9472a959ddfa5e2b8",
    "property_id": "e746c74cc17794912cd44d9d974c04b6",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/64-Macdougal-St-APT-22-New-York-NY-10012/244742422_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:30Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "1a9826314161d265a6bb2c26173788ac",
    "property_id": "d77bff0627c8da091baad8eff31c5d2c",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/152-Elizabeth-St-UNIT-PENTHOUSE-New-York-NY-10012/300200303_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:31Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "2a717c3d0f813936fee9c99128e9121f",
    "property_id": "557e2f359b20f1795265747adaff529d",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/159-Bleecker-St-1-New-York-NY-10012/447521271_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:32Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "d754b54da3c81aff3024822b2cd011d6",
    "property_id": "b1b32d2d0bef6b3d1002650cc07da8e1",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/214-Mulberry-St-3E-New-York-NY-10012/79493977_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:33Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "4c0e7eb265476917b4f4ffd328fceade",
    "property_id": "ef123ea1aa7e3547e1405eade45457a6",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/36-Bleecker-St-3DC-New-York-NY-10012/455788050_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:33Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "15fe2850bb7dd8eed6c1c11a911367de",
    "property_id": "4d3f6d407e6c301a02e840ec2ab869e3",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/181-Thompson-St-APT-3-New-York-NY-10012/80379313_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:34Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "005f40ec0d3a1cd2e6c7809cbd0f856c",
    "property_id": "aea71fc0d86d069a09b369c873fbb9c9",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/308-Mott-St-New-York-NY-10012/112330704_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:35Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "bcfd29fe199e6aa697d67aa318865a04",
    "property_id": "a9d1d703c95ab059383842f2c1ed5b96",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/44-Mac-Dougal-St-New-York-NY-10012/31497616_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:36Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "25e59a3024236d57cc088f63fece975f",
    "property_id": "7bf7bdb258e7a95c5ad743359496de71",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/56-Crosby-St-APT-3A-New-York-NY-10012/55500985_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:37Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "f1e329d083a597b75e9425e14ef912b2",
    "property_id": "223bf4c718bf4a42033318001873d307",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/100-Prince-St-APT-5W-New-York-NY-10012/447567920_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:38Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "ff545de28fc2926d64d2bb5b0ca7f0a2",
    "property_id": "f5d2241ee1d74452e70698dfc0264ac8",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/419-W-Broadway-4S-New-York-NY-10012/456641007_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:39Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "bb456d17ee08d86d09d60a25cad30c3b",
    "property_id": "9ab1fff057bdd285df1108f0ffdf76cc",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/54-Bond-St-PENTHOUSE-New-York-NY-10012/401899171_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:39Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "f9046b14e9df55c8a6f684a79d7ec9d8",
    "property_id": "6770ced85be71a284b66bda0bbc20546",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/54-Macdougal-St-APT-1-New-York-NY-10012/453543113_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:40Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "4bb9604e39a50292998b2985d254bc68",
    "property_id": "52155a6f41bdb3ee6a5f65a5112a6303",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/175-Bleecker-St-APT-18-New-York-NY-10012/2102679940_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:41Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "ba63c711de5b456f200bd0f6bcbbb314",
    "property_id": "452ae2b565abbd3c18f2c42ddc6ccc42",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/83-Thompson-St-4-New-York-NY-10012/450427335_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:42Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "285f59a607a96e4a487438c081f501f3",
    "property_id": "92e37b2f2e9fb83262fa5e2828cda88d",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/552-Laguardia-Pl-APT-6-New-York-NY-10012/2128672071_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:43Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "c9ed46ea10b045e44afc3175bcd44f2c",
    "property_id": "ed5a752b408776615f0cf19c65f394bc",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/224-Mulberry-St-UNIT-PENTHOUSE-New-York-NY-10012/442173506_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:44Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "3f24a271d1d0e816fc1d1fe575195000",
    "property_id": "a8e02d4e8caa8e00570bfedad41f7a0d",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/421-W-Broadway-PENTHOUSE-New-York-NY-10012/456381832_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:45Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "32403bf11e2c465bf64a73c336bfeeeb",
    "property_id": "0e34fa36d7fd6ad7b6f750f472d5c318",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/14-Prince-St-APT-5E-New-York-NY-10012/31497180_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:46Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "28b27350c6ee20bd2169d6e57b07421b",
    "property_id": "50cf0303e8f91c92f3d67459ea4fefe8",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/92-Greene-St-4-New-York-NY-10012/450218437_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:46Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "023d581f9976e01e1a267e6d12764ef9",
    "property_id": "3b89eaafd9d2cc8bc0ca2e0fdaf4a449",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/77-Bleecker-St-APT-813-New-York-NY-10012/88060685_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:47Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "ae982e16b57da78d471432fd7947659d",
    "property_id": "82b3c69959985ac7cd3484fc5d392193",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/1-Great-Jones-St-10-New-York-NY-10012/2096696039_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:48Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "f4a3f487a26311aebaf5ae473034066e",
    "property_id": "c78ab0b071ed0fc9caec92fb25f168fd",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/63-Greene-St-New-York-NY-10012/442155438_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:49Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "1dec1cd4c6e727833a483c4b0236f366",
    "property_id": "e391ada88179bdb0c9980e533a338c1d",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/124-Thompson-St-APT-30-New-York-NY-10012/2094582713_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:50Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "69b5520a8c0a066f64c984606f8c4a8a",
    "property_id": "a9d2e6e499371dbbe6972393b6741516",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/48-Bond-St-APT-4B-New-York-NY-10012/81949776_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:51Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "9da934edf3dd547aa35296b1a5d268fb",
    "property_id": "7d1dcf1101366bcc99dfecd8fe3d8755",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/565-Broadway-APT-8-New-York-NY-10012/244825534_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:52Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "fd50ea0e77cbfd783fc8a8d4eb15efdf",
    "property_id": "9519a2199e8aa7139c9bb53b22a9ae73",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/90-Prince-St-New-York-NY-10012/63864409_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:53Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "a003768b54e3373fae5f1d940bc047a2",
    "property_id": "4c9bc61d775a7ba0cb230e25058968b8",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/200-Mercer-St-UNIT-PH4C-New-York-NY-10012/453353589_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:54Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "67b0783936d04260c371fe993989f8a4",
    "property_id": "ee0492ad8c85f0c5450617cd5b4824e3",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/129-Greene-St-FL-2-New-York-NY-10012/2092464387_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:55Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "650fdbcbcb99b565036c580e70664284",
    "property_id": "e9e1effe797504513808996c5ab92351",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/520-La-Guardia-Pl-6N-New-York-NY-10012/440238902_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:55Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "2bd5de9e36c20b0d5c898fa466245753",
    "property_id": "8b8050480a261632842aea1493c69bee",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/242-Lafayette-St-APT-4S-New-York-NY-10012/113056776_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:56Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "ace393865a9e4d8fd3e0ba2680154df1",
    "property_id": "54717939c797837eee23e00b6adcf343",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/165-Christopher-St-10014/unit-6M/home/45173812",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:56Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "a2b53141b58f08a610ea6aaf7a9ba345",
    "property_id": "1f8a6dc67629a285e2253b754f8fbed6",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/79-Perry-St-10014/unit-1B/home/185374050",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:56Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "ee5404765d67a53cbae52b2086fee54a",
    "property_id": "0869d48c897749b70a3303ef9f704835",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/555-Hudson-St-10014/home/198210864",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:57Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "f041372be69fd0d5f907c08cabe28017",
    "property_id": "ff035850df866c33c9eebaf1450ae9b6",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/2-Horatio-St-10014/unit-7C/home/198202160",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:57Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "687eb8526db076e082511daa5a14101b",
    "property_id": "fc5a44012e98318311616edfe8df9540",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/147-Waverly-Pl-10014/home/45194396",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:57Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "cc5705e5e6a56cc2004cc40b9bc25277",
    "property_id": "2ec3f23a66fc4457f392021fd0ce8cfb",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/160-Leroy-St-10014/unit-9-BS/home/198208086",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:57Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "40be141ce25ee75cb3d46ac30ebda523",
    "property_id": "80f0d47be95cbc6767f5464226f01958",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/2-Horatio-St-10014/unit-4B/home/56545043",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:57Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "febcb4fe582152870f1da595c18e711e",
    "property_id": "a027683f018b43872a205f73736d8847",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/167-Perry-St-10014/unit-4ACD/home/175194945",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:57Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "77f36137904b4dcc4cfd6a08bd544f00",
    "property_id": "f4235689697b99ea00ade4aca9f07196",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/9-Barrow-St-10014/unit-3H/home/63689971",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:57Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "1b6d19713105e3c5eb5846732e617834",
    "property_id": "0daddc102254c3b63c78902f0a23f65a",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/22-Cornelia-St-10014/unit-7/home/197643103",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:57Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "c9c7312bcbc7c091901ec22fca59e8b7",
    "property_id": "b78aca96dfb5f68d7a5e948921e67fb1",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/204-W-10th-St-10014/unit-7A/home/197497708",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:57Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "4d8583381295778b97d405b3894be464",
    "property_id": "0921444a8bb99d54370bf5bec874b2f3",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/13-Downing-St-10014/unit-9/home/115076191",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:57Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "2c50d22fc25f266cd1d01d3314c89fa9",
    "property_id": "d38916ded308e7f0e8f1729ee428abb9",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/238-W-11th-St-10014/home/45246271",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:58Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "81f459d5a5fcbfdab477dc56a0c6ad85",
    "property_id": "042726944d716993d565066dc1fff3bc",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/140-W-10th-St-10014/unit-3R/home/114717155",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:58Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "30ad811c1863e95bb4eb36806652ac2a",
    "property_id": "42b420794ed2d3617dccc31603b7a7bf",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/700-Washington-St-10014/unit-2B/home/45144004",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:58Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "e95f60224ddfc5d4fff2b418aa9607db",
    "property_id": "5f3efe77dc875befdb21f9899da94280",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/49-King-St-10014/unit-5/home/63689813",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:58Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "3841acc1f75dc9e2c2948cb28443479c",
    "property_id": "54343140d266d4ce8b621b881ace1233",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/146-Waverly-Pl-10014/home/45245222",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:58Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "beed26e41a9fb2e2d82a10a231176fde",
    "property_id": "1b07494d83aa99dd2b4f50c26f8a6c23",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/39-Barrow-St-10014/home/45245498",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:58Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "583f4b0d914bc9599a3a49548b3e3303",
    "property_id": "26e356df67033b143b8590c434474eec",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/25-Charles-St-10014/unit-3D/home/113072292",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:58Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "b352b186663fdd8e8e3baea0784b116f",
    "property_id": "35009d32c948b779ed9bc51ec716ce1b",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/100-Barrow-St-10014/unit-7-8A/home/197986516",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:58Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "0b37f3dc260a741b851e1bd4ee543407",
    "property_id": "43b0f99ae00ab6f41f8b83054c283a50",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/345-W-13th-St-10014/unit-2E/home/45247466",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:58Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "86924a8b06433f38f4cd955a9d9a186f",
    "property_id": "d6b6d88ad7e6706d37c3bac4ca3d77e6",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/2-Cornelia-St-10014/unit-5-06/home/45245599",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:58Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "66c3b3f1213267062fc96fb189300f24",
    "property_id": "8e50c24c35f4f4d61e1e7bb0f4905404",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/708-Greenwich-St-10014/unit-2F/home/108529823",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:59Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "cb38cfb4ab44403304ec2e0dd527180f",
    "property_id": "44fbf0f11bde15b148202a2bdc741e85",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/323-W-11th-St-10014/unit-2WE/home/45202322",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:59Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "f7c341fc194d48e9a3fe34e7f2e9c4aa",
    "property_id": "4eb6454e9bb9fb1cd8d3b330afdd3ed9",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/59-Barrow-St-10014/unit-1/home/144130309",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:59Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "21d399a9f5eec94dcc7869ccca3344fd",
    "property_id": "1374862c38b4b1ffed03868dd5653258",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/4446-Barrow-St-10014/home/197842592",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:59Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "8a5006092244046d626365dfbfd2ac38",
    "property_id": "d2ac077e6b8ad6b0865a06b94d236580",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/16-Christopher-St-10014/home/45245164",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:59Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "34583e3f286ed85fd9a860a7b9fde74a",
    "property_id": "546d4f93800492772a9de1dfae42fa47",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/323-W-11th-St-10014/unit-4W/home/45143917",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:59Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "32a20b0b979afc0ac65226c69e3225f4",
    "property_id": "17eb042176914f43de83984d4abfd8d0",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/56-Jane-St-10014/unit-4B/home/45143725",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:59Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "e5e9d47e2cade1dda9d7e4c109935ee5",
    "property_id": "9981b9e862f2e3d986dc6e84fd161384",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/601-Washington-St-10014/unit-THE/home/195817944",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:59Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "c2e4abbf5126ac13ef80a8ff68fbe454",
    "property_id": "72f7f73ddc70f0984371489d022b7504",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/822-Greenwich-St-10014/unit-1C/home/198136229",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:59Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "5adc12602d43344db1d3606b81cdc62c",
    "property_id": "9ecfe69e9a4759cc7f38d8d0877bac3c",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/129-Barrow-St-10014/unit-3A/home/45167019",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:59Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "f7335244e10020c63da7e28256850fc4",
    "property_id": "dcdba4fec116f18bf141fc9fd9a669fd",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/77-Perry-St-10014/unit-5D/home/45339039",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:54:59Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "92ed40f313ae9e3e5bdbcd656495e17b",
    "property_id": "5400732234b8c6c2505d7cbaa4a64da9",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/304-W-10th-St-10014/unit-4B/home/45210567",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:55:00Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "bac53765d148e4b4e49236e5a282928a",
    "property_id": "efaf393eca8794a3dcf67f839ce98dff",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/29-Vandam-St-10013/home/45243037",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:55:00Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "8f76ccacbb02d6b28ab07a52fc9cc8ba",
    "property_id": "736159f88a3f5fc3c2882f35b84f41f7",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/67-Bedford-St-10014/home/45245005",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:55:00Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "17ce400e4b87bc152fdf4e2953c38ccb",
    "property_id": "a734a764d2babeea91b74fb5303bd181",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/165-Charles-St-10014/unit-1/home/115212353",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:55:00Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "aee698b75da68a6fce9a5e7868bbd18d",
    "property_id": "d1e93de6d17f42a615ca961c7ae1f4ef",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/42-Downing-St-10014/home/45317245",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:55:00Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "e699bbf3474aa29475f37e8642afb8f4",
    "property_id": "c005ee8401cc5d294d87c00dc0a643b5",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/376-West-St-10014/unit-5B/home/45143390",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:55:00Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "21e6e961e91ff0831727a50b4362d39f",
    "property_id": "d235b8a3df8b910c9b130302a96ae8d1",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/87-Barrow-St-10014/unit-1D/home/45166833",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:55:00Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "633b46b25c422ce7e592f2e210a66dbe",
    "property_id": "3c628dfaa4335dcc24982fb3a0453db4",
    "batch_id": "2025-10-01_zips91",
    "source_id": "redfin",
    "source_url": "https://www.redfin.com/NY/New-York/193-Waverly-Pl-10014/home/45246168",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:55:00Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "fa3f3706ff96f6fa97b0262316247567",
    "property_id": "9c05467e728a47342f9a5fb42c81b8d3",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/235-W-11th-St-New-York-NY-10014/31500530_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:55:01Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "e968e8eb9f376171c42d909c4a03302d",
    "property_id": "f17e525e911304d9b9a867cab1478de2",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/146-Waverly-Pl-New-York-NY-10014/219635874_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:55:02Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "3d2af4d31d49eee426631b956c4c9554",
    "property_id": "281900b52a96ba9e8ec74ff2887b4759",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/78-Morton-St-New-York-NY-10014/143090515_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:55:03Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "09d59faf6532c2cb739249d8713e6722",
    "property_id": "f686249c359b4188cc46dd3dc087e971",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/323-W-11th-St-2WE-New-York-NY-10014/81776255_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:55:04Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "32a6369649d761a32b086bb6db741431",
    "property_id": "19df9fdb7f72e094ee9b608c354937fa",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/10-Bedford-St-New-York-NY-10014/2082691512_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:55:05Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "299f473aac7378e9b279d8ffb29d8539",
    "property_id": "cb324599bc134b4561dd82ba88e2c05b",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/39-Barrow-St-New-York-NY-10014/31499234_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:55:06Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "bbd977d24265b72a1d35911966ab6a94",
    "property_id": "9f983916d107fe0a3cb5c25e7d7a01b3",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/197-W-Houston-St-TOWNHOUSE-1-New-York-NY-10014/452717175_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:55:07Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "4e2f512b6c1b5274516160c31ada2592",
    "property_id": "343c77a94fd08554a3851296b4a99c7b",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/147-Waverly-Pl-APT-PENTHOUSE-New-York-NY-10014/80004426_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:55:08Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "1946a25016e46a0a47fda50bf8ff9335",
    "property_id": "ea8259c63f6031d33580bab7b1d27592",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/700-Washington-St-APT-2B-New-York-NY-10014/72514580_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:55:09Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "ce977af56d6fce09821fe17620a62b92",
    "property_id": "89209ded044c258194056bce50e72e61",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/160-Leroy-St-UNIT-SOUTH-9B-New-York-NY-10014/447094729_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:55:09Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "3cbb5c748368c93e7dce3b348c74cfe7",
    "property_id": "9684f8244d76a8abb309f7f346396f70",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/79-Perry-St-1B-Manhattan-NY-10014/339010159_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:55:10Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "c8f8339d99788b35fcce5cf8cfe9ca50",
    "property_id": "15faaa3006a32c61c817db4a2cca2a85",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/238-W-11th-St-New-York-NY-10014/31500488_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:55:11Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  },
  {
    "listing_id": "be9028a5dfe71c0facf9873e348794d7",
    "property_id": "24a96eefcfbe43cfa09576f05985f8f0",
    "batch_id": "2025-10-01_zips91",
    "source_id": "zillow",
    "source_url": "https://www.zillow.com/homedetails/345-W-13th-St-APT-2E-New-York-NY-10014/31501412_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-10-01T13:55:12Z",
    "listing_type": "sell",
    "status": "blocked",
    "title": null,
    "description": null,
    "list_price": null,
    "price_per_sqft": null,
    "images_count": 0
  }
]