[
  {
    "listing_id": "84cac3720233ae261178ee9160834580e94cda29",
    "property_id": "84cac3720233ae261178ee9160834580e94cda29",
    "batch_id": "2025-09-29_zips91",
    "source_id": "s1629579",
    "source_url": "https://www.zillow.com/homedetails/704-Broadway-PENTHOUSE-New-York-NY-10003/442755067_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-09-29T09:24:45.863Z",
    "list_date": "2025-09-29",
    "days_on_market": 1097,
    "description": "In an elite group of the most rarefied homes in the world, this exceptional penthouse sprawls over 12,000 square feet of private indoor and outdoor space. Five expansive bedrooms and palatial living space occupy an interior 8,000 square feet, while two rooftop terraces and a heated swimming pool spread over an additional 4,000+ square feet. Located in vibrant, coveted Noho, this spectacular home is a study in stunning modernism and traditional design with no expense spared and no detail unconsidered.",
    "listing_type": "sale",
    "status": "Active",
    "title": null,
    "list_price": 32500000,
    "price_per_sqft": 4062.5
  },
  {
    "listing_id": "9eabc47006233d46f7b7d2badcb41931111a4baa",
    "property_id": "9eabc47006233d46f7b7d2badcb41931111a4baa",
    "batch_id": "2025-09-29_zips91",
    "source_id": "s1782630",
    "source_url": "https://www.zillow.com/homedetails/135-E-19th-St-New-York-NY-10003/31506443_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-09-29T09:25:28.914Z",
    "list_date": "2025-09-29",
    "days_on_market": 61,
    "description": "A rare chance to own one of New York City's last truly remarkable, architecturally significant townhouses. Rich with history and character, this Gramercy Park gem stands out as one of the most storied private residences in the country. The home's origins are as unique as its design. First built in 17th-century Amsterdam by affluent Dutch owners, it was carefully dismantled and shipped to Manhattan in 1845, initially finding a home on the Upper West Side. In 1910, it was moved once again, this time to its current location, where it was reimagined by celebrated English architect Frederick J. Sterner. Commissioned by sugar magnate Joseph B. Thomas, the home became known as the Joseph B. Thomas House. Since then, it has remained strikingly intact, most recently owned by a world-famous fashion designer and philanthropist. For decades, it hosted iconic parties and served as a creative salon for some of society's most influential women. The exterior is a dramatic showcase of Gothic Revival style, with bold stained-glass windows on every level, intricate stone detailing, and a distinctive, storybook roofline. Massive carved wooden doors open into nearly 7,000 square feet across four floors plus a mezzanine, offering both grandeur and a sense of intimacy. Inside, the home makes a lasting impression from the moment you step into the grand entry foyer, where a classic Flemish stone floor sets the tone. The showpiece is the \"Italian Room,\" as named by Sterner himself, an awe-inspiring space with a barrel-vaulted ceiling, ornate plasterwork, paneled walls, and a monumental stone fireplace. A glass-roofed solarium just beyond fills the home with natural light and greenery, anchored by a tranquil fountain. Downstairs, a wine cellar and tasting room provide a hidden, atmospheric retreat. The formal dining room evokes a European country estate, wrapped in warm wood paneling; perfect for anything from intimate dinners to lavish entertaining. Upstairs, the current layout includes six bedrooms and six bathrooms, with ample room to reconfigure into luxurious suites, dressing rooms, or staff quarters. A beautifully carved winding staircase connects each level. Additional features include a chef's kitchen, a prep kitchen, laundry center, dumbwaiter, and both formal and service staircases. Thoughtfully crafted renovation plans are available for review. This is a rare, once-in-a-generation opportunity to own a home with unmatched history, architectural integrity, and transformative potential. Located in the heart of the famed Gramercy Park neighborhood, you are just moments away from the best dining, shopping, and entertainment Manhattan has to offer.",
    "listing_type": "sale",
    "status": "Active",
    "title": null,
    "list_price": 7995000,
    "price_per_sqft": 1176.081200353045
  },
  {
    "listing_id": "be7b76df9aaf82477e00978cb95ec8210d495dfe",
    "property_id": "be7b76df9aaf82477e00978cb95ec8210d495dfe",
    "batch_id": "2025-09-29_zips91",
    "source_id": "s1769868",
    "source_url": "https://www.zillow.com/homedetails/226-E-12th-St-APT-1H-New-York-NY-10003/244898726_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-09-29T09:26:24.811Z",
    "list_date": "2025-09-29",
    "days_on_market": 144,
    "description": "This bright and open 1-bedroom in a prime East Village location offers move-in-ready comfort in a classic prewar building. Inside, the residence features an open kitchen, a spacious living / dining area, and a generous bedroom. Sunlight pours in through south-facing windows, creating a warm and welcoming atmosphere throughout the day. Residents of 226 East 12th Street enjoy a host of amenities including a stunning Art Deco lobby with terrazzo floors, a live-in superintendent, porter services, laundry room, bike storage, and private storage lockers. The building sits on a serene, tree-lined block surrounded by historic townhouses, offering a sense of peace just moments from downtown’s vibrant energy. Unbeatable access to transportation: Union Square’s N/Q/R/W and 4/5/6 trains are just moments away, along with the L train at both Third and First Avenues.",
    "listing_type": "sale",
    "status": "Active",
    "title": null,
    "list_price": 390000,
    "price_per_sqft": null
  },
  {
    "listing_id": "08af56c7ac2c3a8f901e6b6474d7818b28667334",
    "property_id": "08af56c7ac2c3a8f901e6b6474d7818b28667334",
    "batch_id": "2025-09-29_zips91",
    "source_id": "s1787474",
    "source_url": "https://www.zillow.com/homedetails/51-Saint-Marks-Pl-APT-10-New-York-NY-10003/244697169_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-09-29T09:27:14.425Z",
    "list_date": "2025-09-29",
    "days_on_market": 26,
    "description": "Discover a thoughtfully updated residence on one of the most iconic blocks in the East Village. This through-floor home offers an incredible amount of living space, triple exposures, and a blend of pre-war character with modern upgrades. The apartment features high ceilings, tree-lined views, and excellent natural light throughout the day. A renovated kitchen with exposed brick, stainless steel appliances, and ample storage flows seamlessly into the living area, while the newly remodeled bathroom includes artisan tile, a walk-in shower, and contemporary fixtures. Additional enhancements include bamboo hardwood flooring, updated lighting, baseboard heating, modern ceiling fans and brand new Miele washer and dryer! Currently configured as a one bedroom plus home office, the space can easily be used as a two bedroom with a split bedroom layout providing both privacy and flexibility. Located in a well-kept, self-managed cooperative with only two apartments per floor, this ten-unit building offers a welcoming and efficiently run environment with exceptionally low carrying costs. Residents enjoy proximity to Tompkins Square Park, neighborhood gardens, Citi Bike stations, and some of downtown Manhattan’s best cafes, restaurants, music venues, and nightlife.",
    "listing_type": "sale",
    "status": "Active",
    "title": null,
    "list_price": 850000,
    "price_per_sqft": null
  },
  {
    "listing_id": "280eb00ff4caca47c6818a0f8f627b8d9e6f8912",
    "property_id": "280eb00ff4caca47c6818a0f8f627b8d9e6f8912",
    "batch_id": "2025-09-29_zips91",
    "source_id": "83942583",
    "source_url": "https://www.zillow.com/homedetails/243-E-17th-St-New-York-NY-10003/83942583_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-09-29T09:29:00.013Z",
    "list_date": "2025-09-29",
    "days_on_market": 143,
    "description": "Welcome to this extraordinary 28-foot-wide townhouse, perfectly positioned with a centerline view spanning over the serene Stuyvesant Square Park. This beautiful home has been elegantly restored and well-maintained. This grand home showcases timeless architectural details, featuring a three-bay façade, round-arched doors and windows, a cast-iron balcony with a foliate pattern spanning the home's width, and a detailed paneled cornice. This beautiful home truly exemplifies grand and gracious proportions throughout. The five-story home was originally built during the 1850s, boasting nearly 8,500 sqft, with a spectacular private rear garden. This special home effortlessly blends historic charm with contemporary luxury that features an elevator, six spacious bedrooms, five full baths, and two powder rooms. Enter through a gated street entrance to a front garden leading you into a sophisticated entry vestibule. This garden level features a sprawling eat-in chef's kitchen with a butler’s pantry and a stylish powder room. The highlight is the grand formal dining room drenched in natural light featuring a wood-burning fireplace. The scale of this space is truly remarkable—perfect for hosting unforgettable moments. The Clive Christian-designed kitchen features top-of-the-line appliances from Viking and Sub-Zero; marble countertops, and painted pine cabinetry. Directly off the kitchen, you can access the private rear garden, giving you peace and serenity. The dimming bistro light set-up above the garden and ivy-clad garden walls creates a truly special space where you almost forget you are in New York City. Ascend to the Parlor level, either by your private elevator or the two distinguished staircases, and prepare to be captivated by soaring 16-foot ceilings and a dramatic floating curved staircase. This level sets the stage for an unforgettable, entertaining experience. Full-length, round-arched windows featuring original muntins bathe the space in glorious natural light. The striking cast-iron Juliet balcony spans the width of the home. For added versatility, a well-appointed room offers the perfect setting for a home office, library, or comfortable reading nook. At the rear of this level, you'll discover a luxurious primary suite complete with a spa-like en-suite bath, a spacious walk-in closet, and a private terrace overlooking your garden. The third level is highlighted with three generously sized bedrooms, two full bathrooms, and a convenient laundry area. An additional cozy room adds flexibility and can easily be converted into a fourth bedroom, home office, or playroom. The fourth floor features a spacious living room, bar, bedroom, and a full bathroom, along with a large walk-in closet tucked away from a secondary primary sleeping area. A bonus room adjacent to the entertainment area can serve as a home office, nursery, music room, or guest room, depending on your needs. The thoughtful layout makes this level incredibly adaptable. Easily accessed via elevator, internal staircase, or a dedicated private entrance beneath the stoop, the English basement level combines historic charm with functionality. This level also includes a spacious media room, powder room, storage options, A/V closet, a second laundry area, and direct access to the garden. Another massive bedroom with a separate entrance allows ultimate flexibility. Rounding out this exceptional home is a new energy-efficient boiler and HVAC systems, along with new roofing membrane, drainage, down piping, and exterior decking, which are just a few of the many recent upgrades. Last but not least, a significant amount of additional unused FAR offers you the opportunity to expand, creating a truly once-in-a-lifetime townhouse in Gramercy Park. Just moments from Gramercy Park, Friends Seminary, and some of New York City’s finest restaurants and shopping destinations.",
    "listing_type": "sale",
    "status": "Active",
    "title": null,
    "list_price": 13995000,
    "price_per_sqft": 1646.4705882352941
  },
  {
    "listing_id": "25647352b3e19c9551990b23f774ac09fdbd7281",
    "property_id": "25647352b3e19c9551990b23f774ac09fdbd7281",
    "batch_id": "2025-09-29_zips91",
    "source_id": "s1787667",
    "source_url": "https://www.zillow.com/homedetails/54-E-1st-St-New-York-NY-10003/31496561_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-09-29T09:31:15.794Z",
    "list_date": "2025-09-29",
    "days_on_market": 27,
    "description": "Charming 1-Bedroom Apartment in the Heart of the East Village! Welcome to this move-in ready 1-bedroom apartment, nestled in one of New York City's most vibrant and eclectic neighborhoods—East Village. Located on a tree lined street, this apartment boasts a perfect blend of classic charm and modern comfort. Set on the top floor of a well maintained building, this 1-bedroom home receives an abundance of light throughout. The spacious living area features high ceilings, large windows, hardwood floors, and an exposed brick wall, giving off that iconic New York vibe. The open-concept layout flows seamlessly, providing plenty of room for both relaxation and entertaining! The kitchen is thoughtfully equipped with sleek countertops, a breakfast bar, dishwasher, and washer/dryer. There is ample cabinet space, making it an ideal space for home cooking and creativity. The bedroom is cozy yet allows for a full-sized bed and dresser. Located in the heart of the East Village, you’ll be surrounded by trendy cafes, bustling restaurants, unique boutiques, and lively nightlife. Enjoy quick access to public transportation, giving you easy access to the entire city, while also enjoying the charm and character of this iconic neighborhood. The well-run, financially sound building has extremely low maintenance, a favorable sublet policy, easy access to subways, and allows pets with board approval. Co-purchasing, gifting, guarantors and pied-a-terres are considered on a case-by-case basis. Please note there is a monthly assessment of $846 until February 2026.",
    "listing_type": "sale",
    "status": "Active",
    "title": null,
    "list_price": 525000,
    "price_per_sqft": null
  },
  {
    "listing_id": "59dfdb62f7f1802a02ae9ecc8f66328aff4c870a",
    "property_id": "59dfdb62f7f1802a02ae9ecc8f66328aff4c870a",
    "batch_id": "2025-09-29_zips91",
    "source_id": "5b23392a-74d6-4779-ad1e-3801285a2331",
    "source_url": "https://www.zillow.com/homedetails/125-E-4th-St-APT-26-New-York-NY-10003/244863048_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-09-29T09:32:06.346Z",
    "list_date": "2025-09-25",
    "days_on_market": 4,
    "description": "Experience a rare blend of prewar character and modern comfort in this beautifully maintained 2-bedroom, 1-bathroom home in the East Village. Inside, you’ll find original hardwood floors, restored moldings, transom details, and soaring 9’8” ceilings that create an airy feel throughout. The windowed kitchen is fully renovated with full-sized appliances, including a dishwasher, while the updated bathroom also enjoys natural light. The spacious primary bedroom offers a striking perspective: as night falls, relax while the Empire State Building lights shimmer in the distance, and each morning wake to the sparkling city skyline beyond your window. The versatile second bedroom provides generous closet space, abundant natural light, and easily accommodates a full-sized bed—making it an excellent option for guests, a home office, or a nursery. Building amenities include a live-in porter, central laundry facilities, and a bike room. This boutique co-op is conveniently located near the F/M, 6, N/R/W subway lines, Astor Place, St. Mark’s Place, NYU, Whole Foods, and some of Manhattan’s best dining, shopping, and cultural destinations. Positioned on a higher floor, this residence offers peace, privacy, and authentic East Village character—an opportunity to own a timeless piece of New York City.",
    "listing_type": "sale",
    "status": "Active",
    "title": null,
    "list_price": 649000,
    "price_per_sqft": null
  }
]