[
  {
    "listing_id": "f73ba7958cc56d1f006840d55c715dc85ff595ea",
    "property_id": "f73ba7958cc56d1f006840d55c715dc85ff595ea",
    "batch_id": "2025-09-28_zips91",
    "source_id": "59158767_zpid",
    "source_url": "https://www.zillow.com/homedetails/20-Tarleton-Rd-West-Roxbury-MA-02132/59158767_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-09-28T16:23:49.079Z",
    "list_date": "",
    "days_on_market": 19,
    "description": "This traditional Colonial-style single-family home, built in 1992, is move in ready featuring hardwood floors, granite countertops, and central AC. While it’s ready to enjoy, as is, it also offers incredible potential with a bit of TLC, can transform it into something truly special. Offering over 1,800 square feet of living space, the home features 4 spacious bedrooms and 2.5 bathrooms, an unfinished large basement that can be turned into additional living space or an ADU, all set on a generous lot with ample parking and a private backyard full of potential. Just minutes from Centre Streets stores and restaurants as well as both the Lyndon K-8 and Kilmer K-8 Schools. Commuters will love the convenience of the Needham Line at West Roxbury Station right nearby - making trips to downtown Boston a breeze. Don't miss the chance to bring your vision to life in one of West Roxbury’s most desirable neighborhoods!",
    "listing_type": "For sale",
    "status": "Active",
    "title": null,
    "list_price": 699000,
    "price_per_sqft": 375.2012882447665
  },
  {
    "listing_id": "50d92a4bd17e4d8276f6efee693f232a3129c190",
    "property_id": "50d92a4bd17e4d8276f6efee693f232a3129c190",
    "batch_id": "2025-09-28_zips91",
    "source_id": "ddeb5b78-3ec6-4bef-bae8-56950c03c57f",
    "source_url": "https://www.zillow.com/homedetails/107-Stimson-St-West-Roxbury-MA-02132/59161200_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-09-28T16:24:20.361Z",
    "list_date": "2025-09-24",
    "days_on_market": 4,
    "description": "Charming and move-in ready, this updated Cape in the heart of West Roxbury offers 3 bedrooms, 2 full baths, and versatile living space indoors and out. A flexible floor plan includes a first-floor bedroom and full bath—perfect for guests or convenient one-level living—while two additional bedrooms and a second bath complete the upper level. The stylish kitchen features white shaker cabinetry, granite countertops, stainless steel appliances, and a generous breakfast bar. Step outside to a fenced backyard with two levels of outdoor living, ideal for entertaining, gardening, or simply relaxing. The finished lower level adds two bonus rooms for a home office, playroom, or guest space, along with plenty of storage. Additional highlights include modern light fixtures, tasteful updates throughout, and two off-street parking spaces. Now vacant! With shops, restaurants, parks, and public transit just minutes away, this home offers the perfect blend of comfort, convenience, and classic charm.",
    "listing_type": "for sale",
    "status": "active",
    "title": null,
    "list_price": 749000,
    "price_per_sqft": 440.5882352941176
  },
  {
    "listing_id": "fc2c92ad8473326649a058f1c3da4c0ac10d9f91",
    "property_id": "fc2c92ad8473326649a058f1c3da4c0ac10d9f91",
    "batch_id": "2025-09-28_zips91",
    "source_id": "a642418a-ed03-49ef-9555-195b058dad48",
    "source_url": "https://www.zillow.com/homedetails/37-Hastings-St-APT-103-West-Roxbury-MA-02132/59153378_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-09-28T16:24:57.883Z",
    "list_date": "2025-09-25",
    "days_on_market": 3,
    "description": "Spacious & inviting condominium in the charming, picturesque & in-demand 18-unit Hastings Court complex. Premium corner unit in sought-after neighborhood with 2 bedrooms, 2 baths, & 2 off-street deeded parking spaces in private rear lot. Central kitchen with good flow & function features updated wood cabinetry with crown moldings, Corian counters, & wall oven with gas range. Dining area offers bay window with seat. Abundant storage, central a/c, engineered wood laminate flooring, ceramic tile, louver window treatments, & laundry area. Elegant French doors lead to private, fenced-in “secret garden” patio area, with perennial greenery. Home may benefit from your finishing touches. Bonus designated private storage space in building's lower level for those priceless heirlooms that you’re just not ready to part with. Tremendous proximity to all the amenities that West Roxbury has to offer. So close to so much! Working hybrid? Commuter rail stops nearby. Prepare to relax & rejuvenate.",
    "listing_type": "sale",
    "status": "for sale",
    "title": null,
    "list_price": 595000,
    "price_per_sqft": 568.2903533906399
  },
  {
    "listing_id": "79f4c4f720fb2da2e55750cf49bd16ce0a3e375f",
    "property_id": "79f4c4f720fb2da2e55750cf49bd16ce0a3e375f",
    "batch_id": "2025-09-28_zips91",
    "source_id": "59154238",
    "source_url": "https://www.zillow.com/homedetails/72-Theodore-Parker-Rd-West-Roxbury-MA-02132/59154238_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-09-28T15:44:42.847Z",
    "list_date": "2025-09-24",
    "days_on_market": 4,
    "description": "This meticulously maintained English Tudor is located on a sought-after tree lined street. Offering 3+ bedrooms and 1.5 bathrooms, this residence blends traditional charm with modern updates. Step inside to find beautiful gumwood archways and period details that evoke timeless elegance. The inviting fireplace living room features stunning hardwood floors and a beamed ceiling, complemented by classic French doors that add to the home’s character. The updated kitchen and bathrooms reflect the pride of ownership, offering a perfect mix of functionality and style. With thoughtful updates throughout as well as an update to include a 2nd floor laundry with new washer & dryer, this home is move-in ready, offering modern comfort while retaining its historic appeal. Light filled four- season sunroom that leads to a private patio, one car garage & off-street parking. Convenience is key, with the home located within walking distance to local shops, restaurants, and public transportation.",
    "listing_type": "For sale",
    "status": "Active",
    "title": null,
    "list_price": 979000,
    "price_per_sqft": 636.5409622886866
  },
  {
    "listing_id": "edad3b2f8ffe12e9741a4d2daccdde8aff7e9dae",
    "property_id": "edad3b2f8ffe12e9741a4d2daccdde8aff7e9dae",
    "batch_id": "2025-09-28_zips91",
    "source_id": "73431115",
    "source_url": "https://www.zillow.com/homedetails/539-Lagrange-St-West-Roxbury-MA-02132/59157148_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-09-28T16:26:02.516Z",
    "list_date": "2025-09-16",
    "days_on_market": 12,
    "description": "Cozy bungalow's next chapter starts with you! Welcome to 539 Lagrange Street, exuding abundant charm. There is much to love from the french doors that greet you at the entry foyer to the wood burning fire place as the focal point of the large living room with built-in display cabinetry. Hardwood floors flow throughout the first floor with 2 spacious bedrooms, 1 full bath plus renovated kitchen open to the dining room with built in hutch. The first floor offers a convenient mini-split for cooling during the summer. Upstairs find 2 more bedrooms, a 1/2 bath and dedicated space for a home office or hang out nook. Other plusses include vinyl windows and siding, detached 1 car garage, abundant off-street parking, serene rear-yard patio space and newer boiler. Only 2/10s of a mile to WR Commuter Rail Station or easy access to Longwood Medical area. Close to Centre St. shops & restaurants plus abundant recreation spaces nearby.",
    "listing_type": "for sale",
    "status": "active",
    "title": null,
    "list_price": 679900,
    "price_per_sqft": 435.8333333333333
  },
  {
    "listing_id": "68ccef4db8e639272d1c8881e02459291bef13db",
    "property_id": "68ccef4db8e639272d1c8881e02459291bef13db",
    "batch_id": "2025-09-28_zips91",
    "source_id": "73435370",
    "source_url": "https://www.zillow.com/homedetails/55-Cottage-Rd-Boston-MA-02132/59161316_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-09-28T16:26:43.953Z",
    "list_date": "2025-09-24",
    "days_on_market": 4,
    "description": "Welcome to this stylish Colonial perched atop a tree-lined hill, on a quiet, private road in a prime location! This welcoming home offers a rare blend of privacy and convenience, minutes from shops, dining, transit, and highways. The sunny 3-season sun porch ushers you into the open, light-filled living area that flows from dining nook into the fully remodeled kitchen with quartz counters, stylish cabinetry, and Samsung stainless appliances. The 1st floor also features a thoughtfully re-designed full bath, and new laundry room with built-ins and added touches for modern convenience. Wood-look porcelain tile spans the main level, while the 2nd level showcases hardwoods across all 3 bedrooms and another beautifully updated full bath. Step outside to a maintenance-free composite deck overlooking the fenced backyard, where mature trees create a serene retreat. A newly paved 4-car driveway plus recent key system upgrades complete this move-in ready gem! This is the one!",
    "listing_type": "sale",
    "status": "for sale",
    "title": null,
    "list_price": 699900,
    "price_per_sqft": 469.7315436241611
  },
  {
    "listing_id": "2fe43198a9f4c0531f9b715b239338c380a18e6f",
    "property_id": "2fe43198a9f4c0531f9b715b239338c380a18e6f",
    "batch_id": "2025-09-28_zips91",
    "source_id": "59157364_zpid",
    "source_url": "https://www.zillow.com/homedetails/141-Bellevue-St-West-Roxbury-MA-02132/59157364_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-09-28T16:27:17.462Z",
    "list_date": "",
    "days_on_market": 5,
    "description": "OPEN HOUSE CANCELED! All of the work has been done for you in this charming move-in-ready home where commuter rail, shops and restaurants are a stroll away. Warm hardwoods and graceful staircase greet you in the foyer. French doors reveal a sun-drenched living room anchored by a wood-burning fireplace perfect for cozy winter afternoons. Sample charcuterie from the granite peninsula in the kitchen where two-toned cabinetry sets a chic tone. Share memorable meals in the dining room accented with wainscoting and built-in cabinet then linger on the sun porch bathed in golden light. Gather in the family room or take the party outside to your secret fenced-in garden complete with flowering trees, bushes and spaces for dining and firepit evenings. Upstairs three serene bedrooms and marble tiled bath pamper, and finished lower level offers office or gym flexibility. AN IRRESISTIBLE BLEND OF CHARACTER AND MODERN COMFORT…WELCOME HOME!",
    "listing_type": "For Sale",
    "status": "For Sale",
    "title": null,
    "list_price": 1050000,
    "price_per_sqft": 613.3177570093458
  },
  {
    "listing_id": "a2683ac17d510889dcd397bec32f49dcf0869597",
    "property_id": "a2683ac17d510889dcd397bec32f49dcf0869597",
    "batch_id": "2025-09-28_zips91",
    "source_id": "59157163_zpid",
    "source_url": "https://www.zillow.com/homedetails/79-Potomac-St-West-Roxbury-MA-02132/59157163_zpid/",
    "crawl_method": "firecrawl_v1",
    "scraped_timestamp": "2025-09-28T16:27:52.924Z",
    "list_date": "",
    "days_on_market": 10,
    "description": "Welcome to 79 Potomac St, West Roxbury, MA! This charming home offers a perfect blend of comfort and convenience. The main level presents a practical layout, including a versatile flex room ideal for a home office or playroom, alongside a convenient half bath. An oversized deck, located just off the dining room, is ideal for entertaining or simply relaxing while overlooking the expansive, fenced-in yard. The bedroom level features three good sized rooms, along with an updated, renovated bath. The walk-out basement, featuring another full bath, adds excellent bonus space for a guest suite or additional living area. Recent renovations include beautifully updated bathrooms, new flooring throughout, and stylish lighting, making this home move-in ready. Located just a third of a mile from the commuter rail, this home offers easy access to Boston while being located in a peaceful suburban-like setting. With its thoughtful updates and ideal location, 79 Potomac St is truly a must-see!",
    "listing_type": "For Sale",
    "status": "For Sale",
    "title": null,
    "list_price": 899000,
    "price_per_sqft": 483.3333333333333
  }
]